Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/general/known_issues.po
Languages: id

source: Known Issues
id: Masalah yang diketahui

source: **Population density grids must be in geographic coordinates**
id: **Grid kepadatan penduduk harus berada dalam koordinat geografi**

source: Currently, if population density grids are projected they won't be scaled correctly if resampled. See also ticket `#123 <https://github.com/AIFDR/inasafe/issues/123>`_
id: Saat ini, jika grid kepadatan penduduk tidak memiliki proyeksi yang sesuai maka skala menjadi tidak tepat. Lihat juga tiket `#123 <https://github.com/AIFDR/inasafe/issues/123>`_

source: **Help documentation has no style under windows**
id: **Dokumen bantuan tidak memiliki tipe dalam windows**

source: Currently if you open the help documentation for |project_name|, not styling is applied and images may not show, so it looks rather plain. We are working to fix this in a future release. See also ticket `#163 <https://github.com/AIFDR/inasafe/issues/163>`_
id: Saat ini jika Anda membuka dokumentasi bantuan untuk |project_name|, belum ada ragam yang diterapkan dan gambar mungkin tidak ditampilkan, jadi terlihat tampak kosong. Kami sedang bekerja untuk memperbaiki ini pada peluncuran yang akan datang. Lihat juga tiket `#163 <https://github.com/AIFDR/inasafe/issues/163>`_

source: Limitations
id: Batasan

source: |project_name| is still a new project. The current code development started in earnest in March 2011 and there is still much to be done. However, we work on the philosophy that stakeholders should have access to the development and source code from the very beginning and invite comments, suggestions and contributions.
id: |project_name| merupakan proyek baru. Kode yang sekarang sedang dikembangkan dengan sungguh-sungguh pada Maret 2011 dan masih ada banyak hal yang harus diperbaiki. Kami bekerja dengan filosofi bahwa para pemangku kepentingan harus memiliki akses untuk mengembangkan dan sumber kode dari awal dan meminta komentar, saran dan konribusi.

source: As such, |project_name| currently has some limitations, including
id: Dengan demikian, |project_name| masih memiliki beberapa batasan, termasuk

source: Exposure data in the form of roads (or any other line feature) is not supported.
id: Data keterpaparan dalam bentuk jalan (atau fitur garis lainnya) tidak didukung.

source: Polygon area analysis (such as land use) is not supported.
id: Analisis area poligon (seperti penggunaan tanah) tidak didukung.

source: Population density data must be provided in WGS84 geographic coordinates
id: Data kepadatan penduduk harus tersedia dalam proyeksi koordinat geografi WGS84

source: Neither |AIFDR|, the World Bank, nor |GFDRR| take any responsibility for the correctness of outputs from |project_name| or decisions derived as a consequence
id: Baik |AIFDR|, Bank Dunia ataupun |GFDRR| bertanggungjawab untuk kebenaran hasil dari |project_name| atau keputusan yang diturunkan sebagai konsekuensi
