Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/general/news.po
Languages: id

source: News
id: Berita

source: May 27, 2013
id: 27 Mei 2013

source: Source: `FutureGov <http://www.futuregov.asia/articles/2013/may/27/philippines-adopts-indonesias-open-source-disaster/>`_ , by Clarice Africa
id: Sumber: `FutureGov <http://www.futuregov.asia/articles/2013/may/27/philippines-adopts-indonesias-open-source-disaster/>`_ , oleh Clarice Africa

source: The Philippines adopts Indonesia’s open source disaster mitigation tool
id: Filipina mengadaptasi alat mitigasi bencana open source Indonesia

source: `The Department of Science and Technology <http://www.dost.gov.ph/>`_ revealed plans to adopt |project_name|, a disaster mitigation technology from Indonesia, to its `Nationwide Operational Assessment of Hazard <http://noah.dost.gov.ph/>`_ (NOAH) project in a bid to improve disaster planning and preparedness in the country.
id: `Department of Science and Technology <http://www.dost.gov.ph/>`_ mengungkapkan rencana untuk mengadopsi |project_name|, teknologi mitigasi bencana dari Indonesia, kepada para `Nationwide Operational Assessment of Hazard <http://noah.dost.gov.ph/>`_ (NOAH) proyek dalam upaya untuk meningkatan perencanaan dan kesiapsiagaan di negara rawan bencana.

source: |project_name|, or Indonesia Scenario Assessment for Emergency, is an open source software that produces realistic natural hazard impact scenarios to help decision makers in their disaster planning, preparedness and response activities.
id: |project_name|, atau Indonesia Scenario Assessment for Emergency adalah perangkat lunak open source yang menghasilkan skenario dampak bencana alam untuk membantu pengambilan keputusan pada perencanaan, kesiapsiagaan, dan tanggap darurat bencana mereka.

source: It combines data from various authoritative sources to provide insights into the likely impacts of future disaster events. The software is focused on examining, in detail; the impacts by a single hazard would have on specific sectors. It gives users a heightened situational awareness of the areas affected and those that are likely to be affected, how many people will need to be evacuated and what roads will be closed among others.
id: Hal ini menggabungkan data dari berbagai sumber otoritatif untuk memberikan wawasan ke dalam kemungkinan dampak peristiwa bencana di masa depan. Perangkat lunak difokuskan pada pemeriksaan, dalam rincian; dampak dengan ancaman tunggal akan pada sektor-sektor tertentu. Hal ini memberikan kesadaran kondisional yang tinggi bagi pengguna terhadap area terdampak dan populasi yang kemungkinan akan terdampak, berapa banyak orang yang membutuhkan untuk dievakuasi, dan jalan mana saja yang akan ditutup.

source: According to an official statement, NOAH will adopt Indonesia’s |project_name| because it has a lot in common with the Philippines, especially in topography and natural hazards.
id: Menurut pernyataan resmi, NOAH akan mengadopsi |project_name| Indonesia karena hal tersebut memiliki banyak kesamaan dengan Filipina, khususnya pada topografi dan bencana alam.

source: Abigail Baca, disaster and risk management officer of the World Bank East Asia and Pacific Region said that InaSAFE proved effective during the recent floods in Jakarta, Indonesia and it can be applied in the Philippines.
id: Abigail Baca, pejabat manajemen risiko dan bencana dari World Bank Wilayah Asia Timur dan Pasifik mengatakan bahwa InaSAFE terbukti lebih efektif selama banjir di Jakarta, Indonesia dan hal ini dapat diaplikasikan di Filipina.

source: Meanwhile, Dr. Alfredo Francisco Mahar Lagmay of Project NOAH disclosed that |project_name| will be integrated into Project NOAH to supplement existing technologies used to mitigate, if not totally prevent, massive destruction caused by strong typhoons similar to tropical storm Washi in 2011 and Bopha in December 2012.
id: Sementara itu, Dr. Alfredo Francisco Mahar Lagmay dari Projek NOAH diungkapkan bahwa |project_name| akan diintegrasi ke dalam Proyek NOAH untuk melengkapi teknologi yang ada digunakan untuk mitigasi, jika tidak benar-benar mencegah, kerusakan besar yang disebabkan oleh topan yang kuat seperti badai tropis Washi pada 2011 dan Bopha pada desember 2012.

source: “It is important to develop information tools that will help centralise risk information at the NOAH website and make them available to a wider community,” he said.
id: "Hal ini penting untuk mengembangkan alat informasi yang akan membantu pemusatan informasi risiko di website NOAH dan ini tersedia untuk masyarakat luas," katanya.

source: |project_name| is available free of charge. Interested parties can get the code from `GitHub <https://github.com/AIFDR/inasafe#readme>`_.
id: |project_name| tersedia gratis. Pihak yang berminat bisa mendapatkan kode dari `GitHub <https://github.com/AIFDR/inasafe#readme>`_.

source: Source: `Philippine Canadian Inquirer <http://www.canadianinquirer.net/portal.php?mod=view&aid=2362>`_ , by Katherine Marfal-Teves
id: Sumber: `Philippine Canadian Inquirer <http://www.canadianinquirer.net/portal.php?mod=view&aid=2362>`_ , oleh Katherine Marfal-Teves

source: DOST’s Project NOAH adopts Indonesian technology for disaster mitigation
id: DOST proyek NOAH mengadopsi teknologi Indonesia untuk mitigasi bencana

source: The Department of Science and Technology’s (DOST) Project NOAH (Nationwide Operational Assessment of Hazards) is adopting the disaster mitigating technology called |project_name| from Indonesia. |project_name| is an acronym for Indonesia Scenario Assessment for Emergency.
id: Department of Science and Technology’s (DOST) Proyek NOAH (Nationwide Operational Assessment of Hazards) mengadopsi teknologi mtigasi bencana yang bernama |project_name| dari Indonesia. |project_name| adalah singkatan untuk Indonesia Scenario Assessment for Emergency.

source: It is an open source technology, which means it is free, readily accessed from the internet and may be modified by users. With this technology, data coming from weather scientists, local government units and communities are gathered and consolidated to provide accurate information on future disaster events. NOAH adopted Indonesias’s InaSAFE as it has a lot in common with the Philippines, especially in topography and natural hazards. This was disclosed during the multi-stakeholder assembly titled “Enhancing Community Resilience Through the Use of New Technology” conducted by Project NOAH.
id: Hal ini adalah teknologi open source, yang berarti gratis, mudah diakses dari internet dan mungkin dimodifikasi oleh pengguna. Dengan teknologi ini, data yang berasal dari para ilmuwan cuaca, unit pemerintah daerah, dan komunitas dikumpulkan dan dikonsolidasikan untuk memberikan informasi akurat pada peristiwa bencana yang akan datang. NOAH mengadopsi InaSAFE Indonesia yang memiliki berbagai banyak kesamaan dengan Filipina, khususnya pada topografi dan bencana alamnya. Hal ini diungkapkan saat perakitan multi-pemangku kepentingan yang berjudul “Meningkatkan Ketahanan Masyarakat melalui Penggunaan Teknologi Baru“ yang dilakukan oleh Proyek NOAH.

source: Abigail Baca, disaster and risk management officer of the World Bank East Asia and Pacific Region said that |project_name| proved effective during the recent floods in Jakarta and Indonesia; thus, they arrived at a conclusion that it can be likewise applied in the Philippines.
id: Abigail Baca, pejabat manajemen risiko dan bencana dari World Bank Wilayah Asia Timur dan Pasifik mengungkapkan bahwa |project_name| terbukti efektif saat banjir di Jakarta dan Indonesia; dengan demikian, mereka berangkat dari kesimpulan bahwa hal itu dapat juga diaplikasikan di Filipina.

source: Dr. Alfredo Francisco Mahar Lagmay of Project NOAH disclosed that InaSAFE will be integrated into Project NOAH to supplement existing technologies used to mitigate, if not totally prevent, massive destruction caused by strong typhoons similar to Sendong in 2011and Pablo in December 2012.
id: Dr. Alfredo Francisco Mahar Lagmay Proyek NOAH mengungkapkan bahwa InaSAFE akan diintegrasika ke dalam Proyek NOAH untuk melengkapi teknologi yang ada digunakan untuk mitigasi, jika tidak benar-benar mencegah, kerusakan besar yang disebabkan oleh topan yang kuat seperti Sendong pada 2011 dan Pablo pada Desember 2012.

source: During his presentation, Dr. Lagmay said, “It is important to develop information tools that will help centralize risk information at the NOAH website and make them available to a wider community.” Since its launch in July 2012 in Marikina City, Project NOAH has continuously upgraded and strengthened its capability through the installation of various weather forecasting equipment in various disaster-prone areas in the country. Among these are the Hydromet water level sensors and Doppler radars used to measure the amount of rainfall in a specific area.
id: Selama presentasinya, Dr. Lagmay berkata, “Hal ini sangat penting untuk mengembangkan alat informasi yang akan membantu pemusatan informasi risiko di website NOAH dan akan disediakan untuk masyarakat luas.” Sejak diluncurkan pada Juli 2012 di Kota Marinka. Proyek NOAH telah terus ditingkatkan dan dikuatkan kemampuan melalui pemasangan berbagai jenis peralatan perkiraan cuaca di berbagai wilayah rawan bencana Filipina. Diantaranya adalah sensor level air Hydromet dan radar Doppler digunakan untuk mengukur jumlah curah hujan di area tertentu.

source: To date, there are 525 Hydromet sensors installed in different river systems, including those in Tullahan River, Marikina River and San Juan River in Metro Manila. Likewise, the Project NOAH team has put up billboards in Pampanga showing flood maps to inform residents of the high-risk areas in their communities.
id: Untuk saat ini, ada 525 sensor Hydromet yang dipasang di sistem sungai yang berbeda, termasuk di Sungai Tullahan, Sungai Marikina, dan Sungai San Juan di Metro Manila. Demikian juga, tim Proyek NOAH telah memasang baliho di Pampanga yang menunjukkan peta banjir untuk informasi penduduk daerah berisiko tinggi di masyarakat mereka.

source: Further, Dr. Enrico C. Paringit, project leader of NOAH’s DREAM LiDAR (Disaster Risk and Exposure Assessment for Mitigation-Light Detection and Ranging) said, “ Since November 2012, we were able to do three-dimensional or 3D mapping of the Pampanga river basin, Agno River, Cagayan de Oro and Iligan. By the end of May this year, 3D mapping for Iloilo will be complete and next in line is the Panay river basin.”
id: Selanjutnya, Dr. Enrico C. Paringit, ketua proyek NOAH DREAM LiDAR (Disaster Risk and Exposure Assessment for Mitigation-Light Detection and Ranging) mengatakan, “Sejak November 2012, kami mampu melakukan pemetaan 3D atau tiga dimensi pada DAS Pampanga, Sungai Agno, Cagayan de Oro dan Iligan. Pada akhir Mei tahun ini, pemetaan 3D untuk Iloilo akan dilengkapi dan selanjutnya di sepanjang DAS Panay.”

source: With Reports from DOST
id: Dengan Laporan dari DOST
