Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/impact-function-docs/CategorisedHazardPopulationImpactFunction.po
Languages: id

source: Categorised Hazard Population Impact Function
id: Kategorisasi Fungsi Dampak Bencana Terhadap Penduduk

source: Overview
id: Gambaran umum

source: **Unique Identifier**: Categorised Hazard Population Impact Function
id: **Identifikasi Unik**: Kategorisasi Fungsi Dampak Bencana Terhadap Penduduk

source: **Author**: AIFDR
id: **Dibuat oleh**: AIFDR

source: **Title**: Be impacted
id: **Judul**: Terdampak

source: **Synopsis**: To assess the impacts of categorized hazards in raster format on population raster layer.
id: **Sinopsis**: Untuk menghitung dampak ancaman yang dikategorikan dalam format raster pada layer raster populasi.

source: **Actions**: Provide details about how many people would likely need to be impacted for each category.
id: **Aksi**: Menyediakan rincian mengenai berapa banyak orang yang akan terdampak untuk setiap kategori.

source: **Hazard Input**: A hazard raster layer where each cell represents the category of the hazard. There should be 3 categories: 1, 2, and 3.
id: **Masukan Bencana**: Layer raster ancaman dimana setiap sel mewakili kategori ancaman. Harus terdapat 3 kategori: 1, 2, dan 3.

source: **Exposure Input**: An exposure raster layer where each cell represent population count.
id: **Input Keterpaparan**: Layer data keterpaparan berjenis raster dimana setiap sel mewakili jumlah populasi penduduk.

source: **Output**: Map of population exposed to high category and a table with number of people in each category
id: **Hasil**: Peta populasi terkena kategori tinggi dan tabel dengan jumlah orang di setiap kategorinya

source: **Limitation**: The number of categories is three.
id: **Batasan**: Jumlah kategori ada tiga.

source: Details
id: Detail

source: This function will calculate how many people will be impacted per each category for all categories in the hazard layer. Currently there should be 3 categories in the hazard layer. After that it will show the result and the total amount of people that will be impacted for the hazard given.
id: Fungsi ini akan menghitung berapa banyak orang yang akan terkena dampak per setiap kategori untuk semua kategori pada layer ancaman. Saat ini seharusnya terdapat 3 kategori pada layer data ancaman. Setelah itu akan muncul hasil dan jumlah orang yang akan terkena dampak berdasarkan ancaman yang diberikan.

source: Doc String
id: String Dokumen

source: Plugin for impact of population as derived by categorised hazard.
id: Plugin untuk dampak populasi diperoleh dari ancaman diketegorikan.

source: :author AIFDR :rating 2 :param requires category=='hazard' and unit=='normalised' and layertype=='raster'
id: :author AIFDR :rating 2 :param membutuhkan category=='hazard' dan unit=='normalised' dan layertype=='raster'

source: :param requires category=='exposure' and subcategory=='population' and layertype=='raster'
id: :param membutuhkan category=='exposure' dan subcategory=='population' dan layertype=='raster'
