Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/impact-function-docs/EarthquakeBuildingImpactFunction.po
Languages: id

source: Earthquake Building Impact Function
id: Fungsi Bangunan Terdampak Gempa Bumi

source: Overview
id: Gambaran umum

source: **Unique Identifier**: Earthquake Building Impact Function
id: **Identifikasi Unik**: Fungsi Bangunan Terdampak Gempa Bumi

source: **Title**: Be affected
id: **Judul**: Terdampak

source: Details
id: Rincian

source: No documentation found
id: Tidak ditemukan dokumentasi

source: Doc String
id: String Dokumen

source: Earthquake impact on building data.
id: Dampak gempa bumi pada data bangunan.

source: :param requires category=='hazard' and subcategory=='earthquake'
id: :param membutuhkan category=='hazard' dan subcategory=='earthquake'

source: :param requires category=='exposure' and subcategory=='structure' and layertype=='vector'
id: :param membutuhkan category=='exposure' dan subcategory=='structure' dan layertype=='vector'
