Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/impact-function-docs/FloodBuildingImpactFunction.po
Languages: id

source: Flood Building Impact Function
id: Fungsi Bangunan Terdampak Banjir

source: Overview
id: Gambaran umum

source: **Unique Identifier**: Flood Building Impact Function
id: **Identifikasi Unik**: Fungsi Bangunan Terdampak Banjir

source: **Author**: Ole Nielsen, Kristy van Putten
id: **Pembuat**: Ole Nielsen, Kristy Van Putten

source: **Title**: Be flooded
id: **Judul**: Terdampak Banjir

source: **Synopsis**: To assess the impacts of (flood or tsunami) inundation on building footprints originating from OpenStreetMap (OSM).
id: **Sinopsis**: Untuk menilai dampak genangan (banjir atau tsunami) terhadap gambaran bangunan yang berasal dari OpenStreetMap (OSM).

source: **Actions**: Provide details about where critical infrastructure might be flooded
id: **Actions**: Menyediakan rincian mengenai dimana infrastruktur kritis yang mungkin tergenang banjir

source: **Hazard Input**: A hazard raster layer where each cell represents flood depth (in meters), or a vector polygon layer where each polygon represents an inundated area. In the latter case, the following attributes are recognised (in order): "affected" (True or False) or "FLOODPRONE" (Yes or No). (True may be represented as 1, False as 0
id: **Input Ancaman**: Layer raster ancaman dimana setiap sel mewakili kedalaman banjir (dalam meter), atau layer vektor poligon dimana setiap poligon mewakili area yang tergenang. Dalam kasus terakhir, atribut berikut dikenal (dalam urutan): "affected" (True atau False) atau "FLOODPRONE" (Yes atau No). (True bisa diwakilkan sebagai 1, False sebagai 0

source: **Exposure Input**: Vector polygon layer extracted from OSM where each polygon represents the footprint of a building.
id: **Input Paparan**: Layer vektor poligon yang diekstrak dari OSM dimana setiap poligon mewakili gambaran dari sebuah bangunan.

source: **Output**: Vector layer contains building is estimated to be flooded and the breakdown of the building by type.
id: **Output**: Layer vektor berisi bangunan yang diperkirakan akan terkena banjir dan kerusakan bangunan menurut jenis bangunannya.

source: **Limitation**: This function only flags buildings as impacted or not either based on a fixed threshold in case of raster hazard or the the attributes mentioned under input in case of vector hazard.
id: **Batasan**: Fungsi ini hanya memberi tanda bangunan sebagai terdampak atau tidak berdasarkan ambang batas yang ditetapkan untuk kasus ancaman (raster data) atau data atribut yang telah dilengkapi saat input data untuk kasus ancaman (vektor data).

source: Details
id: Detail

source: The inundation status is calculated for each building (using the centroid if it is a polygon) based on the hazard levels provided. if the hazard is given as a raster a threshold of 1 meter is used. This is configurable through the InaSAFE interface. If the hazard is given as a vector polygon layer buildings are considered to be impacted depending on the value of hazard attributes (in order) "affected" or "FLOODPRONE": If a building is in a region that has attribute "affected" set to True (or 1) it is impacted. If attribute "affected" does not exist but "FLOODPRONE" does, then the building is considered impacted if "FLOODPRONE" is "yes". If neither "affected" nor "FLOODPRONE" is available, a building will be impacted if it belongs to any polygon. The latter behaviour is implemented through the attribute "inapolygon" which is automatically assigned.
id: Status genangan dihitung untuk setiap bangunan (menggunakan sentroid jika berupa poligon) berdasarkan tingkat bahaya disediakan. Apabila bahaya tersebut diberikan sebagai raster maka ambang batas 1 meter digunakan. Hal ini dapat dikonfigurasi melalui antarmuka InaSAFE. Jika bahaya diberikan sebagai bangunan poligon vektor lapisan dianggap terpengaruh tergantung pada nilai atribut bahaya (dalam urutan) "affected" atau "FLOODPRONE": Jika sebuah bangunan di wilayah yang memiliki atribut "affected" bernilai True (atau 1) maka bangunan itu terkena dampak. Jika atribut "terkena" tidak ada tapi "FLOODPRONE" ada, maka bangunan dianggap berdampak jika "FLOODPRONE" bernila "yes". Jika tidak ada "affected" atau "FLOODPRONE" yang tersedia, bangunan akan terkena dampak jika dimiliki oleh poligon manapun. Perilaku yang terakhir diimplementasikan melalui "" atribut inapolygon yang secara otomatis ditetapkan.

source: Inundation impact on building data
id: Dampak genangan pada data bangunan

source: :author Ole Nielsen, Kristy van Putten # this rating below is only for testing a function, not the real one :rating 0 :param requires category=='hazard' and subcategory in ['flood', 'tsunami']
id: :author Ole Nielsen, Kristy van Putten # penilaian di bawah ini hanya untuk menguji fungsi, bukan yang sebenarnya :rating 0 :param membutuhkan category=='hazard' dan subcategory dalam ['flood', 'tsunami']

source: :param requires category=='exposure' and subcategory=='structure' and layertype=='vector'
id: :param membutuhkan category=='exposure' dan subcategory=='structure' dan layertype=='vector'
