Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/impact-function-docs/FloodEvacuationFunction.po
Languages: id

source: Flood Evacuation Function
id: Fungsi Evakuasi Banjir

source: Overview
id: Gambaran umum

source: **Unique Identifier**: Flood Evacuation Function
id: **Identifikasi Unik**: Fungsi Evakuasi Banjir

source: **Author**: AIFDR
id: **Pembuat**: AIFDR

source: **Title**: Need evacuation
id: **Judul**: Butuh Evakuasi

source: **Synopsis**: To assess the impacts of (flood or tsunami) inundation in raster format on population.
id: **Sinopsis**: Untuk menghitung dampak genangan (banjir atau tsunami) dalam format raster pada penduduk.

source: **Actions**: Provide details about how many people would likely need to be evacuated, where they are located and what resources would be required to support them.
id: **Tindakan**: Menyediakan rincian mengenai berapa banyak orang yang perlu dievakuasi, dimana lokasi keberadaan mereka dan sumber daya apa yang dibutuhkan untuk mendukung keselamatan mereka.

source: **Hazard Input**: A hazard raster layer where each cell represents flood depth (in meters).
id: **Input Ancaman**: Layer raster ancaman dimana setiap sel mewakili kedalaman banjir (dalam meter).

source: **Exposure Input**: An exposure raster layer where each cell represent population count.
id: **Input Keterpaparan**: Layer data keterpaparan berjenis raster data dimana setiap sel mewakili sejumlah populasi penduduk.

source: **Output**: Raster layer contains population affected and the minimum needs based on the population affected.
id: **Output**: Layer raster berisi penduduk terdampak dan kebutuhan minimum berdasarkan pada penduduk terdampak.

source: **Limitation**: The default threshold of 1 meter was selected based on consensus, not hard evidence.
id: **Batasan**: Ambang batas standar 1 meter telah dipilih berdasarkan pada kesepakatan, bukan bukti yang nyata.

source: Details
id: Detail

source: The population subject to inundation exceeding a threshold (default 1m) is calculated and returned as a raster layer. In addition the total number and the required needs in terms of the BNPB (Perka 7) are reported. The threshold can be changed and even contain multiple numbers in which case evacuation and needs are calculated using the largest number with population breakdowns provided for the smaller numbers. The population raster is resampled to the resolution of the hazard raster and is rescaled so that the resampled population counts reflect estimates of population count per resampled cell. The resulting impact layer has the same resolution and reflects population count per cell which are affected by inundation.
id: Subyek populasi yang terkena genangan yang melebihi ambang batas (pengaturan awal adalah 1m) dihitung dan dikembalikan sebagai layer data raster. Selain itu, jumlah dan kebutuhan yang diperlukan sesuai aturan BNPB (Perka 7) dilaporkan. Ambang batas dapat diubah dan bahkan mengandung beberapa nilai dalam hal evakuasi dan kebutuhan dihitung menggunakan jumlah terbesar dengan populasi diperinci untuk jumlah yang lebih kecil. Layer data raster populasi diresampling dengan resolusi raster data ancaman dan direscaling sehingga jumlah populasi hasil resampling mencerminkan perkiraan jumlah populasi per sel dapat diresampling. Layer data dampak yang dihasilkan memiliki resolusi yang sama dan mencerminkan jumlah penduduk per sel yang dipengaruhi oleh adanya genangan.

source: Impact function for flood evacuation
id: Fungsi dampak untuk evakuasi banjir

source: :author AIFDR :rating 4 :param requires category=='hazard' and subcategory in ['flood', 'tsunami'] and layertype=='raster' and unit=='m'
id: :author AIFDR :rating 4 :param membutuhkan category=='hazard' dan subkategori pada ['flood', 'tsunami'] dan layertype=='raster' dan unit=='m'

source: :param requires category=='exposure' and subcategory=='population' and layertype=='raster'
id: :param membutuhkan category=='exposure' dan subcategory=='population' dan layertype=='raster'
