Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/impact-function-docs/ITBFatalityFunction.po
Languages: id

source: I T B Fatality Function
id: Fungsi Korban ITB

source: Overview
id: Gambaran umum

source: **Unique Identifier**: I T B Fatality Function
id: **Identifikasi Unik**: Fungsi Korban ITB

source: **Author**: Hadi Ghasemi
id: **Pembuat**: Hadi Ghasemi

source: **Title**: Die or be displaced
id: **Judul**: Meninggal atau mengungsi

source: **Synopsis**: To asses the impact of earthquake on population based on earthquake model developed by ITB
id: **Sinposis**: Untuk menjalankan dampak gempa bumi pada populasi berdasarkan model gempa bumi yang dikembangkan oleh ITB

source: **Actions**: Provide details about the population will be die or displaced
id: **Aksi**: Menyediakan detil tentang populasi yang akan meninggal dunia atau mengungsi

source: **Citations**:
id: **Kutipan**:

source: **Limitation**:
id: **Batasan**:

source: The model is based on limited number of observed fatality rates during 4 past fatal events.
id: Model ini berdasarkan pada jumlah korban jiwa terbatas sewaktu 4 kejadian fatal yang telah terjadi.

source: The model clearly over-predicts the fatality rates at intensities higher than VIII.
id: Model secara jelas memprediksi jumlah korban jiwa secara berlebih pada intensitas yang lebih tinggi daripada VIII.

source: The model only estimates the expected fatality rate for a given intensity level; however the associated uncertainty for the proposed model is not addressed.
id: Model ini hanya memperkirakan jumlah korban yang diperkirakan untuk satu tingkat intensitas; bagaimanapun hubungan ketidakyakinan untuk model yang diajukan tidak dilakukan.

source: There are few known mistakes in developing the current model:
id: Terdapat beberapa kesalahan yang diketahui pada model yang sedang dikembangkan saat ini:

source: rounding MMI values to the nearest 0.5,
id: nilai MMI berkisar paling dekat 0.5,

source: Implementing Finite-Fault models of candidate events, and
id: Mengimplementasikan model Finite-Fault untuk kandidat kejadian, dan

source: consistency between selected GMPEs with those in use by BMKG.
id: konsistensi antara GMPEs yang terpilih dengan hal itu digunakan oleh BMKG.

source: Details
id: Rincian

source: This model was developed by Institut Teknologi Bandung (ITB) and implemented by Dr. Hadi Ghasemi, Geoscience Australia Algorithm: In this study, the same functional form as Allen (2009) is adopted o express fatality rate as a function of intensity (see Eq. 10 in the report). The Matlab built-in function (fminsearch) for Nelder-Mead algorithm was used to estimate the model parameters. The objective function (L2G norm) that is minimized during the optimisation is the same as the one used by Jaiswal et al. (2010). The coefficients used in the indonesian model are x=0.62275231, y=8.03314466, zeta=2.15
id: Model ini telah dikembangkan oleh Intsitut Teknologi Bandung (ITB) dan diimplementasikan oleh Dr Hadi Ghasemi, Geoscience Australia Algorithm: Pada studi ini, bentuk fungsi yang sama sebagaimana yang diadopsi oleh Allen (2009), mengekspresikan nilai korban jiwa sebagaimana fungsi dari intensitas (lihat Eq. 10 pada laporan). Fungsi Matlab yang telah terintegrasi (fminsearch) untuk algoritma Nelder-Mead telah digunakan untuk memperkirakan parameter model. Tujuan dari fungsi (L2G norm) adalah untuk meminimalkan pada saat optimalisasi adalah sama dengan satu fungsi yang telah digunakan oleh Jaiswal et al. (2010). Koefisien yang digunakan di model Indonesia adalah x=0.62275231, y=8.03314466, zeta=2.15

source: Indonesian Earthquake Fatality Model
id: Model Jumlah Korban Jiwa Akibat Gempa Bumi Indonesia

source: This model was developed by Institut Teknologi Bandung (ITB) and implemented by Dr. Hadi Ghasemi, Geoscience Australia.
id: Model ini telah dikembangkan oleh Institut Teknologi Bandung (ITB) dan diimplementasikan oleh Dr Hadi Ghasemi, Geoscience Australia.

source: Reference:
id: Referensi:

source: Algorithm:
id: Algoritma:

source: In this study, the same functional form as Allen (2009) is adopted to express fatality rate as a function of intensity (see Eq. 10 in the report). The Matlab built-in function (fminsearch) for Nelder-Mead algorithm was used to estimate the model parameters. The objective function (L2G norm) that is minimised during the optimisation is the same as the one used by Jaiswal et al. (2010).
id: Pada studi ini, bentuk fungsi yang sama sebagaimana yang diadopsi oleh Allen (2009), mengekspresikan nilai korban jiwa sebagaimana fungsi dari intensitas (lihat Eq. 10 pada laporan). Fungsi Matlab yang telah terintegrasi (fminsearch) untuk algoritma Nelder-Mead telah digunakan untuk memperkirakan parameter model. Tujuan dari fungsi (L2G norm) adalah untuk meminimalkan pada saat optimalisasi adalah sama dengan satu fungsi yang telah digunakan oleh Jaiswal et al. (2010).

source: The coefficients used in the indonesian model are x=0.62275231, y=8.03314466, zeta=2.15
id: Koefisien yang digunakan pada model Indonesia adalah x=0.62275231, y=8.03314466, zeta=2.15

source: Caveats and limitations:
id: Peringatan dan batasan:

source: The current model is the result of the above mentioned workshop and reflects the best available information. However, the current model has a number of issues listed below and is expected to evolve further over time.
id: Model saat ini merupakan hasil dari lokakarya yang disebutkan di atas dan merefleksikan informasi tersedia yang terbaik. Bagaimanapun, model saat ini memiliki sejumlah isu yang terdafar seperti di bawah ini dan kemungkinan akan berubah sepanjang waktu.

source: 1 - The model is based on limited number of observed fatality
id: 1 - model ini berdasarkan jumlah korban jiwa yang diketahui secara terbatas

source: rates during 4 past fatal events.
id: tingkat saat 4 kejadian fatal yang lalu.

source: 2 - The model clearly over-predicts the fatality rates at
id: 2 - model secara jelas memprediksi berlebih jumlah korban jiwa pada

source: intensities higher than VIII.
id: intensitas yang lebih tinggi dari VIII.

source: 3 - The model only estimates the expected fatality rate for a given
id: 3 - model hanya memperkirakan jumlah korban jiwa yang diduga untuk satu

source: intensity level; however the associated uncertainty for the proposed model is not addressed.
id: tingkat intensitas yang diberikan; bagaimanapun hubungan ketidakyakinan untuk model yang diajukan tidak dilakukan

source: 4 - There are few known mistakes in developing the current model:
id: 4 - terdapat beberapa kesalahan yang diketahui pada model yang sedang dikembangkan saat ini:

source: consistency between selected GMPEs with those in use by BMKG. These issues will be addressed by ITB team in the final report.
id: konsistensi antara GMPEs yang terpilih dengan hal itu digunakan oleh BMKG. Masalah ini akan dijelaskan oleh tim ITB pada laporan final.

source: Note: Because of these caveats, decisions should not be made solely on the information presented here and should always be verified by ground truthing and other reliable information sources.
id: Catatan: Karena perkiraan ini, keputusan seharusnya tidak dibuat sepenuhnya pada informasi yang digambarkan di sini dan harus selalu di verifikasi dengan survey lapangan dan sumber-sumber informasi terpercaya lainnya.

source: :author Hadi Ghasemi :rating 3
id: :penulis Hadi Ghasemi :rating 3

source: :param requires category=='hazard' and subcategory=='earthquake' and layertype=='raster' and unit=='MMI'
id: :param membutuhkan category=='hazard' dan subcategory=='earthquake' dan layertype=='raster' dan unit=='MMI'

source: :param requires category=='exposure' and subcategory=='population' and layertype=='raster'
id: :param membutuhkan category=='exposure' dan subcategory=='population' dan layertype=='raster'
