Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/impact-function-docs/PAGFatalityFunction.po
Languages: id

source: P A G Fatality Function
id: Fungsi Korban P A G

source: Overview
id: Gambaran umum

source: **Unique Identifier**: P A G Fatality Function
id: **Identifikasi Unik**: Fungsi Korban P A G

source: **Author**: Helen Crowley
id: **Pembuat**: Helen Crowley

source: **Title**: Die or be displaced according Pager model
id: **Judul**: Meninggal atau diungsikan berdasarkan model Pager

source: **Synopsis**: To assess the impact of earthquake on population based on Population Vulnerability Model Pager
id: **Sinopsis**: Untuk menghitung dampak gempa bumi berdasarkan Model Pager Populasi Kerentanan

source: **Actions**: Provide details about the population will be die or displaced
id: **Aksi**: Menyediakan detil/rincian tentang populasi yang akan meninggal dunia atau mengungsi

source: **Citations**:
id: **Kutipan**:

source: Jaiswal, K. S., Wald, D. J., and Hearne, M. (2009a). Estimating casualties for large worldwide earthquakes using an empirical approach. U.S. Geological Survey Open-File Report 2009-1136.
id: Jaiswal, K. S., Wald, D. J., dan Hearne, M. (2009a). Estimating casualties for large worldwide earthquakes using an empirical approach. U.S. Geological Survey Open-File Report 2009-1136.

source: **Limitation**: No documentation found
id: **Pembatasan**: Tidak ditemukan dokumentasi

source: Details
id: Detil/rincian

source: No documentation found
id: Dokumentasi tidak ditemukan

source: Doc String
id: String Dokumen

source: Population Vulnerability Model Pager.
id: Model Pager Populasi Kerentanan

source: :param requires category=='hazard' and subcategory=='earthquake' and layertype=='raster' and unit=='MMI'
id: :param membutuhkan category=='hazard' dan subcategory=='earthquake' dan layertype=='raster' dan unit=='MMI'

source: :param requires category=='exposure' and subcategory=='population' and layertype=='raster'
id: :param membutuhkan category=='exposure' dan subcategory=='population' dan layertype=='raster'
