Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/impact-function-docs/VolcanoPolygonHazardPopulation.po
Languages: id

source: Volcano Polygon Hazard Population
id: Poligon Ancaman Gunung Berapi untuk Penduduk

source: Overview
id: Gambaran umum

source: **Unique Identifier**: Volcano Polygon Hazard Population
id: **Identifikasi Unik**: Poligon Bahaya Gunung Berapi untuk Penduduk

source: **Author**: AIFDR
id: **Pembuat**: AIFDR

source: **Title**: Need evacuation
id: **Title**: Butuh Evakuasi

source: **Synopsis**: To assess the impacts of volcano eruption on population.
id: **Sinopsis**: Untuk penilaian dampak dari erupsi gunung berapi pada penduduk.

source: **Actions**: Provide details about how many population would likely be affected by each hazard zones.
id: **Actions**: Menyediakan rincian mengenai berapa banyak jumlah penduduk yang akan terdampak di setiap zona ancaman.

source: **Hazard Input**: A hazard vector layer can be polygon or point. If polygon, it must have "KRB" attribute and the valuefor it are "Kawasan Rawan Bencana I", "Kawasan Rawan Bencana II", or "Kawasan Rawan Bencana III."If you want to see the name of the volcano in the result, you need to add "NAME" attribute for point data or "GUNUNG" attribute for polygon data.
id: **Input Ancaman**: Layer vektor ancaman dapat berupa poligon atau titik. Jika poligon, ini harus memiliki atribut "KRB" dan nilai untuk ini adalah "Kawasan Rawan Bencana I", "Kawasan Rawan Bencana II", atau "Kawasan Rawan Bencana III." Jika Anda ingin melihat nama gunung berapi pada hasilnya, Anda perlu menambahkan atribut "NAME" untuk data titik atau atribut "GUNUNG" untuk data poligon.

source: **Exposure Input**: An exposure raster layer where each cell represent population count.
id: **Exposure Input**: Layer data keterpaparan berjenis raster dimana setiap sel mewakili sejumlah populasi penduduk.

source: **Output**: Vector layer contains people affected and the minimum needs based on the number of people affected.
id: **Hasil**: Layer vektor yang menunjukan jumlah orang yang terkena dampak dan kebutuhan minimum berdasarkan jumlah orang yang terkena dampak.

source: Details
id: Detail

source: No documentation found
id: Dokumentasi tidak ditemukan

source: Doc String
id: String Dokumen

source: Impact function for volcano hazard zones impact on population.
id: Fungsi dampak untuk zona dampak ancaman gunung berapi pada penduduk.

source: :author AIFDR :rating 4 :param requires category=='hazard' and subcategory in ['volcano'] and layertype=='vector'
id: :author AIFDR :rating 4 :param membutuhkan category=='hazard' dan subkategori pada ['volcano'] dan layertype=='vector'

source: :param requires category=='exposure' and subcategory=='population' and layertype=='raster'
id: :param membutuhkan category=='exposure' dan subcategory=='population' dan layertype=='raster'
