Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/impact-function-docs/VolcanoBuildingImpact.po
Languages: id

source: Volcano Building Impact
id: Bangunan Terdampak Gunung Berapi

source: Overview
id: Gambaran umum

source: **Unique Identifier**: Volcano Building Impact
id: **Unique Identifier**: Bangunan Terdampak Gunung Berapi

source: **Author**: AIFDR
id: **Pembuat**: AIFDR

source: **Title**: Be affected
id: **Title**: Terdampak

source: **Synopsis**: To assess the impacts of volcano eruption on building.
id: **Sinopsis**: Untuk menghitung dampak erupsi gunung berapi pada bangunan.

source: **Actions**: Provide details about how many building would likely be affected by each hazard zones.
id: **Tindakan**: Menyediakan rincian mengenai berapa banyak jumlah bangunan yang akan terdampak di setiap zona ancaman.

source: **Hazard Input**: A hazard vector layer can be polygon or point. If polygon, it must have "KRB" attribute and the values for it are "Kawasan Rawan Bencana I", "Kawasan Rawan Bencana II", or "Kawasan Rawan Bencana III." If you want to see the name of the volcano in the result, you need to add "NAME" attribute for point data or "GUNUNG" attribute for polygon data.
id: **Masukan Ancaman**: Layer vektor ancaman dapat berupa poligon atau titik. Jika poligon, ini harus memiliki atribut "KRB" dan nilai untuk itu adalah "Kawasan Rawan Bencana I", "Kawasan Rawan Bencana II", atau "Kawasan Rawan Bencana III." Jika Anda ingin melihat nama gunung berapi pada hasilnya, Anda perlu menambahkan atribut "NAME" untuk data titik atau atribut "GUNUNG" untuk data poligon.

source: **Exposure Input**: Vector polygon layer extracted from OSM where each polygon represents the footprint of a building.
id: **Exposure Input**: Layer poligon vektor diekstrak dari OSM dimana setiap poligon mewakili gambaran dari bangunan.

source: **Output**: Vector layer contains Map of building exposed to volcanic hazard zones for each Kawasan Rawan Bencana or radius.
id: **Output**: Layer data berjenis vektor berisi Peta bangunan yang berada di zona ancaman gunung berapi untuk setiap Kawasan Rawan Bencana atau radiusnya.

source: Details
id: Detail

source: No documentation found
id: Dokumentasi tidak ditemukan

source: Doc String
id: String Dokumen

source: Risk plugin for volcano building impact.
id: Plugin risiko untuk bangunan terdampak gunung berapi.

source: :author AIFDR :rating 4 :param requires category=='hazard' and subcategory in ['volcano'] and layertype=='vector'
id: :author AIFDR :rating 4 :param membutuhkan category=='hazard' dan subkategori pada ['volcano'] dan layertype=='vector'

source: :param requires category=='exposure' and subcategory=='structure' and layertype=='vector'
id: :param membutuhkan category=='exposure' dan subcategory=='structure' dan layertype=='vector'
