Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/general/governance/psc.po
Languages: id

source: The Project Steering Committee
id: Proyek Dewan Pengarah

source: The |project_name| project is managed by the Project Steering Committee (PSC) which consists of ? members (with their individual responsibilities listed in brackets):
id: Proyek |project_name| diatur oleh Dewan Pengarah Proyek (PSC) dimana terdiri dari? anggota (dengan tanggung jawab pribadi yang telah tertulis di tanda kurung):

source: Member's roles withing the PSC
id: Peran anggota di dalam PSC

source: Expectations of PSC members
id: Harapan anggota PSC

source: Be willing to commit to the |project_name| development effort
id: Bersedia berkomitmen untuk upaya pengembangan |project_name|

source: Be responsive to requests for information from fellow members
id: Tanggap dalam menanggapi permintaan untuk informasi dari sesama anggota

source: Be able and willing to attend online meetings
id: Mampu dan dapat untuk menghadiri pertemuan online

source: Act in the best interests of the project
id: Bertindak dalam kepentingan terbaik untuk proyek

source: Role of the PSC
id: Peran dari PSC

source: The PSC is intended to:
id: PSC diharapkan untuk:

source: Provide guidance to the general direction of the project
id: Memberikan bimbingan untuk tujuan umum dari proyek

source: Provide a central point of contact for the project
id: Memberikan titik pusat kontak untuk proyek

source: Ensure that the various expectations placed on the project by its members and the users of|project_name| are met to the best degree possible
id: Memastikan bahwa berbagai harapan yang ditempatkan pada setiap proyek oleh setiap anggota dan pengguna dari |project_name| telah terpenuhi ke tahapan terbaik

source: Vote on issues relating to project governance
id: Memberikan masukan pada masalah yang terkait proyek pemerintah

source: Arbitrate disputes
id: Menengahi perselisihan

source: Deal with confidential and legal matters that may arise
id: Menangani masalah-masalah rahasia dan hukum yang mungkin terjadi

source: Provide a stable base of 'institutional knowledge' to the project
id: Menyediakan dasar yang stabil tentang 'pengetahuan institusional' ke dalam proyek
