Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/general/governance/release.po
Languages: id

source: Release Procedure
id: Prosedur Rilis

source: When each new version of |project_name| is released it must adhere to the following stringent quality measures:
id: Ketika tiap versi terbaru |project_name| telah dirilis, versi tersebut harus mengikuti beberapa langkah-langkah pengukuran kualitas yang ketat:

source: **Testing:** At least 2/3rds of all lines of code must be successfully exercised by a regression test suite which is distributed alongside the software itself.
id: **Pengujian:** Paling sedikit 2/3 dari seluruh baris kode harus sukses ketika diuji oleh serangkaian uji regresi yang didistribusikan bersama perangkat lunak itu sendiri.

source: **Disclaimer:** The software includes a clear Disclaimer of Warranty and appropriate Limitation of Liability clause. In this case this is achieved by using the GNU General Public Use v3 License (http://www.gnu.org/copyleft/gpl.html).
id: **Penolakan:** Perangkat lunak ini termasuk ke dalam Penolakan Garansi yang jelas dan klausa Batasan Tanggung Jawab yang sesuai. Oleh karena itu, hal tersebut dicapai dengan menggunakan Lisensi GNU General Public Use v3 (http://www.gnu.org/copyleft/gpl.html).

source: **History:** The software is maintained in a source control system which allows full visibility of its history, tracking of issue resolution and potential reversal of past changes.
id: **Sejarah:** Perangkat lunak ini dipelihara pada sebuah sistem kontrol sumber dimana memperlihatkan sejarahnya secara penuh, melacak penyelesaian isu dan potensi untuk mengembalikan perubahan yang lalu.

source: **Authenticity:** Source control system codes uniquely identify each individual version of the software making it possible to verify its origin.
id: **Otentifikasi:** Sistem kontrol sumber dikodekan secara unik sehingga setiap versi individu dari perangkat lunak dapat diidentifikasi untuk kemungkinan diverifikasi asalnya.

source: After these stringent quality measures have been met there must be signature from the majority of the allocated committee.
id: Setelah pengukuran kualitas yang ketat telah dilakukan, versi terbaru harus ditandatangani dari sebagian besar komite yang telah dialokasikan.

source: For a **Major release** it requires approval and signature from a **majority** of the **PSC**
id: Untuk sebuah **Rilis Mayor** dibutuhkan persetujuan dan tanda tangan dari **mayoritas** anggota *DPP*

source: For a **Minor release** it requires approval from a **majority** of the **TWG**.
id: Untuk sebuah **Rilis Minor** akan membutuhkan persetujuan dari **mayoritas** anggota **KKT**.

source: For a **Point release** it requires only approval from **any** of the **TWG members**.
id: Untuk sebuah *Rilis Titik** akan membutuhkan persetujuan **siapapun** yang termasuk **anggota KKT**.

source: **Definition of software release levels for the InaSAFE project**
id: **Definisi dari tingkat perilisan perangkat lunak untuk proyek InaSAFE**

source: Major releases are versions that provide significant improvements to the software. A major release may change both the user interface and the underlying programming interface. Major releases are numbered as 1.0.0, 2.0.0, …
id: Rilis mayor merupakan versi yang menyediakan peningkatan perangkat lunak secara signifikan. Sebuah rilis mayor memungkinkan untuk perubahan, baik antar muka pengguna maupun antar muka pemrograman di dalamnya. Rilis mayor diberikan nomor seperti 1.0.0, 2.0.0, ...

source: Minor releases provide extensions and improvements to the software. They possibly modify the user interface but must maintain compatibility with the existing programming interface. Minor releases are numbered as 1.1.0, 1.2.0, …
id: Rilis minor menyediakan penambahan dan peningkatan perangkat lunak. Juga memungkinkan untuk memodifikasi antar muka pengguna tetapi harus menjaga dengan antar muka pemrograman yang sudah ada. Rilis minor diberikan nomor seperti 1.1.0, 1.2.0, ...

source: Point releases contain corrections of errors, optimisations and small improvements that maintain compatibility with both the user interface and the programming interface. Point releases are numbered as 1.1.1, 1.1.2, …
id: Rilis titik berisi koreksi dari kesalahan-kesalahan, optimalisasi dan peningkatan kecil yang menjaga kompatibilitas antar muka pengguna dan antar muka pemrograman. Rilis titik diberikan nomor seperti 1.1.1, 1.1.2, ...
