Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/test_data.po
Languages: id

source: Training Data
id: Data Pelatihan

source: Example data for use with |project_name| trainings is available for download via :ref:`direct download <directdownload>`, :ref:`Bittorrent Sync <btsync>`, or :ref:`Docker <usingdocker>`.
id: Contoh data yang dapat digunakan untuk pelatihan |project_name| tersedia untuk didownload melalui :ref:`download langsung <directdownload>`, :ref:`Bittorrent Sync <btsync>`, atau :ref:`Docker <usingdocker>`.

source: Direct Download
id: Download Langsung

source: To obtain a specific training dataset go to http://data.inasafe.org and download the package you need.
id: Untuk memperoleh set data pelatihan khusus silahkan ke http://data.inasafe.org dan download paket yang anda butuhkan.

source: The training data can be quite large in size, so if you have a bad internet connection (or want to download everything at once), all of the materials are also available with BitTorrent Sync.
id: Ukuran data pelatihan dapat terlampau besar, jadi jika anda memiliki koneksi internet yang buruk (atau ingin mendownload secara keseluruhan dalam satu kali), semua material juga tersedia dengan BitTorrent Sync.

source: To obtain the training data using BitTorrent Sync, first visit http://www.bittorrent.com/sync and download and install the software. Note that it is not necessary to provide your email address.
id: Untuk memperoleh data pelatihan menggunakan BitTorrent Sync, pertama kunjungi http://www.bittorrent.com/sync dan download kemudian install softwarenya. Perlu diketahui bahwa alamat email anda tidak diperlukan.

source: When installation is complete, open BitTorrent Sync. To download the training data to your computer, click on the :guilabel:`Options` button and then click :guilabel:`Enter a key...`
id: Ketika instalasi sudah selesai, buka BitTorrent Sync. Untuk mendownload data pelatihan pada komputer anda, klik pada tombol :guilabel:`Options` dan kemudian klik :guilabel:`Enter a key...`

source: Enter the following key: BSU2UCAVRV7P4CHRYOZGIRQ2VN6CH4JP3
id: Masukan key berikut ini: BSU2UCAVRV7P4CHRYOZGIRQ2VN6CH4JP3

source: After you enter the key you must choose a folder on your computer where you would like to synchronize the files. Create a new folder and select it.
id: Setelah anda memasukan key, anda harus memilih folder pada komputer anda dimana anda ingin menyimpan filenya. Buatlah sebuah folder baru dan pilih folder tersebut.

source: The files will begin to synchronize with the folder on your computer. It may take awhile to download, depending on the speed of your connection.
id: File-file akan mulai tersinkronisasi dengamn folder pada komputer anda. Ini akan membutuhkan waktu untuk mendownloadnya, tergantung pada kecepatan koneksi internet anda.

source: If you are using Linux the BitTorrent Sync interface will be available in your web browser at http://localhost:8888 after you start the application.
id: Jika anda menggunakan Linux, antarmuka BitTorrent Sync akan tersedia pada web browser pada http://localhost:8888 setelah anda menjalankan aplikasinya

source: Using Docker
id: Menggunakan Docker

source: If you are comfortable using `docker <http://www.docker.io>`_, you may clone the training data by using the btsync Dockerfile.
id: Jika anda dapat menggunakan `docker <http://www.docker.io>`_, anda dapat mennggandakan data pelatihan dengan menggunakan btsync Dockerfile.

source: Copy the `inasafe-infrastructure <https://github.com/AIFDR/inasafe-infrastructure>`_ git repository.
id: Salin repositori `inasafe-infrastructure <https://github.com/AIFDR/inasafe-infrastructure>`_ git

source: To clone the data files, run ::
id: Untuk menggandakan file data, jalankan ::

source: in a shell.
id: dalam sebuah shell.

source: This will automatically start a docker container, download and run Bittorrent Sync with the correct key and synchronize all data to the :file:`/var/docker/volumes/btsync` directory.
id: Secara otomatis kontainer docker akan dijalankan, download dan jalankan Bittorrent Sync dengan key yang tepat dan sinkronisasikan semua data pada direktori :file:`/var/docker/volumes/btsync`

source: The directory that docker will synchronize with is configurable by adjusting the DATADIR variable in the :file:`rundocker.sh` script.
id: Direktori dimana docker akan mensinkronisasikan dapat diatur dengan menyesuaikan variabel DATADIR pada script :file:`rundocker.sh`

source: To start a sync container with any other secret run :command:`rundocker.sh` with a KEY added as argument: ::
id: Untuk memulai sinkronisasi silahkan jalankan perintah :command:`rundocker.sh` dengan sebuah KEY yang ditambahkan sebagai argumen: ::
