Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/application-help/data_driven_age.po
Languages: id

source: Data Driven Age Post-processor
id: Data Berbasis Umur Pasca-pemrosesan

source: Purpose
id: Tujuan

source: Guidelines
id: Pedoman

source: The aggregator vector layer should contain percentage of age distribution in the attribute table.
id: lapisan vektor pengumpul harus mengandung persentase distribusi usia dalam tabel atribut.

source: YOUTH
id: PEMUDA

source: ADULT
id: DEWASA

source: ELDERLY
id: LANSIA

source: Category
id: Kategori

source: Ratio attributes or Ratio defaults should be populated up.
id: Rasio atribut atau Rasio default kepadatan seharusnya naik

source: Key
id: Kunci

source: Allowed Values
id: Nilai yang diperbolehkan

source: youth ratio attribute / youth ratio default
id: atribut rasio pemuda / default rasio pemuda

source: youth
id: pemuda

source: adult ratio attribute / adult ratio default
id: atribut rasio dewasa / default rasio dewasa

source: adult
id: dewasa

source: elderly ratio attribute / elderly ratio default
id: atribut rasio lansia / default rasio lansia

source: elderly/elder
id: lansia

source: A similar user interface is provided in the :ref:`keywords wizard <keywords_wizard>` user interface.
id: Sebuah antarmuka pengguna yang sama disediakan di :ref:`panduan kata kunci <keywords_wizard>` antar muka pengguna.
