Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/application-help/keywords.po
Languages: id

source: Keywords System
id: Sistem Kata kunci

source: This document describes the purpose and usage of the |project_name| *keywords* system.
id: Dokumentasi ini menjelaskan tujuan dan penggunaan sistem *kata kunci* |project_name|

source: Please also refer to the documentation on :ref:`the keywords Wizards <keywords_wizard>` and the :ref:`keywords editor <keywords_editor>` which are tools to help you to create keywords files.
id: Silakan juga merujuk ke dokumentasi di :ref:`the kata kunci Wizards <keywords_wizard>` dan :ref:`penyunting kata kunci <keywords_editor>` yang merupakan alat untuk membantu Anda untuk membuat berkas kata kunci.

source: Purpose
id: Tujuan

source: The keywords system is used by the :ref:`Impact Functions <impact_functions>` to determine the nature of the input layers that have been passed to them.
id: Sistem kata kunci digunakan oleh :ref:`impact_functions <impact_functions>` untuk menentukan sifat input layer yang telah diberikan kepadanya.

source: Each input GIS dataset used by |project_name| needs to have an accompanying keywords file. The purpose of the keywords file is to provide additional metadata needed by the impact functions. For example, the keywords file will indicate whether a given dataset should be treated as a *hazard* or an *impact* layer. It is also used to indicate the context of the layer (e.g. "it's a *flood* layer", "it's an *earthquake* layer").
id: Setiap pemasukan set data SIG yang digunakan |project_name| memerlukan sebuah *file* kata kunci yang terlampir. Tujuan dari *file* kata kunci ini adalah untuk menyediakan metadata tambahan yang dibutuhkan oleh fungsi dampak. Sebagai contoh, *file* kata kunci akan mengindikasikan apakah sebuah dataset harus diperlakukan sebagai sebuah *ancaman* atau sebuah layer *dampak*. *File* kata kunci ini juga digunakan untuk mengindikasikan konteks dari layer (misalnya "ini adalah layer *banjir*, ini adalah layer *gempa bumi*").

source: By convention and expectation, the keywords file should be named with the same base name of the GIS datasource it accompanies. For example a flood dataset saved as
id: Dengan konvensi dan ekspektasi, berkas keyword harus diberi nama sama dengan nama dasar dari sumber data GIS yang menyertai. Sebagai contoh sebuah set data banjir disimpan sebagai

source: would need to have an accompanying keywords file saved as:
id: akan membutuhkan berkas keyword yang menyertai disimpan sebagai:

source: We recommend to **avoid using spaces** in your file names and file paths!
id: Kami merekomendasikan untuk **menghindari menggunakan spasi** pada nama file dan lokasi file Anda!

source: The |project_name| QGIS plugin provides an editor for these keywords. The purpose of this document is to describe the keywords editor and to provide guidelines as to the use of keywords.
id: Plugin |project_name| di QGIS menyediakan sebuah editor untuk kata kunci ini. Tujuan dari dokumen ini adalah untuk mendeskripsikan editor kata kunci dan untuk menyediakan panduan penggunaan kata kunci tersebut.

source: Currently keywords are not validated by the library. This means if you for example misspell a keyword, use the wrong letter case (e.g. upper case instead of lower case) or provide the wrong keyword for the context (e.g. provide a subcategory of flood to an exposure category), the system will not be able to determine what to do with the file. For that reason you should follow the guidelines below carefully to ensure you have entered your keywords correctly.
id: Saat ini kata kunci tidak tervalidasi oleh pustaka. Ini artinya sebagai contoh jika Anda salah mengeja sebuah kata kunci, menggunakan jenis huruf yang salah (misal huruf besar daripada huruf kecil) atau memberikan kata kunci dalam konteks yang keliru (misalnya memberikan sub-kategori banjir pada sebuah kategori keterpaparan), sistem tidak dapat menerjemahkan apa yang akan dilakukan oleh file tersebut. Karena alasan inilah Anda diharuskan mengikuti panduan di bawah ini secara cermat untuk meyakinkan bahwa Anda telah memasukan kata kunci dengan benar.

source: Guidelines
id: Pedoman

source: In this section we lay out the guidelines for keyword usage.
id: Pada bagian ini kami menyusun panduan untuk penggunaan kata kunci.

source: Category
id: Kategori

source: Every dataset should have a category assigned to it. Category should be written in lower case.
id: Setiap dataset seharusnya memiliki sebuah kategori yang telah ditentukan. Kategori ini harus tertulis dalam huruf kecil.

source: Key
id: Kunci

source: Allowed Values
id: Nilai yang diperbolehkan

source: category
id: kategori

source: exposure
id: keterpaparan

source: hazard
id: ancaman

source: Example keywords file entry ::
id: Contoh pemasukan file kata kunci ::

source: Subcategory
id: Subkategori

source: The selection of a subcategory value is dependent on the category:
id: Pemilihan dari sebuah nilai subkategori tergantung dari kategori:

source: Valid subcategories for category 'hazard':
id: Subkategori yang berlaku untuk kategori 'ancaman':

source: subcategory
id: Subkategori

source: earthquake
id: gempa bumi

source: flood
id: banjir

source: volcano
id: gunung berapi

source: Where tephra is volcanic ashfall.
id: Dimana tephra merupakan bentuk lontaran dari abu vulkanik.

source: Valid subcategories for category 'exposure':
id: Subkategori yang berlaku untuk kategori 'keterpaparan':

source: population
id: populasi

source: road
id: jalan

source: structure
id: bangunan

source: Units
id: unit/ satuan

source: The units keyword is used to indicate the metric or imperial units represented by each data entity (a grid cell or a vector feature) in a layer.
id: Unit kata kunci yang digunakan menunjukkan satuan metrik atau imperial diwakili oleh masing-masing entitas data (sel jaringan atau fitur vektor) dalam sebuah lapis.

source: units
id: unit/ satuan

source: feet
id: kaki

source: Datatype
id: Jenis data

source: The data type keyword indicate what kind of geospatial data is represented (Numeric, Polygon, Line, Point).
id: Tipe data kunci menunjukkan jenis data geospasial diwakili (Numerik, Poligon, Garis, Poin).

source: Assumptions
id: Anggapan

source: The following assumptions are made about keywords, which may or may not be programmatically enforced by the |project_name| library and GUI:
id: Berikut ini asumsi yang dibuat mengenai kata kunci, yang mungkin atau tidak mungkin untuk pemrograman yang diterapkan oleh |project_name| library dan GUI:

source: There should only be **one keyword for a given key** in the keywords file.
id: Seharusnya hanya **satu keyword untuk sebuah key yang diberikan** pada berkas keyword.

source: Keywords for **category** are **enforced** to be one of 'hazard' or 'exposure' by the GUI.
id: Kata kunci untuk **kategori** yang **ditegakkan** menjadi salah satu 'hazard' atau 'exposure' oleh GUI.

source: All keywords should be in **lower case**, **without spaces** with the exception of 'Title' whose value may contain both spaces and mixed case letters.
id: Semua kata kunci harus dalam **huruf kecil**, **tanpa spasi** dengan pengecualian 'Judul' yang nilainya mungkin mengandung spasi dan huruf campuran.

source: Values for keywords should generally be lower case, with the exception of **datatype values may be in upper case** (e.g. MMI)
id: Nilai-nilai untuk kata kunci harus pada umunya ditulis menggunakan huruf kecil dengan pengecualian untuk **tipe data, nilai-nilainya mungkin huruf besar** (contoh : MMI)

source: Keys and values should **not contain colons**. In the keyword editor, any colons will be replaced with a full stop character.
id: Kunci dan nilai harus **tidak mengandung tanda titik dua**. Di dalam editor kata kunci, setiap tanda titik dua akan diganti dengan karakter berhenti penuh.

source: All other Keywords and values that do not fit the above domain lists may be used but they may produce undesired results.
id: Semua kata kunci dan nilai yang tidak sesuai dengan daftar domain di atas dapat digunakan, tetapi mereka dapat menghasilkan hasil yang tidak diinginkan.

source: Translations
id: Terjemahan

source: Although |project_name| is available in different languages, the 'key' in the keywords files should always be written in english.
id: Walaupun |project_name| kini tersedia dalam berbagai bahasa, tapi 'key' dalam file kata kunci harus selalu dituliskan dalam bahasa Inggris.

source: Keywords for remote and non-file based layers
id: Kata kunci (keyword) untuk mengontrol dan non-file didasarkan pada layer

source: If you are using a PostgreSQL, WFS, Spatialite or other non-file based resources, you can still create keywords. In these circumstances the keywords will be written to a sqlite database - by default this database is stored as :file:`keywords.db` within the |project_name| plugin directory root.
id: Jika Anda menggunakan PostgreSQL, WFS, Spatialite atau non-file lain berbasis sumber daya, Anda tetap dapat mengisi kotak dialog kata kunci (keyword). Dalam keadaan ini kata kunci akan ditulis ke basis data sqlite - secara standar basis data ini disimpan sebagai :file:`keywords.db` di dalam |project_name| direktori utama pugin.

source: You may wish to use a different location for the :file:`keywords.db` keywords database - you can configure this by using the |project_name| options dialog. The options dialog can be launched by clicking on the |project_name| plugin toolbar's options icon (as shown below) or by doing :menuselection:`Plugins --> InaSAFE --> InaSAFE Options`.
id: Anda mungkin berharap untuk menggunakan lokasi yang berbeda untuk :file:`keywords.db` kata kunci basis data - Anda dapat mengkonfigurasi ini dengan menggunakan |project_name| dialog pilihan. Dialog pilihan dapat dimunculkan dengan mengklik pada |project_name| simbol plugin toolbar pilihan (seperti terlihat di bawah) atau dengan melakukan :menuselection:`Plugins --> InaSAFE --> InaSAFE Options`.

source: Selecting the options icon
id: Memilih ikon pilihan

source: When the options dialog is opened, the keywords database path can be specified under the tab :guilabel:`Advanced` using the :guilabel:`keyword cache for remote datasources` option as shown below.
id: Ketika kotak dialog Pilihan/ *Option* terbuka, path database kata kunci dapat ditentukan di bawah tab :guilabel:`Advanced` menggunakan pilihan :guilabel:`keyword cache for remote datasources` seperti yang terlihat dibawah.

source: Path to options database
id: Jalur ke pilihan database

source: Support for remote and non-file based layers was added in |project_name| version 0.3.
id: Layanan untuk remote dan layer berbasis non-file telah ditambahkan di |project_name| versi 0.3.

source: The database can be opened using a sqlite editor such as sqliteman, but the data in the keywords table is not intended to be human readable or edited. The table columns consist of an MD5 hash based on the URI for the datasource (typically the database connection details) and a blob which contains the keywords as a pickled python dictionary.
id: Database dapat dibuka menggunakan editor sqlite seperti sqliteman, tapi data di tabel kata kunci tidak dapat dibaca atau diedit. Kolom tabel memiliki sebuah MD5 berdasarkan pada URI untuk sumber data (biasanya detail koneksi database) dan kumpulan yang memiliki kata kunci sebagai kamus python.

source: See the :doc:`./options` document for more information about the |project_name| options dialog.
id: Lihat dokumen :doc:`./options` untuk informasi lebih lengkap mengenai dialog pilihan|project_name|

source: Sharing your keywords cache
id: Berbagi cache kata kunci Anda

source: In theory you can place the keywords file on a network share and create a shared keyword repository in a multi-user environment, but you should note that the layer URI hashes need to be identical in order for a layer's keyword to be found. This means that, for (contrived), example ::
id: Secara teori anda dapat menempatkan file kata kunci pada sebuah jaringan berbagi dan membuat sebuah repositori kata kunci bersama dalam lingkungan banyak pengguna, tetapi anda harus perhatikan bahwa hash layer URI perlu untuk diidentifikasi supaya kata kunci layer dapat ditemukan. Ini dimaksudkan untuk (dibuat sebagai), contoh ::

source: would not be considered the same as ::
id: Tidak akan dianggap sama seperti ::

source: since the user credentials differ, resulting in a different URI. To work around this you could create a common account so that every user will effectively use the same URI to load that layer e.g. ::
id: karena kredensial pengguna berbeda, sehingga menghasilkan URI yang berbeda. Untuk mengatasi ini, Anda bisa membuat akun umum sehingga setiap pengguna secara efektif akan menggunakan URI yang sama untuk memuat layer misalnya ::

source: For certain resources (e.g. ArcInfo coverages, Spatialite databases) where the keywords cache is also used, you should take care to use a common mount point or network share to access the data if you wish to successfully hit the cache with the layer's URI. For example you could have all users mount your data to the same place. Under Unix like operating systems this could look something like this:
id: Untuk sumber daya tertentu (misalnya cakupan Arcinfo, basis data Spatialite) dimana cache juga digunakan, Anda harus berhati-hati menggunakan titik tingkat umum atau jaringan berbagi untuk mengakses data jika Anda berharap menekan cache dengan layer URI secara sukses. Contohnya Anda dapat memiliki semua pengguna menjaga data pada tempat yang sama. Di bawah Unix sebagai sistem pengoperasian ini dapat terlihat seperti ini:

source: Under Windows you could always the same drive letter and path the to share e.g.:
id: Pada windows anda akan mendapatkan huruf drive dan jalur yang sama untuk berbagi contohnya:

source: Getting help
id: Mendapatkan bantuan

source: If you need help using the keywords editor, you can click on the :guilabel:`Help` button at the bottom of the dialog and this page will be displayed.
id: Jika Anda membutuhkan bantuan untuk menggunakan editor kata kunci, Anda dapat klik pada tombol :guilabel:`Help` di tombol dialog dan halaman ini akan ditampilkan.
