Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/application-help/openstreetmap_downloader.po
Languages: id

source: OpenStreetMap Downloader
id: Mendownload OpenStreetMap

source: This tool will fetch building ('structure') and highway ('road') data from the OpenStreetMap project for you.
id: Tool ini akan membantu Anda memperoleh data ('struktur') bangunan dan jaringan jalan ('jalan') dari projek OpenStreetMap.

source: The tool requires internet connection as it fetches the data via a web service running on `Linfiniti's OSM Reporter <http://osm.linfiniti.com>`_ web site.
id: Tool ini membutuhkan koneksi internet karena tool ini mengambil data dari layanan situs `Laporan OSM Linfiniti <http://osm.linfiniti.com>`_

source: The data, once downloaded will be available to you as a shapefile. A style file is automatically created so that it symbolises nicely in QGIS. In addition, the correct keyword metadata is created for the downloaded dataset so that it can be used directly in InaSAFE impact scenario analyses.
id: Data, setelah didownload akan tersedia untuk Anda sebagai sebuah shapefile. Sebuah gaya file secara otomatis dibuat sehingga dilambangkan dengan baik dalam QGIS. Selain itu, metadata kata kunci yang benar dibuat untuk dataset didownload sehingga dapat digunakan secara langsung dalam skenario analisis dampak menggunakan InaSAFE.

source: **Note:** The downloader service has limitations as to the size of datasets that can be retrieved. As such you may experience issues trying to fetch e.g. country wide building footprint data. Generally datasets at a city level and below should work well.
id: **Catatan:** Layanan alat pen-*download* yang disediakan memiliki keterbatasan untuk ukuran dataset yang dapat diambil. Dengan demikian mungkin Anda akan mengalami masalah misalnya dalam mengambil data bangunan untuk seluruh wilayah negara. Pada umumnya seharusnya proses pengambilan dataset dengan cakupan wilayah tingkat kota dan di bawahnya dapat bekerja lebih baik.

source: To use this tool effectively:
id: Untuk menggunakan alat ini secara efektif:

source: Check the output directory is correct. Note that the saved datasets will be called buildings.shp and roads.shp (and their associated files).
id: Periksa apakah direktori output sudah benar. Catatan bahwa set data yang tersimpan akan diberi nama buildings.shp dan roads.shp (beserta berkas-berkas yang terhubung dengannya)

source: By default simple file names will be used (e.g. roads.shp, buildings.shp). If you wish you can specify a prefix to add in front of this default name. For example using a prefix of 'padang-' will cause the downloaded files to be saved as 'padang-roads.shp' and 'padang-buildings.shp'. Note that the only allowed prefix characters are A-Z, a-z, 0-9 and the characters '-' and '_'. You can leave this blank if you prefer.
id: Secara default, nama file yang sederhana akan digunakan (misalnya roads.shp, buildings.shp). Anda dapat menggunakan prefix untuk ditambahkan di depan nama default ini,. Sebagai contoh, menggunakan prefix 'padang-' akan mengubah file yang di-download menjadi 'padang-roads.shp' dan 'padang-buildings.shp'. Sebagai catatan, prefix hanya dibolehkan untuk menggunakan karakter A-Z, a-z, 0-9 dan karakter '-', dan '_'. Anda dapat mengosongkan pilihan ini.

source: Press the :guilabel:`OK Button` and wait for the data to be retrieved.
id: Tekan :guilabel:`OK Button` dan tunggu data untuk diambil.

source: If a dataset already exists in the output directory it will be overwritten. This tool requires a working internet connection and fetching buildings will consume your bandwidth.
id: Jika dataset sudah ada di direktori output, dataset tersebut akan ditimpa. Alat ini memerlukan koneksi internet untuk bekerja dan mengambil bangunan akan menggunakan bandwidth Anda.

source: Downloaded data is copyright OpenStreetMap contributors (click for more info).
id: Data yang didownload adalah hak cipta kontributor OpenStreetMap (klik untuk info lebih lanjut).

source: Building data
id: Data bangunan

source: InaSAFE supports the use of building data in various impact functions. In particular we support building footprints sourced from the `OpenStreetMap <https://openstreetmap.org>`_ project (OSM).
id: InaSAFE mendukung penggunaan data bangunan pada berbagai macam fungsi dampak. Pada umumnya kami mendukung batas tapak bangunan yang bersumber dari proyek `OpenStreetMap (OSM) <https://openstreetmap.org>`_

source: The following building types are derived (depending on the various tags assigned to them in OSM):
id: Tipe bangunan berikut ini yang berasal (tergantung dari berbagai tags yang diberikan pada OSM) adalah sebagai berikut:

source: School
id: Sekolah

source: University/College
id: Universitas/Kampus

source: Government
id: Pemerintahan

source: Clinic/Doctor
id: Klinik/Dokter

source: Hospital
id: Rumah Sakit

source: Fire Station
id: Stasiun Pemadam Kebakaran

source: Police Station
id: Kantor Polisi

source: Public Building
id: Bangunan Publik

source: Place of Worship - Islam
id: Tempat Ibadah - Islam

source: Place of Worship - Unitarian
id: Tempat Ibadah - Unitarian

source: Place of Worship - Buddhist
id: Tempat Ibadah - Buddha

source: Residential
id: Permukiman

source: Sports Facility
id: Fasilitas Olahraga

source: Place of Worship
id: Tempat Beribadah

source: Commercial
id: Komersil

source: Industrial
id: Industri

source: These derived types will be present in a field called 'type' when downloading the building data.Note that depending on the area for which you have downloaded, only some of these categories may be present in your buildings dataset.
id: Tipe-tipe ini akan muncul pada sebuah kolom bernama 'type' ketika mendownload data bangunan. Catatan bahwa tergantung wilayah mana yang anda download, kemungkinan hanya beberapa dari kategori ini yang akan muncul pada set data bangunan anda.

source: Roads data
id: Data jalan

source: InaSAFE supports the use of road data in various impact functions. In particular we support roads sourced from the `OpenStreetMap <https://openstreetmap.org>`_ project (OSM).
id: InaSAFE mendukung penggunaan data bangunan untuk berbagai fungsi dampak. Pada umumnya kami mendukung jalan yang bersumber dari proyek `OpenStreetMap (OSM) <https://openstreetmap.org>`_

source: The following road types are derived (depending on the various tags assigned to them in OSM):
id: Tipe jalan berikut ini yang berasal (tergantung dari berbagai tags yang diberikan pada OSM) adalah sebagai berikut:

source: Motorway or highway (includes 'trunk' from OSM)
id: Jalan besar atau jalan bebas hambatan (termasuk 'trunk' / jalan penting dari OSM)

source: Motorway link
id: Percabangan jalan besar

source: Primary road
id: Jalan primer

source: Primary link
id: Percabangan jalan primer

source: Tertiary
id: Jalan tertier

source: Tertiary link
id: Percabangan jalan tertier

source: Secondary
id: Jalan Sekunder

source: Secondary link
id: Percabangan jalan sekunder

source: Road, residential, living street, etc. (includes all highways tagged with 'living_street', 'residential', 'yes', 'road', 'unclassified', 'service', '' and NULL highways)
id: Jalan, perumahan, permukiman, etc. (termasuk semua jalan yang diberi tag 'living_street', 'residential', 'yes', 'road', 'unclassified', 'service', '' dan NULL)

source: Track'
id: Trek

source: Cycleway, footpath, etc. (includes 'cycleway', 'footpath', 'pedestrian', 'footway' and 'path' highway tags).
id: Jalur sepeda, jalan kecil, etc. (termasuk jalan dengan tag 'cycleway', 'footpath', 'pedestrian', 'footway' dan 'path' )
