Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/curriculum/osm-intermediate-toolkit.po
Languages: id

source: **XML and presets in JOSM**
id: **XML dan presets pada JOSM**

source: **Introduction 10'**
id: **Pengantar 10’**

source: The facilitator presenting the importance of sessions, objectives, outcome and activities.
id: Fasilitator menyampaikan pentingnya sesi, tujuan, outcome, dan langkah kegiatan.

source: The facilitator gives some question to make sure that the participants still remember what is preset and tag
id: Fasilitator memberikan beberapa pertanyaan untuk memastikan bahwa peserta masih mengingat apa itu preset dan apa itu tag.

source: Make sure that the participants understands that is the simple way to implement tag which have previously have been determined, to objects in JOSM.
id: Pastikan bahwa para peserta memahami bahwa merupakan cara yang sederhana untuk menerapkan tag-tag yang sebelumnya telah ditentukan, kepada objek dalam JOSM.

source: Q & A Discussion
id: Diskusi Tanya jawab

source: The facilitators explain what that presets, the difference tags, key and value and usefulness.
id: Fasilitator menjelaskan apa itu presets, perbedaan tags, key serta value beserta kegunaannya masing-masing.

source: The participants will be introduced to xml language which crafted a preset file.
id: Peserta akan dikenalkan kepada bahasa xml yang menyusun sebuah file preset.

source: The facilitators proceeding explain about the various of elements that can be added to a preset menu through the XML code row. The facilitator is expected to explain each element gradually, so the part participants can understand the relationship between their code and how result are in the preset menu.
id: Fasilitator melanjutkan menjelaskan tentang bermacam-macam elemen yang dapat ditambahkan ke suatu menu preset melalui baris-baris kode XML. Diharapkan fasilitator menjelaskan setiap elemen secara perlahan-lahan, sehingga peserta dapat memahami hubungan antarkode yang mereka tulis dan bagaimana hasilnya pada menu preset.

source: **Making Your Own Preset File 30'**
id: **Membuat File Preset Sendiri 30’**

source: The facilitator invite participants to discuss about preset what you want to made together later. Make sure the information would be converted into a preset file later to cover the whole type can be created using xml is text box, check box, and multiselect.
id: Fasilitator mengajak peserta untuk berdiskusi preset apa saja yang ingin dibuat bersama-sama nantinya. Pastikan informasi yang akan diubah menjadi file preset nanti mencakup seluruh jenis yang dapat dibuat menggunakan xml yaitu teks box, combo box, checkbox, dan multiselect.

source: The participants asked to visit the Map Features pages on the Wiki OpenStreetMap website and the taginfo.openstreetmap.org website to see the key and value are already available in OpenStreetMap. They will try to use key and value has existed or once used in the website. But if nothing, they may make key and value own.
id: Peserta diminta mengunjungi halaman Map Features pada situs wiki OpenStreetMap dan situs taginfo.openstreetmap.org untuk melihat key dan value yang sudah tersedia di OpenStreetMap. Usahakan mereka akan menggunakan keys dan values yang telah ada atau pernah digunakan di situs-situs tersebut. Namun bila tidak ada, mereka boleh membuat key dan value sendiri.

source: Laptop Module 4
id: Komputer/laptop Modul 4

source: **Making Your Own Preset File 45'**
id: **Membuat File Preset Sendiri 45’**

source: The participants were asked to open the *presets_sample.xml* file has been provided by trainer and given on USB flash disk. This file is empty preset file provided as the starting point to write their XML.
id: Selanjunya peserta diminta untuk membuka file presets_sample.xml yang telah disediakan oleh tim trainer dan diberikan pada USB flashdisk. File ini merupakan file preset kosong yang disediakan sebagai titik awal peserta untuk menulis XML mereka sendiri.

source: The facilitator will guide all participants to make together a preset file has been previously discuss. The facilitator around the class and check how participants make a xml code. Fix the mistakes found on the participants. When participants finished writing their XML file, show how to save the preset file and add the preset file to JOSM.
id: Fasilitator akan menuntun seluruh peserta untuk membuat bersama-sama file preset yang sebelumnya telah didiskusikan. Fasilitator berkeliling kelas dan cek bagaimana peserta membuat kode-kode xml tersebut. Perbaiki kesalahan-kesalahan yang di temukan pada peserta. Ketika peserta selesai menulis file XML mereka, tunjukkan bagaimana menyimpan file preset tersebut dan tambahkan file preset tersebut ke JOSM.

source: Practise
id: Latihan

source: Presentations Projector Computer/ Laptop USB Flash disk Installer Notepad ++ a XML file example Module 4 XML and Presets in JOSM
id: Presentasi powerpoint Proyektor Komputer/laptop USB flashdisk Installer NotePad++ Contoh file XML Modul 4 - XML dan Presets pada JOSM

source: **Entering new preset file to JOSM 15'**
id: **Memasukkan File Preset Baru ke dalam JOSM 15’**

source: Asked about how to add preset through the "Preferences" menu.
id: Bertanyajawab tentang bagaimana menambahkan preset melalui menu “Preferences”.

source: **Session 5**
id: **Sesi 5**

source: Time : 2 Hours
id: Waktu : 2 Jam

source: Using the private data store feature for the personal data storage
id: Menggunakan fitur private data store untuk penyimpanan data pribadi

source: **Using Private Datastore**
id: **Penggunanaan Private Datastore**

source: Install SDS Plugin
id: Install Plugin SDS

source: Using Plugin
id: Penggunaan Plugin

source: How SDS plugin works
id: Cara kerja plugin SDS

source: Access the online datastore
id: Mengakses datastore secara online

source: User Private Datastore
id: Pengguna Private Datastore

source: A diagram for the using of private datastore and JOSM
id: Diagram penggunaan private datastore dan JOSM

source: Edit the online data store
id: Edit data store secara online

source: How to add the online datastore
id: Cara menambahkan data store secara online

source: How to add and to edit user in private datastore
id: Cara menambahkan dan mengedit user pada private data store

source: How to add project in private datastore
id: Cara menambahkan project pada private data store

source: **Introduction 15'**
id: **Pengantar 15’**

source: Through games, participants requested to mention what kind of data can be mapped use private datastore
id: Melalui permainan peserta diminta menyebutkan data apa saja yang dapat dipetakan menggunakan private datastore

source: Give explanation related to the reasons they entering the data into private or public data
id: Beri penjelasan terkait dengan alasan mereka memasukkan data tersebut menjadi data pribadi ataupun data publik

source: **Input 30'**
id: **Masukan 30’**

source: The facilitator explain about:
id: Fasilitator menjelaskan:

source: How Private Datastore (SDS) works
id: Bagaimana Private Datastore (SDS) bekerja

source: The purpose of using Private Datastore by HOT
id: Untuk apakah Private Datastore digunakan oleh HOT

source: The application/the other utilization that can be used by this plugin
id: Penerapan/pemanfaatan lain yang dapat digunakan dengan plugin ini

source: Presentations
id: Presentasi powerpoint

source: Projector Computer/ Laptop
id: Proyektor Komputer/laptop

source: **Practice 60'**
id: **Latihan 60’**

source: Download area that will be mapped using JOSM, ask the participants to edit one of object (must be a building), point the participants to see properties/description of the object has been given presets, and then upload.
id: Download area yang akan dipetakan dengan menggunakan JOSM, mintalah para peserta untuk mengedit salah satu objek (harus berupa bangunan), arahkan peserta untuk melihat properties/keterangan dari objek yang telah diberi presets, kemudian upload.

source: Ask the participants to login (sign up) to **HOT Datastore** website.
id: Mintalah para peserta untuk login (sign up) ke situs **HOT datastore**.

source: The private datastore account is different from the OSM account.
id: Akun private datastore berbeda dengan akun OSM.

source: The private datastore account can be admin and personal
id: Akun private datastore dapat berupa admin dan personal.

source: The private datastore account used in SDS Plugin should be the same that used in HOT Datastore website.
id: Akun private datastore yang digunakan di SDS Plugin harus sama dengan yang digunakan di situs HOT Datastore.

source: Show how to access the **HOT Datastore** website
id: Tunjukkan bagaimana untuk mengakses website **HOT Datastore**.

source: If as admin aim to add user and added project in the HOT Datastore website, then using the Tag Search menu to find the object have been saved and Map Search to add the object directly with using HOT Datastore website.
id: Jika sebagai admin arahkan untuk menambahkan user dan menambahkan project pada situs HOT Datastore, kemudian gunakan menu Tag Search untuk mencari objek yang telah disimpan dan Map Search untuk menambahkan objek secara langsung dengan menggunakan situs HOT Datastore.

source: If as personal user to navigate using the Tag Search and Map Search menu.
id: Jika sebagai user personal arahkan untuk menggunakan menu Tag Search dan Map Search.

source: Find some private data has been added and try to edit some data.
id: Temukan beberapa data pribadi yang tadi telah ditambahkan dan cobalah untuk mengedit beberapa data. Catatan telah disertakan dalam presentasi.

source: **Closing 15'**
id: **Penutup 15’**

source: Discuss about the private datastore session, usually participants will ask how if you want to have own private datastore account if participants are serious with that can give proposal to HOT team and prepare a server if possible.
id: Diskusi mengenai sesi private datastore, biasanya peserta akan menanyakan bagaimana bila ingin memiliki akun private datasore sendiri, bila peserta serius dengan hal tersebut dapat memberikan proposal kepada tim HOT dan menyiapkan sebuah server bila memungkinkan.

source: **Session 6**
id: **Sesi 6**

source: Time : 2 Hours
id: Waktu : 2 Jam

source: Create and edit page in OSM wiki
id: Membuat dan mengedit halaman di OSM wiki

source: Explain the definition of wiki openstreetmap
id: Menjelaskan pengertian wiki openstreetmap

source: Create account in OSM wiki
id: Membuat akun di OSM wiki

source: Editing OSM wiki
id: Mengedit OSM wiki

source: Explain conventions and guides/rules in making a wiki page
id: Menjelaskan konvensi dan pedoman/aturan dalam membuat halaman wiki

source: Create a new page in wiki
id: Membuat halaman baru di wiki

source: Uploading file and photo/image
id: Meng-*upload* file dan foto/gambar

source: Translate and revise wiki
id: Menerjemahkan dan mengubah wiki

source: View changelog
id: Melihat daftar perubahan

source: **Wiki OpenStreetMap** 1. The definition of wiki openstreetmap 2. Creating account 3. Edit wiki 4. The format of writing wiki 5. Creating a new page in wiki 6. Upload file and photo/image 7. Translating pages 8. How to view changelog
id: **Wiki OpenStreetMap** 1. Pengertian wiki openstreetmap 2. Pembuatan akun 3. Edit wiki 4. Format penulisan wiki 5. Pembuatan halaman baru di wiki 6. Upload file dan foto/gambar 7. Penerjemahan halaman 8. Cara melihat daftar perubahan

source: The facilitator presenting the importance of session, objectives, outcome and activities
id: Fasilitator menyampaikan pentingnya sesi, tujuan, outcome, dan langkah kegiatan

source: **Explain Wiki OpenStreetMap 25'**
id: **Menjelaskan Wiki OpenStreetMap 25’**

source: The facilitator explain about :
id: Fasilitator menjelaskan:

source: What is Wiki OpenStreetMap and how this website can be used
id: Apa itu Wiki OpenStreetMap dan bagaimana situs ini dapat digunakan

source: The importance of this Wiki OpenStreetMap website as the main information source about anything related with OpenStreetMap.
id: Pentingnya situs Wiki OpenStreetMap ini sebagai sumber informasi utama tentang apapun yang terkait dengan OpenStreetMap.

source: How Wiki OSM works similar with OSM< where all user (members) can add and edit the Wiki page.
id: Cara kerja Wiki OSM serupa dengan OSM, dimana semua user (anggota) dapat menambahkan dan mengedit halaman Wiki.

source: The importance posting projects related with/using OSM and also various kinds of tag in OSM.
id: Pentingnya memposting proyek-proyek yang terkait dengan/menggunakan OSM dan juga berbagai macam tag pada OSM.

source: The facilitator shows some pages in a Wiki are important and very useful, example the *"Map Feature"* and *"Basics of JOSM"* page (JOSM Basic). Show how to help translate the page to improve the use of OSM
id: Fasilitator menunjukkan beberapa halaman dalam Wiki yang penting dan sangat berguna, misalnya halaman *“Map Feature”* dan *“Basics of JOSM”* (Dasar-dasar JOSM). Tunjukkan betapa membantunya menerjemahkan halaman untuk meningkatkan penggunaan OSM

source: Projector Module 6
id: Proyektor Modul 6

source: **Create account Wiki OSM 30'**
id: **Membuat akun Wiki OSM 30’**

source: The facilitator help the participants to register as member in Wiki OSM website, so they can **log in** and contribute in Wiki OpenStreetMap.
id: Fasilitator membantu peserta untuk mendaftarkan diri sebagai anggota ke situs Wiki OSM, sehingga mereka dapat melakukan **log in** dan turut berkontribusi pada Wiki OpenStreetMap.

source: Tell the participants that they should sign up with the same name (account), because it will allow the participants them in order not remember many names and keywords (which often confuse user themselves and in the end can't log in), as well as the other user to find them both on OSM and Wiki OSM.
id: Sampaikan pada para peserta bahwa sebaiknya peserta mendaftar dengan nama (akun) yang sama sebagaimana nama akun OSM mereka, karena akan memudahkan peserta itu sendiri agar tidak mengingat banyak nama dan kata kunci (yang seringkali membuat user bingung sendiri dan pada akhirnya tidak dapat log in), begitu juga dengan user lain agar lebih mudah menemukan mereka baik pada OSM maupun Wiki OSM.

source: Presentations Projector Computer connected internet Module 6
id: Slide ppt Proyektor Komputer peserta yang terhubung internet Modul 6

source: **Create and Edit Wiki OSM Page 60'**
id: **Membuat dan Mengedit Halaman Wiki OSM 60’**

source: The facilitator asks the participants to access a user page they are each to practice adding some articles on the page.
id: Fasilitator meminta pada peserta untuk mengakses halaman profil mereka masing-masing untuk mempraktikkan penambahan beberapa artikel pada halaman tersebut.

source: Show how editor works, and ask the participants to add some basic information about themselves to *user page* each one of them.
id: Fasilitator meminta pada peserta untuk mengakses halaman profil *user page* mereka masing-masing untuk mempraktikkan penambahan beberapa artikel pada halaman tersebut.

source: Show how to add some basic information to make their pages look more nice and varied, using tag and the button at the top editor.
id: Tunjukkan bagaimana menambahkan beberapa performatan dasar untuk membuat halaman mereka tampak lebih bagus dan bervariasi, dengan menggunakan tag dan tombol yang ada di bagian atas editor.

source: Teach only basic formatting, the important thing is the participants understand the basic concepts. In the next session the participants will learn the other format more detail and will start editing and create the real new page.
id: Ajarkan performatan-performatan dasar, yang terpenting adalah bahwa peserta memahami konsep-konsep dasarnya. Pada sesi berikutnya, peserta akan belajar pemformatan-pemformatan lain yang lebih detail dan akan mulai mengedit serta membuat halaman baru yang sebenarnya.
