Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/curriculum/osm-intermediate-toolkit.po
Languages: id

source: Unit 3 Facilitator Guide
id: Unit 3 Panduan Fasilitator

source: Intermediate OpenStreetMap Trainer's Toolkit - (A Guide for Facilitator)
id: OpenStreetMap Tingkat Menengah Trainer's Toolkit - (Panduan untuk Fasilitator)

source: About Toolkit
id: Tentang Toolkit

source: **Intermediate level OpenStreetMapWorkshop Guide** is designed to prepare facilitator to be able to organize intermediate training in terms of editing OSM data. The material which is included will prepare you to organize training for participant who already has experience with mapping and editing map. The material was compiled for this training assume that all the participants already attended **Beginner OpenStreetMap Training** and already understand and familiar with basic editing techniques at JOSM.
id: **Panduan diklat OpenStreetMap Tingkat Menengah** ini disusun untuk menyiapkan para fasilitator untuk dapat menyelenggarakan diklat tingkat menengah dalam hal mengedit data OSM. Materi yang disertakan akan mempersiapkan Anda untuk menyelenggarakan diklat bagi para peserta yang telah memiliki beberapa pengalaman dengan pemetaan dan editing peta. Materi yang disusun untuk diklat ini berasumsi bahwa peserta telah mengikuti Diklat **OpenStreetMap Tingkat Dasar** dan telah paham serta terbiasa dengan teknik-teknik editing dasar pada JOSM.

source: Purpose for this guide is to preparing you, the facilitator, to be able to teach participants successfully according to **Intermediate OpenStreetMap Guide**.
id: Tujuan dari panduan ini adalah untuk mempersiapkan Anda, para fasilitator, untuk dapat melatih peserta diklat dengan sukses pada Panduan **OpenStreetMap Tingkat Menengah**.

source: Workshop Purpose
id: Tujuan Lokakarya

source: The purpose of this training is to enhance the capabilities and skills of the participants in performing editing OSM data on JOSM, include intermediate editing techniques and emphasize on the quality of the data. Intermediate level topics are also included in this workshop that is working with **the private datastore** to create and make use of the information on the Wiki OpenStreetMap.
id: Tujuan dari diklat ini adalah untuk meningkatkan kemampuan dan keahlian para peserta dalam melakukan editing data OSM pada JOSM, meliputi teknik-teknik editing tingkat menengah dan menekankan pada kualitas data. Topik tingkat menengah yang juga disertakan dalam diklat ini yaitu bekerja dengan **private datastore** dan membuat serta memanfaatkan informasi pada Wiki OpenStreetMap.

source: The purpose of that already explained above can be elaborated into competency standards and basic competencies as follows.
id: Tujuan di atas dapat dijabarkan menjadi standar kompetensi dan kompetensi dasar sebagai berikut.

source: *Standard Competency*
id: *Standar Kompetensi*

source: Quality Assurance for contributing of OSM mapping
id: Menjamin kualitas kontribusi pemetaan OSM

source: *Basic Competency*
id: *Kompetensi Dasar*

source: Applying better digitizing technique for improving quality of the resulting data.
id: Menerapkan teknik digitasi yang lebih baik untuk meningkatkan kualitas data yang dihasilkan.

source: Use JOSM Validation tools to ensure the quality of contribution of mapping given.
id: Menggunakan alat validasi JOSM untuk menjamin kualitas kontribusi pemetaan yang diberikan.

source: Resolving conflict when uploading OSM data
id: Menyelesaikan konflik dalam mengupload data OSM

source: Creating preset file in JOSM
id: Membuat file preset pada JOSM

source: Using private data store feature for keep private data
id: Menggunakan fitur private data store untuk penyimpanan data pribadi

source: Creating and editing page in OSM Wiki
id: Membuat dan mengedit halaman di OSM wiki

source: Workshop Materials
id: Materi Lokakarya

source: Advanced Editing
id: Teknik Editing Tingkat Lanjut

source: Quality Assurance
id: Penjaminan Kualitas

source: Resolving Conflict when uploading OSM data
id: Penyelesaian Konflik dalam mengupload data OSM

source: XML and presets in JOSM
id: XML dan preset pada JOSM

source: Using Private Datastore
id: Penggunanaan Private Datastore

source: Workshop Strategies
id: Strategi Lokakarya

source: The methods used are participatory methods, with emphasis on the full participation of the participants in the training process, rather than a method of speaking engagements.
id: Metode yang digunakan adalah metode partisipatif, dengan menekankan pada keikutsertaan penuh dari peserta dalam proses pelatihan, bukan metode ceramah.

source: Based on participants. Participants are encouraged to seek, find and acquire knowledge/skills that they needed independently.
id: Berpusat pada peserta. Peserta didorong untuk mencari, menemukan dan memperoleh pengetahuan/ketrampilan yang dibutuhkan secara mandiri.

source: Presenter act as facilitator. Presenter only facilitates ideas that come from any direction not only from presenter. In times of needed presenter should be able to provide reinforcement quality.
id: Penyaji berfungsi sebagai fasilitator. Penyaji hanya memfasilitasi agar ide-ide datang dari berbagai arah bukan hanya dari penyaji. Pada saat dibutuhkan penyaji harus mampu memberikan penguatan yang berkualitas.

source: Oriented at outcome. Training of should produce outcome that has been mentioned.
id: Berorientasi pada outcome. Diklat harus menghasilkan outcome yang telah disebutkan.

source: Tools
id: Perlengkapan

source: Copy of Data Collection using OSM Intermediate Guide for participants
id: Salinan “Diktat Pengumpulan Data dengan Menggunakan OSM Tingkat Menengah” untuk peserta

source: Indoor room with tables and chairs
id: Ruangan tertutup dengan meja dan kursi

source: Computer ( 1 computer used by maximum 2 peoples ideally)
id: Komputer (idealnya 1 komputer digunakan oleh maksimal 2 orang)

source: Two projectors ( for present/deliver materials and demonstrate techniques in the use of application)
id: Dua proyektor (untuk mempresentasikan/memaparkan materi dan mendemonstrasikan teknik-teknik dalam penggunaan aplikasi)

source: Flashdisk (for transfer files and software installers)
id: Flashdisk (untuk memindahkan/meng-copy dile dan master/installer software)

source: Stable internet connection
id: Koneksi internet yang stabil

source: Snacks and drinks
id: Makanan - minuman ringan

source: Schedules
id: Jadwal Kegiatan

source: Below is the outline for a five-day training schedule that has been tested to several different groups in several areas in Indonesia. You could just provide a variety of changes that might be more useful depending on the various factors that have been discussed before.
id: Di bawah ini adalah outline jadwal pelatihan untuk lima hari yang telah diuji coba kepada beberapa kelompok berbeda di beberapa daerah di Indonesia. Anda bisa saja memberikan berbagai perubahan yang mungkin bisa lebih berguna tergantung berbagai faktor yang telah didiskusikan sebelumnya.

source: Day I:
id: Hari Pertama:

source: **Time**
id: **Waktu**

source: **Materials**
id: **Materi**

source: **Activities**
id: **Langkah Kegiatan**

source: Opening and creating agreements
id: Pembukaaan dan Membangun Kesepakatan

source: Plenary Session
id: Pleno

source: Break 1
id: Istirahat 1

source: FGD and Plenary Session
id: FGD dan Pleno

source: Lunch break
id: Sholat dan makan siang

source: Break 2
id: Istirahat 2

source: Day II:
id: Hari Kedua:

source: Day III:
id: Hari Ketiga:

source: Evaluation and Closing
id: Evaluasi dan Penutupan

source: **Workshop Plan**
id: **Rencana Lokakarya**

source: **Session 1**
id: **Sesi 1**

source: Advances Editing
id: Teknik Editing Lebih Lanjut

source: Time : 4 hours
id: Waktu : 4 Jam

source: Basic Competency
id: Kompetensi Dasar

source: Apply a better digitizing techniques for improving the quality of the resulting data
id: Menerapkan teknik digitasi yang lebih baik untuk meningkatkan kualitas data yang dihasilkan

source: Indicator
id: Indikator

source: Using edit tools in JOSM
id: Menggunakan tool edit di JOSM

source: Creating relations between objects
id: Membuat relasi antar objek

source: Data in OpenStreetMap become better than before
id: Data di OpenStreetMap menjadi lebih baik dari sebelumnya

source: Core Material
id: Materi Pokok

source: **Advanced Editing**
id: **Teknik Editing Lebih Lanjut**

source: Tools Editing in JOSM
id: *Tools Editing JOSM*

source: Adding more features for drawing
id: Fitur tambahan untuk menggambar

source: Adding more plugins
id: Plugins tambahan

source: Relations
id: Relasi

source: Creating relations between spatial objects
id: Pembuatan Relasi antarobjek spasial

source: Relations for bus routes
id: Relasi untuk rute bis

source: Activities
id: Aktivitas

source: **Methods**
id: **Metode**

source: **Tools**
id: **Alat/Bahan**

source: **Introduction 5'**
id: **Pengantar 5'**

source: Facilitators tell how important this session, purpose, outcome and activities
id: Fasilitator menyampaikan pentingnya sesi, tujuan, outcome, dan langkah kegiatan

source: Lecture
id: Ceramah

source: Powerpoint
id: Slide PP

source: **Review OSM Materials for beginner 30'**
id: **Review Materi OSM untuk pemula 30'**

source: The participants requested in turn pass on what they have done in the context of mapping and OpenStreetMap (OSM) since the first workshop (beginner training)
id: Secara bergantian peserta diminta menyampaikan apa yang telah mereka lakukan dalam konteks pemetaan dan OpenStreetMap (OSM) sejak training pertama (training tingkat dasar).

source: Facilitator creating question list that participants asked, so facilitator can answer and explain in detail in the next session in intermediate workshop.
id: Fasilitator membuat daftar pertanyaan yang disampaikan oleh peserta, sehingga fasilitator dapat menjawab dan menjelaskannya secara rinci pada sesi-sesi selanjutnya pada lokakarya tingkat menengah tersebut.

source: Facilitator create list of participants questions in laptop and showing them with projector so the participants can follow and monitoring that session (create question list).
id: Fasilitator menuliskan daftar pertanyaan peserta pada laptop dan ditampilkan dengan proyektor agar para peserta dapat mengikuti dan memonitor sesi tersebut (pembuatan daftar pertanyaan).

source: If the questions are simple, facilitator can answer directly. But, if the questions are outside workshop material, facilitator can give the other reference to participant, or do an individual session outside workshop, for example at lunch break.
id: Jika pertanyaannya sederhana, fasilitator dapat menjawabnya secara langsung. Namun jika pertanyaan tersebut di luar cakupan materi lokakarya, fasilitator dapat memberikan sumber/referensi lain kepada peserta tersebut, atau lakukan pembicaraan secara individu kepada peserta tersebut di luar sesi lokakarya, misalnya pada waktu istirahat.

source: Explain what can participant get/hope in this workshop (intermediate workshop). Separate participants into two sides, asking more detail to them about their experiences for using a computer. This is done to pair the participants between participants who were proficient and yet too skilled in the use of computers
id: Jelaskan apa yang dapat peserta dapatkan/harapkan dalam training tersebut (lokakarya tingkat menengah). Bagi peserta menjadi dua bagian, tanyakan lebih lanjut kepada mereka tentang pengalaman penggunaan komputer. Hal ini dilakukan untuk memasangkan para peserta antara peserta yang telah mahir dan belum terlalu mahir dalam penggunaan komputer.

source: Discussion
id: Diskusi

source: Q & A Session Lecture
id: Tanya jawab Ceramah

source: Microphone Speakers Projector
id: *Microphone Speaker Proyektor*

source: **Shortcut in JOSM 20'**
id: **Shortcut-shortcut/tombol pintas 20'**

source: Participants are asked to discuss in brief about the shortcut (shortcut keys on your keyboard) to activate some tools on JOSM.
id: Peserta diminta mendiskusikan secara singkat tentang *shortcut* (tombol pintas pada keyboard ) untuk mengaktifkan beberapa tool pada JOSM.

source: Facilitator explains and demonstrates how the shortcut (shortcut keys) can make the job of editing made easier by saving a lot of time.
id: Fasilitator menjelaskan dan mendemonstrasikan bagaimana *shortcut* (tombol pintas) tersebut dapat membuat pekerjaan editing menjadi lebih mudah dengan menghemat banyak waktu.

source: Participants are asked to practise by following the facilitator demonstration in the use of shortcut-shortcut (shortcut keys) are on their each computers/laptops.
id: Peserta diminta mempraktikkan dengan mengikuti demonstrasi fasilitataor dalam penggunaan *shortcut-shortcut* (tombol pintas) tersebut di komputer/laptop mereka masing-masing.

source: Presentation Projector Computer Laptop Sample files in USB drive (tools_menu _sample.osm utilplugin2 _sample.osm)
id: Presentasi powerpoint Proyektor Komputer/laptop Contoh file latihan pada flashdisk (tools_menu_sample.osm dan utilsplugin2_sample.osm)

source: Make sure that all the participants have install **"building_tools"** and **"utilsplugin2"** plugin. Make sure that participants already remove the previous file training and ask them to create new layer. Use that layer to practice with plugin **"buildings_tool"**. Some of the things that facilitator should note are:
id: Pastikan peserta menginstal plugin **“building_tools”** dan **“utilsplugin2”**. Pastikan peserta telah menghapus file latihan sebelumnya dan mintalah mereka membuat layer baru. Gunakan layer kosong ini untuk praktik menggunakan plugin **“buildings_tool”**. Beberapa hal yang fasilitator harus perhatikan adalah:

source: Way building tools work.
id: Cara kerja building tools.

source: Make sure that they didn't select any object when they want use building tools.
id: Pastikan agar mereka tidak memilih suatu objek dalam penggunaan building tools.

source: Teach them to set the building tools according to building size what they want (for example 10 m x 10 m)
id: Ajarkan kepada mereka untuk mengatur building tools sesuai dengan ukuran yang kita inginkan (misalnya 10m x 10m)

source: How to give tag other than building=yes
id: Cara memberikan tag lain selain building=yes pada building tools

source: Explain each usability of existing option on the menu set building size
id: Jelaskan masing-masing kegunaan pilihan yang ada pada menu set building size

source: Demonstration Practice
id: Demonstrasi Latihan

source: Presentation Projector Computer/ Laptop
id: Presentasi powerpoint Proyektor Komputer/laptop

source: **Utilplugin2 60'**
id: **Utilsplugin2 60’**

source: Facilitator explains some important tools in utilplugin2 plugin such as *add source tag, select way nodes, overplace geometry*. Give an example that corresponds to daily digitizing
id: Fasilitator menjelaskan beberapa tools penting yang berada pada plugin utilsplugin2 seperti misalnya *add source tag, select way nodes, atau replace geometry*. Berikan contoh yang sesuai dengan pengaplikasiannya sehari-hari.

source: Participants directly practice use of the tools with explain from facilitator.
id: Peserta mempraktikkan secara langsung penggunaan dari tools tersebut bersamaan dengan penjelasan yang diberikan oleh fasilitator.

source: **Create relation between object 35'**
id: **Membuat relasi antar objek 35’**

source: Facilitator explain about relation and an example in JOSM also OpenStreetMap.
id: Fasilitator menjelaskan tentang pengertian relasi, dan contoh penggunaannya pada JOSM serta OpenStreetMap.

source: Participants create buildings with 2 polygon overlapping each other (for example a building with gazebo inside that building)
id: Peserta mempraktikkan pembuatan bangunan dengan menggunakan 2 poligon yang saling bertumpuk (untuk kasus bangunan dengan taman di dalam bangunan tersebut).

source: Explain about relation's attribute, "inner" and "outer" role.
id: Jelaskan mengenai atribut dari relasi tersebut. Apa yang dimaksud dengan role “inner” dan “outer”.

source: Presentation Projector Computer Laptop
id: Presentasi powerpoint Proyektor Komputer/laptop

source: FAQ (Frequently Asked Question)
id: FAQ (Pertanyaan yang sering muncul)

source: **Session 2**
id: **Sesi 2**

source: Time : 4 Hours 15 minutes
id: Waktu : 4 Jam 15 menit

source: Using the validation tool to ensure the quality of the contribution JOSM mapping.
id: Menggunakan alat validasi JOSM untuk menjamin kualitas kontribusi pemetaan yang diberikan

source: **Quality Assurance**
id: **Penjaminan Kualitas**

source: Validation Tools
id: Alat Validasi

source: Editing Tips
id: Tips Editing

source: Standardization Presets
id: Standardisasi Preset

source: Facilitator explain the importance of the session, the objective, activities and outcomes measures
id: Fasilitator menyampaikan pentingnya sesi, tujuan, outcome, dan langkah kegiatan

source: Consolidation by answering participants question about editing OSM data
id: Pemantapan dengan menjawab pertanyaan-pertanyaan peserta mengenai editing data OSM

source: Q & A Session
id: Sesi Tanya Jawab

source: Presentation Projector
id: Presentasi powerpoint Proyektor

source: Facilitator explain about quality assurance, show few errors often / usually occurring in digitizing map osm and using the presets.
id: Fasilitator menjelaskan tentang Penjaminan Kualitas, tunjukkan beberapa kesalahan yang sering/biasanya terjadi dalam penggambaran peta OSM dan penggunaan presetnya.

source: Practice
id: Latihan

source: **Practice 150'**
id: **Praktik 150’**

source: Facilitator show proper way to digitizing with JOSM.
id: Fasilitator menunjukkan bagaimana cara mendijitasi yang dilakukan dengan menggunakan JOSM.

source: Show them how to fix the error or warning, if already mapped.
id: Tunjukkan pula bagaimana cara memperbaiki kesalahan tersebut, jika kesalahan penggambaran sudah terlanjur terjadi.

source: Fix error in JOSM can use two validation tools, i.e. validation tools in JOSM and validation site (Keep Right) so all the participants can understand different about warning and error.
id: Memperbaiki kesalahan tersebut bisa menggunakan dua alat validasi yaitu validation tool di JOSM dan validasi di situs (Keep Right) sehingga peserta dapat mengetahui dan membedakan antara warning dan error.

source: Remind the tools/tool that have been studied in the previous session on editing in details such as on the tools menu and more tools.
id: Ingatkan alat-alat/tool yang telah dipelajari pada sesi sebelumnya di editing in detail seperti dalam menu *tools* dan *more tools*.

source: Use the tools to correct existing mistakes, according to the function of each tool/tools like split, merge nodes, add the intersections, etc.
id: Gunakan tool tersebut untuk memperbaiki kesalahan-kesalahan yang ada, sesuai dengan fungsi dari masing-masing alat/tool seperti split, merge nodes, add intersections, dll.

source: at the time of the naming of the object using a preset, the preset again it should be noted that whether or not is in conformity with its object
id: Pada saat penamaan objek menggunakan preset, harus diperhatikan lagi apakah preset tersebut sudah sesuai atau belum dengan objeknya

source: If the participants already understand this material, participants can practice using the validation tool on the site or via JOSM Keep Right
id: Apabila peserta sudah memahami materi ini, peserta dapat mempraktikkannya menggunakan alat validasi di JOSM maupun melalui situs Keep Right

source: Participants are expected to choose a practice area that will be validated based on tasking manager that already made by the facilitator so that at the time of the upload conflict does not occur
id: Untuk praktiknya peserta diharapkan memilih daerah yang akan divalidasi berdasarkan tasking manager yang sudah dibuat oleh fasilitator agar pada saat upload tidak terjadi konflik

source: **Closing 30'**
id: **Penutup 30’**

source: Q & A Session about problem that happen when practice validation validation tools in JOSM or online
id: Tanya jawab mengenai permasalahan/kendala yang terjadi pada saat mempraktikkan alat validasi di JOSM maupun online

source: Q & A
id: Tanya Jawab

source: Session
id: Sesi

source: **Session 3**
id: **Sesi 3**

source: Conflict Resolution when uploading OSM Data
id: Penyelesaian Konflik dalam mengupload data OSM

source: Time : 2 Hours
id: Waktu : 2 Jam

source: Resolving conflict when uploading OSM Data
id: Menyelesaikan konflik dalam mengupload data OSM

source: Conflict occur more less
id: Konflik dapat diminimalisasi

source: **Resolving conflict when uploading OSM data**
id: **Penyelesaian Konflik dalam mengupload data OSM**

source: The facilitator presenting the importance of session, objective outcome and activities
id: Fasilitator menyampaikan pentingnya sesi, tujuan, outcome, dan langkah kegiatan

source: Presentations Projector (get there are two projector)
id: Presentasi powerpoint Proyektor (usahakan ada 2 proyektor)

source: **Group Discussion 15'**
id: **Diskusi Kelompok 15’**

source: The participants are asked to discuss the causes of conflicts and how to solve it in groups.
id: Peserta diminta mendiskusikan apa yang mengakibatkan terjadinya konflik dan bagaimana menyelesaikannya secara berkelompok.

source: One of group presenting the discussion result and the other participants respond.
id: Salah satu kelompok menpresentasikan hasil diskusinya dan peserta lain menanggapi.

source: The facilitator gives reinforcement with a show at the projector screen how a conflict can occurs, by downloading some area around the training location
id: Fasilitator memberikan penguatan dengan tunjukkan di layar proyektor bagaimana proses suatu konflik dapat terjadi, dengan mendownload suatu area di sekitar lokasi training.

source: Presentations Projector
id: Presentasi powerpoint Proyektor

source: **Demonstrations and practices 100'**
id: **Demonstrasi dan praktik 100’**

source: Before displayed with a conflict, facilitator must first be already has data that will be used as a conflict simple, namely data was in OpenStreetMap server and have OSM ID from each points.
id: Sebelum memperagakan konflik, fasilitator terlebih dahulu sudah mempunyai data yang akan digunakan sebagai sampel konflik, yaitu data yang sudah berada di server OpenStreetMap dan mempunyai OSM ID dari setiap titiknya.

source: The facilitator explain the three type of conflicts that arises when uploading a JOSM data. Each conflict described the causes of conflicts, example and how to handle it.
id: Fasilitator menjelaskan tiga jenis konflik yang biasa muncul pada saat mengupload data JOSM. Masing-masing konflik dijelaskan penyebab terjadinya, contoh, dan cara mengatasinya.

source: The facilitator can call other facilitators or one of the participants to practice together in front of how the conflict can occur and how to solve it.
id: Fasilitator bisa memanggil fasilitator lain atau salah seorang peserta untuk mempraktikkan bersama-sama di depan bagaimana konflik tersebut bisa terjadi dan bagaimana cara penyelesaiannya.

source: For the nodes type conflicts, the facilitator explain the existing button function and also meaning each color that appear in conflict one of these. Before that, to make it easier the facilitator could makes notes on OSM ID of the line that will become the nodes type conflict sample.
id: Untuk konflik jenis nodes, fasilitator menjelaskan fungsi dari tombol-tombol yang ada dan juga arti setiap warna yang muncul pada konflik jenis ini. Sebelumnya, agar lebih mudah fasilitator mencatat setiap OSM ID dari garis yang ingin dijadikan sampel konflik jenis nodes.

source: Computer/
id: Komputer/

source: Frequently Asked Question
id: Pertanyaan yang sering muncul

source: **Session 4**
id: **Sesi 4**

source: Time : 150 minutes
id: Waktu : 150 menit

source: Create a preset file in JOSM
id: Membuat file preset pada JOSM
