Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/beginner/osm/101-basic-concept-of-osm-website.po
Languages: id

source: Module 1: Basic Concept of OpenStreetMap Website
id: Modul 1: Konsep Dasar Situs *OpenStreetMap*

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Understanding the concept and definition of OpenStreetMap
id: Memahami konsep dan pengertian *OpenStreetMap*

source: Understanding the definition and objectives of data collection
id: Memahami pengertian dan tujuan pengumpulan data

source: Understanding the composition of a map
id: Memahami komponen dalam peta

source: Make a handwriting sketch of an area
id: Membuat sketsa peta wilayah menggunakan tangan

source: Maps are a good way to convey information. Maps are visual representations of our world. They can often demonstrate an idea better than words. This in turn can also help answer important questions. Where is the closest school or hospital? Who has the least access to these facilities? Where is poverty the most problematic? Questions like these can often best be expressed with maps, and maps can help find solutions to these questions.
id: Peta dapat digunakan dengan baik untuk menyampaikan informasi. Peta merupakan simbol visual dari dunia kita. Mereka sering dapat mendemonstrasikan sebuah ide lebih baik daripada kata-kata. Ini juga dapat membantu untuk menjawab pertanyaan penting. Dimana sekolah atau rumah sakit terdekat? Siapa yang memiliki sedikit akses untuk fasilitas tersebut? Dimanakah lokasi kemiskinan yang paling bermasalah? Pertanyaan seperti ini paling baik diekspresikan dengan peta, dan peta dapat membantu untuk mencari solusi dari pertanyaan-pertanyaan tersebut.

source: **Draw a Map**
id: **Gambar Peta**

source: As an exercise, get a pen and paper and draw a map of your town or village. What are the most important things to include on the map? What is the most important information? Spend a few minutes making your map, and when you’re finished, think about why the information you included is important, and who it might be important to.
id: Sebagai sebuah latihan, ambil sebuah alat tulis dan secarik kertas dan gambarlah sebuah peta dari kota atau desa tempat tinggal Anda. Hal apakah yang paling penting untuk dimasukkan pada peta? Informasi apakah yang paling penting? Berikan waktu selama beberapa menit untuk membuat peta Anda, dan ketika Anda telah selesai, pikirkan tentang kenapa informasi yang Anda masukkan ke dalam peta sangat penting, dan siapa saja yang berkepentingan untuk informasi tersebut.

source: *A village in Indonesia (up), and an example of a handdrawn map (below).*
id: *Sebuah desa di Indonesia (atas), dan sebuah contoh peta yang digambar dengan tangan (bawah)*

source: If your town is like most, you may have drawn some lines to represent roads, possibly a river or stream. Perhaps you added important buildings such as schools and offices, fields, or boundaries. Whatever you drew, you probably used symbols - a line to symbolize a road, a square to symbolize a building, and so on. Your map is a representation of what is on the ground.
id: Jika Anda lebih banyak menggambarkan tentang kota Anda, mungkin Anda menggambarkan beberapa garis untuk merepresentasikan jalanan, atau mungkin juga sebuah aliran sungai. Mungkin Anda juga telah menambahkan bangunan-bangunan penting seperti sekolah dan kantor, lapangan, atau batas wilayah. Apapun yang Anda gambarkan, Anda kemungkinan menggunakan simbol sebuah garis untuk menyimbolkan jalan, sebuah persegi untuk menyimbolkan bangunan, dan seterusnya. Peta Anda merupakan sebuah representasi dari apa yang ada di permukaan bumi.

source: *Examples of Symbols.*
id: *Contoh dari simbol-simbol.*

source: Your map is informative. You might use a map like this to explain to someone where different places are, where problems are in your community, or merely to help someone find their way around. The uses of your map is limited though. There is only one copy of the map and the way you drew it may make sense to you, but perhaps not to someone else who would have drawn their own map in a different way. Because your map is merely on paper, it is difficult to get that information to others. This is why making your map on a computer, in such a way that anyone can access it, can be much more valuable.
id: Peta Anda bersifat informatif. Anda mungkin akan menggunakan peta seperti ini untuk menjelaskan kepada seseorang dimana tempat-tempat berbeda berada, dimana permasalahan yang terdapat dalam komunitas Anda, atau lebih tepatnya untuk membantu seseorang menemukan tempat tujuannya. Namun, kegunaan peta Anda ini terbatas. Dimana hanya terdapat satu buah salinan dari peta dan dari cara Anda menggambarkannya mungkin Anda memahami isinya, tetapi tidak bagi orang lain yang menggambarkan peta tersebut dengan cara yang berbeda. Karena peta Anda ini digambarkan hanya pada secarik kertas, sangat sulit untuk menyampaikan informasi ini ke orang lain. Inilah mengapa Anda membuat peta pada sebuah komputer, dengan cara seperti itu semua orang dapat mengakses peta tersebut dan membuatnya lebih berharga.

source: **Why digital?**
id: **Kenapa digital?**

source: Mapmaking on computers allows us to collect more useful data than on paper. On paper we might draw a school, and even add it’s name and record some information about the school, but on the computer we can attach an endless amount of data about the school, such as the number of students, number of teachers, size of the building, type of structure, and so on. And more importantly, when we add this school to a digital map, we record it’s precise location (longitude and latitude) on the planet. This is invaluable for our future mapmaking and analysis, and we will look more closely at it later on.
id: Pembuatan peta di komputer memungkinkan kita untuk mengumpulkan data yang lebih bermanfaat daripada di atas kertas. Di atas kertas kita mungkin menggambar sekolah, dan bahkan menambah namanya dan merekam beberapa informasi mengenai sekolah tersebut, tetapi di komputer kita dapat melampirkan data mengenai sekolah jumlah tak terbatas, seperti jumlah murid, jumlah guru, ukuran bangunan, jenis struktur bangunan, dan sebagainya. Dan yang lebih penting, ketika kita menambah sekolah ini ke peta digital, kita mencatatnya pada lokasi yang tepat (bujur dan lintang) di Bumi ini. Ini sangat berharga untuk pembuatan peta analisis di masa depan kita.

source: **What is OpenStreetMap?**
id: **Apa itu OpenStreetMap?**

source: OpenStreetMap is a tool for creating and sharing map information. Anyone can contribute to OSM, and thousands of people add to the project every day. Users draw maps on computers, rather than paper, but as we will see in this guide, drawing a map on a computer is not all that different from drawing on paper. We still draw lines to represent roads, fields, and anything else, and we still represent schools and hospitals with symbols. The important thing is that OSM maps are saved on the internet, and anyone can access them at any time, totally free.
id: OpenStreetMap adalah sebuah alat untuk membuat dan berbagi informasi dalam bentuk peta. Siapapun dapat berkontribusi untuk OSM, dan ribuan orang menambahkan proyek setiap harinya. Para pengguna menggambarkan peta pada komputer, dibandingkan dengan kertas, tetapi kita akan melihat pada panduan ini, menggambar sebuah peta pada sebuah komputer tidak jauh berbeda dengan menggambar peta pata secarik kertas. Kita masih menggambarkan garis untuk merepresentasikan jalan, lapangan, dan lain-lain, dan kita masih merepresentasikan sekolah dan rumah sakit dengan simbol. Hal yang paling penting adalah peta OSM disimpan di dalam internet, dan siapapun dapat mengakses peta tersebut kapanpun, gratis.

source: *Digital Maps with OpenStreetMap.*
id: *Peta Digital dengan OpenStreetMap.*

source: OpenStreetMap is digital, which makes it extremely useful for us, and it is shared, which means that everybody benefits from the work of everybody else. The basic idea is this: if you make a map of your street and I make a map of my street, and then more people make maps of their streets, we all can share these maps and this data on a common platform, and use the data for our own projects.
id: OpenStreetMap bersifat **digital**, yang membuatnya sangat berguna untuk kita dan dapat **dibagikan**, yang berarti bahwa semua orang dapat mengambil manfaat dari pekerjaan orang lain. Ide dasar ini adalah: jika Anda membuat peta jalan Anda dan kemudian lebih banyak orang membuat peta jalan mereka, kita semua dapat berbagi peta dan data ini di platform yang sama, dan menggunakan data untuk proyek kita sendiri.

source: In the optional module at the start of this training, we used a file that contained buildings in Jakarta. This data came from OpenStreetMap. While no single person could have mapped 13,000 buildings, many different people contributing just a little bit at a time provided us with a data file that allows us to do very impressive analysis, and help an entire community prepare for the next time there is a flood. In this sense, the work is somehow cyclical. The community contributes data so that emergency managers can design highly effective contingency plans, and those plans may then be used to benefit the community at large. And the more data that the community provides, the better the contingency planning can be.
id: Dalam modul pilihan di awal pelatihan ini, kita menggunakan file yang berisi bangunan-bangunan di Jakarta. Data ini berasal dari OpenStreetMap. Walaupun tidak ada seorang pun dapat memetakan 13.000 bangunan, setiap orang berbeda dalam memberikan kontribusi ada yang hanya sedikit pada suatu waktu memberikan kita file data yang memungkinkan untuk melakukan analisis yang sangat mengesankan, dan membantu seluruh komunitas untuk dapat mempersiapkannya pada saat terjadi banjir. Dalam hal ini, pekerjaan sesuai dengan bagaimana siklusnya. Komunitas memberikan kontribusi data sehingga manager darurat dapat merancang rencana kontijensi yang lebih efektif, dan rencana ini dapat digunakan untuk kepentingan masyarakat luas. Dan semakin banyak data yang masyarakat berikan, semakin baik perencanaan kontijensi yang didapat.

source: In this unit, you will learn how to make a digital map. You will learn how to use the OpenStreetMap platform, and you will make your first edits and additions to the worldwide map.
id: Dalam unit ini, Anda akan belajar bagaimana membuat peta digital. Anda akan belajar bagaimana menggunakan platform OpenStreetMap, dan Anda akan membuat perubahan pertama Anda dan penambahan pada peta di seluruh dunia.
