Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/beginner/osm/102-working-with-osm.po
Languages: id

source: Module 2: Working with OSM
id: Modul 2: Pengoperasian *OSM*

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Visit OpenStreetMap website
id: Mengunjungi situs *OpenStreetMap*

source: Navigate map in OpenStreetMap website
id: Dapat menavigasikan Peta *OpenStreetMap*

source: Saving image from OpenStreetMap
id: Menyimpan Gambar dari Peta *OpenStreetMap*

source: Register an OpenStreetMap account
id: Mendaftar akun *OpenStreetMap*

source: Editing a map
id: Mengedit peta dengan *Potlatch 2*

source: Save Edits
id: Menyimpan hasil editing

source: In this module we will learn step by step how to navigate the OpenStreetMap website, view and print maps, and sign up for a user account. After you have your own username and password, you will be able to add your first points to the map.
id: Pada modul ini kita akan mempelajari langkah demi langkah bagaimana mengoperasikan situs *OpenStreetMap*, melihat dan mencetak peta, dan mendaftar untuk sebuah akun pengguna. Setelah Anda memiliki nama pengguna dan kata kunci Anda sendiri, Anda dapat menambahkan titik pertama Anda pada peta.

source: **1. Visit the OpenStreetMap Website**
id: **1. Mengunjungi situs OpenStreetMap**

source: Be sure that your computer is on and you are connected to the internet.
id: Yakinkan bahwa komputer Anda telah aktif dan Anda terhubung dengan koneksi internet.

source: To visit the OpenStreetMap website, you need to open your web browser. Start your browser - Firefox, Chrome, Opera, or Internet Explorer.
id: Untuk mengunjungi situs *OpenStreetMap*, Anda perlu membuka web browser Anda. Jalankan browser Anda - *Firefox, Chrome, Opera*, atau *Internet Explorer*.

source: In the address bar at the top of the window, enter the following text: `www.openstreetmap.org <http://www.openstreetmap.org>`_
id: Pada kolom alamat di atas jendela, masukan teks berikut ini: `www.openstreetmap.org <http://www.openstreetmap.org>`_

source: When the page has finished loading, you should see something like this:
id: Ketika halaman selesai memuat, Anda harusnya melihat halaman seperti di bawah ini:

source: **2. Navigate the Map**
id: **2. Menavigasikan Peta**

source: The main thing you should see is the map. Move the map by clicking on it with your left mouse button, holding the button down, and dragging your mouse around.
id: Hal utama yang seharusnya Anda lihat adalah peta. Geser peta tersebut dengan mengklik di atasnya dengan tombol kiri mouse, tahan tombol tersebut, dan geser mouse Anda.

source: If you have a mouse with a scroll-wheel, zoom in and out on the map by turning the wheel. If you don’t have a scroll-wheel, use the :guilabel:`+` and :guilabel:`-` buttons on in the upper right corner of the map.
id: Jika Anda memiliki sebuah mouse dengan roda-gulir, perbesar dan perkecil peta itu dengan menggeser roda tersebut. Jika Anda tidak memiliki roda-gulir, gunakan tombol :guilabel:`+` dan :guilabel:`-` yang ada di pojok kanan atas peta.

source: To search for a place, :guilabel:`Left Click` in the box labeled :guilabel:`Search` on the left side of the page. Type in the name of your town or village and press :guilabel:`Enter`. A window should appear to the left of the map with the results of your search. Click on the location that looks like the one you want. The map will automatically move to the location you chose.
id: Untuk melakukan pencarian tempat, :guilabel:`klik kiri` pada sebuah kotak yang bertuliskan :guilabel:`Search` pada sisi kiri halaman. Ketik nama kota atau desa Anda dan tekan :guilabel:`Enter`. Sebuah jendela akan muncul di sebelah kiri peta dengan hasil pencarian Anda. Klik pada lokasi yang seperti kriteria lokasi yang Anda cari. Peta secara otomatis akan menggeser ke lokasi yang Anda pilih.

source: **3. Save an Image of the OSM Map**
id: **3. Menyimpan Gambar dari Peta OSM**

source: If you want to save an image from OpenStreetMap that you can easily print, follow these instructions.
id: Jika Anda ingin menyimpan sebuah gambar dari *OpenStreetMap* yang dapat Anda cetak dengan mudah, ikuti instruksi ini.

source: Just above the map, click on the button labeled :guilabel:`Share` on the right side of the map.
id: Pada halaman peta, klik tombol :guilabel:`Share` di sisi kanan peta.

source: Then will appears option like this:
id: Selanjutnya akan muncul pilihan seperti ini:

source: In the Image section, check :guilabel:`Set custom dimensions` if you want to manually specify which area you want to download. If you do not select the option, then the area that will be downloaded to adjust the map you're currently on.
id: Pada bagian **Image**, centang :guilabel:`Set custom dimensions` jika Anda ingin menentukan secara manual daerah yang akan Anda download. Jika Anda tidak mencentang pilihan tersebut, maka area yang akan terdownload menyesuaikan dengan peta yang sedang Anda tampilkan.

source: You can download the image in PNG, JPEG, SVG or PDF format according to your needs.
id: Anda dapat mendownload gambar dengan **format** PNG, JPEG, SVG atau PDF sesuai dengan kebutuhan Anda.

source: You can also determine the scale of the map that will be downloaded by entering the scale rate.
id: Anda juga dapat menentukan skala peta yang akan di download dengan memasukkan angka skala yang Anda inginkan.

source: Then click :guilabel:`Download`. The download process will start. It will be stored in your computer.
id: Setelah itu Klik :guilabel:`Download`. Proses download akan dimulai. Simpan dalam komputer Anda.

source: Open the file that you have downloaded. If you want to print, you can select :guilabel:`Print` from the :menuselection:`File` menu, after you connect your computer to a printer.
id: Buka file yang telah Anda download tadi. Jika Anda ingin mencetaknya, Anda dapat memilih :guilabel:`Print` dari menu :menuselection:`File`, setelah Anda menghubungkan komputer Anda dengan sebuah printer.

source: **4. Create an OpenStreetMap Account**
id: **4. Membuat Akun OpenStreetMap**

source: Now that you have seen what the main website looks like, you can register for a username and password and make your first additions to the map.
id: Sekarang Anda telah melihat bagaimana situs utama terlihat, Anda dapat mendaftarkan sebuah nama pengguna dan kata kunci serta menambahkan objek-objek pertama Anda pada peta.

source: Go back to the OpenStreetMap website. Click :guilabel:`sign up` in the top right corner of the page.
id: Kembali ke situs *OpenStreetMap*. Klik :guilabel:`sign up` pada pojok kanan atas halaman.

source: You should see a new page that looks like this:
id: Seharusnya Anda akan melihat halaman baru sebagai berikut:

source: There are five boxes on this page that you need to fill in to register an account with OSM.
id: Terdapat lima kotak pada halaman ini yang perlu Anda isi untuk mendaftarkan sebuah akun dengan *OSM*.

source: Enter your email address in the first two boxes. You should enter the same email address in both boxes. Later, you will need to open your email to confirm your account with OpenStreetMap.
id: Ketik alamat email Anda pada dua kotak pertama. Kemudian, Anda perlu membuka email Anda untuk mengkonfirmasi akun Anda dengan *OpenStreetMap*.

source: In the third box, enter the username that you would like to have. You will not be able to choose a username that someone else has chosen before, so it should be creative. If you try to enter something simple, like your first name, it is likely that someone has already claimed that name.
id: Pada kotak ketiga, ketikan nama pengguna yang Anda inginkan. Anda tidak akan dapat memilih sebuah nama pengguna yang orang lain sudah pilih sebelumnya, jadi nama pengguna ini haruslah unik. Jika Anda mencoba mengetikkan sesuatu yang sederhana, misalnya hanya nama pertama Anda, kemungkinan seseorang sudah mengklaim nama tersebut.

source: Enter a new password in the fourth and fifth boxes. You should enter the same password in both boxes. It does not need to be the same as the password for your email.
id: Masukan sebuah kata kunci baru pada kotak keempat dan kelima. Anda harus mengisi kata kunci yang sama pada kedua kotak. Kata kunci tidak harus sama dengan kata kunci email Anda.

source: You will want to remember your user name and your password so that you can login later. You may want to write down your OSM username and password.
id: Anda harus mengingat nama pengguna dan kata kunci Anda sehingga Anda dapat masuk ke *OSM* nantinya. Anda mungkin ingin mencatat nama pengguna dan kata kunci *OSM* Anda.

source: After you have completed all the boxes, click :guilabel:`Continue` at the bottom of the page.
id: Setelah Anda telah menyelesaikan semua kotak, klik :guilabel:`Continue` pada bagian bawah halaman.

source: If there are any problems, an error message may pop up. Check to make sure that your email is the same in the first to boxes, and your password is the same in the bottom two boxes. If the third box is highlighted red, it means that someone else has already chosen your username, and you should try a different name.
id: Jika Anda memiliki masalah, sebuah pesan kesalahan akan muncul. Pastikan alamat email Anda sama di kotak pertama maupun kotak kedua, dan kata kunci Anda sama pada baris keempat dan baris kelima. Jika baris ketiga ditandai berwarna merah, artinya seseorang telah memilih nama pengguna yang sama dengan Anda, dan Anda harus mencoba nama yang berbeda.

source: Open a separate window or tab in your internet browser, and navigate to your email. Common email sites are `mail.yahoo.com <http://mail.yahoo.com>`_ and `gmail.com <http://gmail.com>`_
id: Bukalah sebuah jendela baru atau tab baru pada browser internet Anda, dan arahkan ke email Anda. Situs email yang umum adalah `mail.yahoo.com <http://mail.yahoo.com>`_ dan `gmail.com <http://gmail.com>`_

source: Enter your email address and your email password to open your email. Note that this is not the same as your OpenStreetMap username and password.
id: Ketikan alamat email Anda dan kata kunci email Anda untuk membuka email Anda. Catatan bahwa ini **tidak sama** dengan nama pengguna dan kata kunci *OpenStreetMap*.

source: If everything was successful with your registration, you should see an email from OpenStreetMap in your inbox. Open the email. It should look like the image below. Click on the link that is identified below:
id: Jika semuanya telah sukses dengan registrasi, Anda seharusnya melihat sebuah email dari *OpenStreetMap* pada **inbox email** Anda. Buka email tersebut. Seharusnya akan terlihat seperti gambar di bawah. Klik pada tautan seperti yang ditunjukan di bawah ini:

source: A new tab or window will open. If everything went well, you should have an OSM account!
id: Sebuah tab atau jendela baru akan terbuka. Jika semuanya berjalan lancar, seharusnya Anda telah memiliki akun *OSM*!

source: On the OpenStreetMap page, click “log in” in the top right corner. Enter your OpenStreetMap username and password and press Enter. You should now be logged in. You should see your username in the upper right corner of the page.
id: Pada halaman *OpenStreetMap*, klik :guilabel:`log in` pada pojok kanan atas. Ketik nama pengguna dan kata kunci *OpenStreetMap* Anda dan tekan :guilabel:`Enter`. Anda seharusnya bisa masuk. Anda akan melihat nama pengguna Anda pada pojok kanan atas halaman.

source: **5. Adding Your First Points**
id: **5. Menambahkan Titik Pertama Anda**

source: Now that you are logged in with your username on the OpenStreetMap website, you can use the Potlatch editor to add your first point to the map.
id: Sekarang Anda telah masuk dengan nama pengguna Anda pada situs *OpenStreetMap*, Anda dapat menggunakan editor *Potlatch* untuk menambahkan titik pertama Anda pada peta.

source: Move the map to a place that you know very well, such as your town or village.
id: Geser peta pada sebuah tempat yang Anda ketahui, misalnya kota atau desa tempat Anda tinggal.

source: Zoom in to a place where you would like to add a point to the map.
id: Perbesar pada sebuah area yang ingin Anda tambahkan titiknya pada peta.

source: Just above the map on the left, there is a tab marked :guilabel:`Edit`. Hover your mouse over this button, but don’t click. You should see a menu drop down.
id: Di atas peta di sebelah kiri, terdapat sebuah tab yang tertulis :guilabel:`Edit`. Arahkan pointer mouse Anda ke tab tersebut, tetapi jangan diklik. Anda seharusnya akan melihat menu tambahan di bawahnya.

source: Click :guilabel:`Edit with Potlatch 2 (in-browser editor)`
id: Klik :guilabel:`Edit with Potlatch 2 (in-browser editor)`

source: The online editor for OpenStreetMap should open. If a window pops up, press :guilabel:`OK`
id: Editor online untuk *OpenStreetMap* akan terbuka. Jika sebuah jendela muncul, klik :guilabel:`OK`.

source: You can add a point to the map by clicking on an icon on the left, and dragging it to its location on the map. After you add the point and are satisfied that it is correct, click :guilabel:`Save` in the upper right corner.
id: Anda dapat menambahkan sebuah titik pada peta dengan mengklik pada sebuah ikon di sebelah kiri, dan menggesernya pada lokasinya pada peta. Setelah Anda menambahkan titik dan merasa yakin dengan lokasinya, klik :guilabel:`Save` pada pojok kanan atas.

source: If you are not sure about the accuracy of the point(s) you add, don’t click :guilabel:`Save` ! Play around with the Potlatch editor, but don’t save your changes.
id: jika Anda tidak yakin terhadap keakuratan perubahan yang Anda tambahkan, jangan klik :guilabel:`Save`. Berlatihlah dengan editor Potlatch.
