Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/beginner/osm/103-working-with-josm.po
Languages: id

source: Module 3: Working with JOSM
id: Modul 3: Pengoperasian JOSM

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Download JOSM
id: Melakukan download JOSM

source: JOSM Installation
id: Melakukan instalasi JOSM

source: JOSM Preferences
id: Mengubah pengaturan JOSM

source: Using Basic Tools
id: Menggunakan tool dasar

source: Drawing nodes, way, and shape in JOSM based on map that you made in the previous session
id: Menggambar titik, garis dan bentuk pada JOSM berdasarkan hasil peta kertas yang telah dibuat di sesi sebelumnya

source: Change Objects
id: Mengubah objek

source: Add information to the objects using ‘presets’ menu
id: Memberikan informasi terhadap objek dengan menggunakan menu ‘Presets’

source: In this module we will learn step by step how to download and install JOSM, the Java OpenStreetMap editor. We will change some of the settings in JOSM to make it easier to use. Then we will open a sample map and learn some of the basic operations of the software. Remember in Module 1 when we asked you to draw a map of your town or village? We will conclude this module by drawing your map again, this time digitally. After this you should have a good understanding of how to draw maps in JOSM.
id: Dalam modul ini kita akan mempelajari langkah-langkah bagaimana untuk mendownload dan menginstal JOSM, Editor Java OpenStreetMap. Kita akan mengubah beberapa pengaturan di JOSM untuk memudahkan kita menggunakan JOSM. Lalu kita akan membuka sebuah peta contoh dan mempelajari beberapa operasi dasar dari software ini. Ingatkah bahwa di Modul 1 kita diminta untuk menggambarkan sebuah peta dari kota atau lingkungan sekitar kita? Kita akan memasukkannya kembali di dalam modul ini dengan menggambarkan peta Anda kembali tetapi dengan cara digital. Setelah mempelajari modul ini Anda akan mendapatkan pemahaman yang baik bagaimana untuk menggambar peta di JOSM.

source: There is a copy of JOSM in the software/ folder that of the package that accompanies this guide. If you don’t have this or would like the most up-to-date version, follow the instructions here. Otherwise skip to section 2. Install JOSM.
id: Ada software JOSM di folder yang terdapat dalam paket panduan ini. Jika Anda belum memilikinya atau ingin memperbaharui versi JOSM, ikuti perintahnya di sini. Jika tidak Anda dapat melewati bagian ini dan langsung menuju sesi 2. Menginstal JOSM.

source: Open your web browser - this may be Firefox, Chrome, Opera, or Internet Explorer.
id: Buka browser internet Anda - misalnya Firefox, Chrome, Opera, atau Internet Explorer.

source: In the address bar at the top of the window, enter the following text and press Enter: `josm.openstreetmap.de <http://josm.openstreetmap.de>`_
id: Dalam kotak alamat yang berada di atas jendela, masukkan alamat ini :`josm.openstreetmap.de <http://josm.openstreetmap.de>`_

source: You can also find this website by searching for JOSM
id: Anda juga dapat menemukan situs ini dengan mencarinya dengan kata kunci “JOSM”

source: The website should look something like this:
id: Situs tersebut seharusnya nampak seperti ini :

source: If you have Windows installed on your computer, click :guilabel:`Windows Installer` to download JOSM. If you have a different operating system, click on the link for your system. Your download should begin. In this module we will assume that you are using Windows, but the instructions are similar for other operating systems.
id: Jika Anda menggunakan sistem operasi Windows maka pilih :guilabel:`Windows Installer` untuk mendownload JOSM. Jika Anda menggunakan sistem operasi yang lain, klik tautan pada sistem, Anda akan segera men-download JOSM. Dalam modul ini kita mengasumsikan Anda semua menggunakan Windows, akan tetapi untuk Sistem Operasi yang lain langkah-langkahnya tidak akan jauh berbeda.

source: **2. Install JOSM**
id: **2. Cara Menginstal JOSM**

source: You may have problems installing JOSM if Java is not already installed on your computer. You can install Java by running **jre-7u21-windows-i586** in the software/ folder. You can also download it here: `http://www.java.com/en/download/ <http://www.java.com/en/download/>`_
id: Anda mungkin memiliki masalah dalam menginstal JOSM jika Java belum terinstal di komputer Anda. Anda dapat menginstal java terlebih dahulu dengan menjalankan jre-7u21-windows-i586 yang terdapat dalam software/ folder. Anda juga dapat mendownloadnya disini :`http://www.java.com/en/download/ <http://www.java.com/en/download/>`_

source: Find the JOSM install file on your computer. It should be named **josm-setup.exe**. Double-click it to begin setup.
id: Temukan file untuk menginstal JOSM di komputer Anda. File tersebut bernama **josm-setup.exe**. Klik 2 kali untuk memulai menginstall.

source: Click :guilabel:`OK`, :guilabel:`Next`, :guilabel:`I Agree`, and :guilabel:`Install`. When the installation is complete, click :guilabel:`Finish` to launch JOSM for the first time. Later, when you want to start JOSM, you can do so by clicking on the :menuselection:`Start Menu` in the lower left corner of your computer, and clicking the program JOSM.
id: Klik :guilabel:`OK`, :guilabel:`Next`, :guilabel:`I Agree`, dan :guilabel:`Install`. Ketika instalasi telah selesai, klik :guilabel:`Finish`untuk membuka JOSM Anda. Jika tidak Anda juga dapat memulai JOSM dengan klik :menuselection:`Start Menu` yang berada di sudut kiri bawah komputer Anda dan klik program JOSM.

source: You may see a window pop up that asks if you want to update the software. You don’t need to update it since it is new. Press the button that says :guilabel:`Cancel`. If you don’t ever want to see this message again, check the box at the bottom before pressing :guilabel:`Cancel`
id: Anda akan melihat jendela pop up yang akan meminta Anda untuk memperbaharui software JOSM ini. Anda tidak harus melakukannya. Tekan tombol :guilabel:`Cancel` . Jika Anda tidak mau untuk melihat pesan ini lagi, beri tanda centang pada kotak yang berada di bawah sebelum memilih :guilabel:`Cancel` .

source: When JOSM starts, it will look something like this:
id: Ketika JOSM Anda dibuka, tampilannya akan seperti ini :

source: **3. Change JOSM Settings**
id: **3. Cara Mengubah Pengaturan JOSM**

source: Before we begin using JOSM, it’s a good idea to change some of the settings so that is will be easier to use. To change the settings, click :guilabel:`Edit` on the top menu, and then click :guilabel:`Preferences`
id: Sebelum kita memulai menggunakan JOSM, kita sebaiknya melakukan perubahan terhadap beberapa pengaturan yang akan lebih memudahkan kita ketika menggunakan JOSM. Untuk mengubah pengaturan, klik :guilabel:`Edit` yang berada pada menu di atas lalu klik :guilabel:`Preferences`

source: *3.1. Add Bing Imagery*
id: *3.1. Cara Menambahkan Citra Satelit Bing*

source: We want to be able to use satellite imagery when we are making our maps, so let’s add that from the Preferences window. On the left side of the Preferences window there are different icons for different settings. Click on the icon that says :guilabel:`WMS TMS`. You may need to click on the down arrow to find it:
id: Kita dapat menggunakan citra satelit ketika akan membuat peta kita, sehingga kita akan memasukkannya melalui jendela pengaturan. Pada sebelah kiri jendela pengaturan terdapat beberapa ikon/simbol yang mewakili pengaturan tertentu. Klik ikon yang menyatakan :guilabel:`WMS TMS` . Anda mungkin perlu untuk mengklik ke bawah untuk menemukannya :

source: Click on :guilabel:`Bing Sat`. Then Click :guilabel:`Activate`.
id: Klik :guilabel:`Bing Sat`. Lalu klik :guilabel:`Activate`.

source: You should now see :guilabel:`Bing Sat` in the list below the :guilabel:`Activate` button.
id: Anda akan melihat :guilabel:`Bing Sat` dalam daftar yang berada di atas tombol :guilabel:`Activate`

source: *3.2. Add Presets*
id: *3.2. Cara Menambahkan Presets*

source: We will be using presets so that we can add special data to OpenStreetMap. Don’t worry if this is unclear right now - we will learn more about it as we go along.
id: Kita akan menggunakan presets sehingga kita dapat menambahkan data khusus yang kita inginkan ke dalam OpenStreetMap. Jangan khawatir jika hal ini belum jelas bagi Anda, kita akan mempelajarinya seiring dengan panduan ini.

source: You should still have the Preferences window open. If you don’t, click :menuselection:`Edit ‣ Preferences` to open the window.
id: Jendela pengaturan Anda seharusnya masih terbuka. Jika tidak klik :menuselection:`Edit ‣ Preferences` untuk membukanya.

source: On the left side, click the icon that looks like a grid.
id: Pada sebelah kiri, klik ikon yang terlihat seperti grid di bawah ini.

source: Click the tab at the top that reads :guilabel:`Tagging Presets`.
id: Klik pada kotak di sebelah atas yang bernama :guilabel:`Tagging Presets`.

source: Under ':guilabel:`Available Presets` find and select the entry labelled :kbd:`Buildings Indonesia` Then click the blue arrow to the right of this box.
id: Dibawah :guilabel:`Preset tersedia` cari dan pilih preset yang bernama :kbd:`Buildings Indonesia` Lalu klik tanda panah biru yang berada di sebelah kanan kotak.

source: Click :guilabel:`OK`.
id: Klik :guilabel:`OK`.

source: *3.3. Add Plugins*
id: *3.3. Penambahan berbagai Plugin*

source: We can use a plugins for certain purpose. At JOSM there are several plugins that can be downloaded.
id: Kita dapat menggunakan plugin untuk keperluan tertentu. Pada JOSM terdapat beberapa plugin yang dapat didownload.

source: To download the plugins that we need, we must first open the Preferences window.
id: Untuk mendownload plugin yang kita butuhkan, kita harus membuka jendela Preferensi terlebih dahulu.

source: In the :guilabel:`Preferences` window, click the :guilabel:`Plugin` icon to the left:
id: Pada jendela :guilabel:`Preferences`, di sebelah kiri klik ikon :guilabel:`Plugin`

source: In the plugin window, first you need to download the plugin list by clicking :guilabel:`Download list`. It will takes a few minutes.
id: Pada jendela Plugin, Anda butuh mendownload daftar plugin terlebih dahulu dengan meng-klik :guilabel:`Download list`. Mendownload daftar plugin ini membutuhkan waktu beberapa menit.

source: After the plugin list appears, type the name of the plugin you want to download in the :guilabel:`Search`
id: Setelah daftar plugin muncul, ketikkan nama plugin yang ingin Anda download pada kotak :guilabel:`Search`

source: After found the plugin will be downloaded, give a 'check' on the left of the plugin name.
id: Setelah menemukan plugin yang akan didownload, berikan ‘tanda centang’ di sebelah kiri nama plugin.

source: *3.4. Change Language*
id: *3.4. Cara Memilih Bahasa*

source: JOSM has been translated into many languages. If it has been translated into your language, you can change it in the :guilabel:`Preferences`.
id: JOSM telah diterjemahkan ke dalam berbagai bahasa. Jika bahasa Anda sudah diterjemahkan maka Anda dapat menggunakannya, dengan menggantinya di :guilabel:`Preferences`.

source: If you don’t have the Preferences window open, click :menuselection:`Edit ‣ Preferences`.
id: Jika kotak Preferensi Anda belum terbuka, klik :menuselection:`Edit ‣ Preference`.

source: On the left side, click the icon that looks like a paint can and paintbrush.
id: Di sebelah kiri, klik ikon yang terlihat seperti kaleng cat dan kuas.

source: At the top of the window, click the tab that says :guilabel:`Look and Feel`.
id: Di atas jendela, klik kotak yang bernama :guilabel:`Look and Feel`.

source: Choose your language in the dropdown box next to the word :guilabel:`Language`
id: Pilih bahasa Anda di kotak daftar pilihan disebelah kata :guilabel:`Language`

source: You need to restart JOSM to save your settings. Click :menuselection:`File` in the upper left corner, and Click :menuselection:`Exit` at the bottom of the menu.
id: Anda harus restart JOSM untuk menyimpan pengaturan Anda. Klik :menuselection:`File` pada kiri atas, dan klik :menuselection:`Exit` dibawah Menu.

source: Start JOSM again by going to the Windows :menuselection:`Start Menu` in the bottom left corner. Find JOSM and click on it to start.
id: Mulai dan buka JOSM kembali dengan membuka Windows :menuselection:`Start Menu` di sudut kiri bawah. Cari JOSM dan klik untuk memulai.

source: *4. Learn Basic Drawing with JOSM*
id: *4. Latihan Dasar Menggambar dengan JOSM*

source: Now let’s open up a sample OSM file which we will use to learn the basic ways to draw maps with JOSM. Note that this map is not real, in that it is not a real map of a real place, so we will not save it on OpenStreetMap.
id: Sekarang silahkan buka contoh file OSM yang akan digunakan untuk mempelajari cara dasar dalam menggambar peta dengan JOSM. Perlu diingat bahwa peta ini hanya untuk latihan, jadi kita tidak akan menyimpan hasil peta ini dalam OpenStreetMap.

source: The file is located in osm/ and is named sample.osm
id: File ini berlokasi di osm/ dan namanya sample.osm.

source: Let’s open the sample map file in JOSM. Open JOSM. Click the :guilabel:`Open` button in the upper left.
id: Silahkan buka contoh file peta di JOSM. Buka JOSM. Klik tombol :guilabel:`Open` di sebelah kiri atas

source: Find the file sample.osm. Click on it, and then click :guilabel:`Open`.
id: Anda akan menemukan file sample.osm. Klik :guilabel:`Open`.

source: You should now see a sample map, similar to this:
id: Anda akan melihat contoh peta seperti ini :

source: *4.1. Basic Operations*
id: *4.1. Operasi Dasar*

source: To move the map left or right, up or down, hold your right mouse button down, and move your mouse.
id: Untuk menggerakkan peta ke kanan atau ke kiri, naik atau turun, caranya dengan klik kanan lalu tahan gerakkan mouse Anda.

source: There are several ways to zoom in and out of the map. If you have a mouse, you can use your scroll wheel to zoom in and out. If you are using a laptop and don’t have a mouse, you can zoom in and out using the scale bar in the upper left of the map window. Drag the bar left and right by holding your left mouse down and moving the bar left or right with your mouse.
id: Ada beberapa cara untuk memperbesar dan memperkecil peta Anda. Jika Anda memiliki mouse, Anda dapat menggulir roda yang ada pada mouse Anda untuk memperbesar atau memperkecil peta. Jika Anda menggunakan laptop dan tidak memiliki mouse Anda dapat memperbesar dan memperkecilnya menggunakan skala baris di sebelah kiri di jendela peta Anda. Tahan dan geser ke kiri dan ke kanan dengan mouse Anda.

source: Look at the sample map. There a few different types of objects here. There is a river, a forest, some buildings, several roads, and a couple of shops. To select an object, click on it with your left mouse button.
id: Lihat peta contoh. Terdapat beberapa perbedaan jenis objek di sana. Ada sungai, hutan, beberapa bangunan, jalan dan tempat berbelanja. Untuk memilih objek, klik kiri pada objek tersebut.

source: *4.2. Points, Lines, and Shapes (polygon)*
id: *4.2. Titik, Garis dan Bentuk (poligon)*

source: As you click different objects on the sample map, notice that there are three different types of objects on the map. There are points, lines, and shapes (polygon). For 'shapes' word, in mapping it is usually called as a 'polygon'.
id: Ketika Anda mengklik objek yang berbeda pada peta, perhatikan bahwa terdapat 3 jenis objek pada peta tersebut. Ketiga jenis objek tersebut adalah titik, garis dan bentuk (poligon). Untuk istilah ‘bentuk’, dalam pemetaan biasanya disebut sebagai ‘poligon’.

source: Points are a single location, represented by symbols. On this sample map, there are two points, a clothing shop and a market. The clothing shop is represented by a shirt symbol, and the market is represented by a shopping cart.
id: Titik adalah suatu lokasi yang digambarkan dengan simbol. Dalam peta ini terdapat 2 titik, yaitu toko baju dan pasar. Toko baju digambarkan dengan simbol kaos dan pasar digambarkan dengan simbol keranjang belanja.

source: There are several lines on the map as well, which represent roads. If you look closely you will see that within the lines, there are points as well. These points don’t have any symbols or other information associated with them, but they help to define where the line is located.
id: Ada beberapa garis yang terdapat didalam peta, yang menggambarkan jalan. Jika Anda melihat dengan lebih teliti akan melihat dalam garis terdapat titik-titik. Titik-titik tersebut tidak memiliki simbol atau informasi apapun tetapi akan membentuk garis tersebut.

source: Lastly, there are numerous shapes on the sample map, representing different places - a forest, a river, and buildings. A shape generally represents an area, like a field or a building. A shape is exactly like a line - the only difference is that the line begins at the same point where it ends.
id: Terakhir, ada beberapa poligon dalam peta contoh ini yang menunjukkan tempat-tempat yang berbeda seperti hutan, sungai dan bangunan. Suatu poligon secara umum mewakili suatu area seperti lapangan ataupun bangunan. Poligon sama seperti garis akan tetapi perbedaannya poligon terdiri dari beberapa garis yang membentuk dimana titik akhir berada sama dengan titik awal garis tersebut.

source: You may notice that when you select an object, a list appears to the right of the map in a window called :guilabel:`Properties`. These are known as tags. **Tags** are information that is tied to a point, line or shape that describes what it is. For now all you need to know is that this information helps describe whether our object is a forest, a river, a building, or something else.
id: Anda akan menyadari ketika objek yang Anda pilih, akan muncul beberapa daftar di sebelah kanan jendela yang disebut “Properti”. Hal ini disebut sebagai tags. Tags adalah informasi yang merupakan bagian dari suatu titik, garis ataupun poligon yang memberitahukan informasi objek tersebut. Untuk sekarang yang Anda butuhkan adalah mengetahui informasi ini untuk menjelaskan apakah objek Anda itu hutan, sungai atau bangunan atau bentuk lain.

source: Think about drawing a map by hand, and how you are also drawing points, lines, and shapes. What other places are best represented by points? Lines? Shapes?
id: Pikirkan tentang menggambarkan peta dengan tangan. Objek apa yang paling tepat untuk mewakilkan titik? Garis? Bentuk/poligon?

source: Now, let’s try to practice drawing an object (point, line and shape).
id: Sekarang, mari kita coba praktek menggambar suatu objek (titik, garis dan bentuk).

source: On the left side of a JOSM is a column of buttons. Many of these buttons open new windows on the right side that provide more information about the map. The most important buttons, however, are at the top of these column. These buttons change what you can do with your mouse.
id: Di sebelah kiri dari JOSM terdapat kolom yang terdapat berbagai macam tombol. Banyak dari tombol-tombol ini akan membuka jendela baru di sebelah kanan yang akan menampilkan informasi pada peta Anda. Tombol yang paling penting terdapat di sebelah atas kolom. Tombol-tombol tersebut dapat merubah apa yang Anda lakukan dengan mouse Anda.

source: The top four buttons in this column are the most important. They allow you to: :guilabel:`Select`, :guilabel:`Draw`, :guilabel:`Zoom in`, :guilabel:`Delete`
id: Empat tombol yang utama pada kolom ini merupakan yang paling penting. Ini memungkinkan Anda untuk :guilabel:`Memilih`, :guilabel:`Menggambar`, :guilabel:`Memperbesar`, :guilabel:`Menghapus`

source: Until now, you have been using the :guilabel:`Select` tool, which looks like this:
id: Hingga sekarang, Anda telah menggunakan alat bantu :guilabel:`Select`, yang fungsinya untuk memilih objek. Terlihat seperti ini :

source: Before you draw, you need to make sure that nothing is selected. Click in the black space on the map, where it is empty, to make sure nothing is selected.
id: Sebelum Anda menggambar, Anda harus memastikan tidak ada objek lain yang dipilih. Klik pada ruang yang kosong di peta.

source: Click on the second button, the :guilabel:`Draw` tool.
id: Klik tombol kedua, :guilabel:`Menggambar`.

source: Find an empty area on the map, and double-click with your mouse. This will draw a single point.
id: Temukan area kosong pada peta dan klik dua kali dengan mouse Anda. Ini akan membantu Anda membuat titik.

source: To draw a line, single-click with your mouse. Move your mouse and click again. Continue until you are happy with your line. To end the line, double-click your mouse.
id: Untuk menggambar garis, klik dengan mouse Anda lalu gerakkan mouse Anda dan klik lagi. Lanjutkan hingga Anda sudah merasa garis yang dibuat sesuai. Untuk mengakhiri, klik dua kali dengan mouse Anda.

source: Draw a shape the same way that you draw a line, but finish the shape by double-clicking on the point where you started the line.
id: Menggambar poligon caranya hampir sama dengan menggambar garis, akan tetapi menyelesaikan poligon dengan klik dua kali di titik tempat Anda memulai tadi.

source: *4.3. Changing Objects*
id: *4.3. Cara Mengganti Objek*

source: Select the forest on the left side of the map. Be sure to click on the line around the forest, not one of the points on the line. Now hold your left mouse button down and drag your mouse. You should be able to move the forest to a new location on the map.
id: Pilih hutan yang berada di sebelah kiri peta. Pastikan Anda mengklik garis pada hutan tersebut bukan pada titiknya. Sekarang tahan tombol kiri mouse Anda dan geser. Anda dapat menggerakkan hutan ke lokasi yang baru pada peta.

source: Click on one of the points on the line around the forest. Hold your left mouse button down and drag your mouse. You should be able to move the point. This is how you can change the shape of an object, or move a point.
id: Klik salah satu pada titik di hutan. Tahan tombol kiri mouse Anda dan geser. Anda dapat menggerakan titik. Dengan menggerakkan titik ini Anda dapat merubah bentuk dari sebuah objek.

source: *4.4. Add Presets*
id: *4.4. Cara Menambahkan Preset*

source: Now we know how to draw points, lines and shapes, but we still haven’t defined what they represent. We want to be able to say that our points are shops, schools, or something else, and whether our shapes are fields, buildings, or something else.
id: Sekarang Anda mengetahui bagaimana menggambar titik, garis dan poligon, akan tetapi kita masih belum menentukan objek tersebut adalah apa. Kita ingin supaya objek yang kita gambar seperti titik itu adalah sekolah, toko, dll dan apakah bentuk yang kita buat itu bangunan atau sesuatu yang lain.

source: Click on the :guilabel:`Select` tool, in the column of buttons on the left.
id: Klik pada tool :guilabel:`Pilih`, di kolom sebelah kiri.

source: Select one of the objects that you drew with the :guilabel:`Draw tool`. On the top menu, click :menuselection:`Presets`. Move your mouse through the sub-menu to the type of location you would like to define.
id: Pilih salah satu objek yang akan Anda gambar dengan :guilabel:`Alat Gambar`. Pada menu di atas klik :menuselection:`Presets`. Gerakkan mouse Anda ke sub-menu ke lokasi yang Anda ingin tentukan.

source: When you click on a preset, a form will pop up asking you for more information. You do not have to fill in every field, but you may wish to add some of the important fields, such as the name of the object.
id: Ketika Anda klik pada preset, akan muncul kolom-kolom dan menanyakan tentang informasi lebih lanjut tentang objek tersebut. Anda tidak harus mengisi semua kolom tetapi Anda harus mengisi kolom penting seperti nama dari objek yang Anda buat.
