Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/beginner/osm/103-working-with-josm.po
Languages: id

source: When you are finished entering the information, click :guilabel:`Apply Preset` . If everything went well, your point, line, or shape should change colors or show a symbol. This is because you have defined what it is.
id: Ketika Anda sudah selesai memasukkan informasi, klik :guilabel:`Tambahkan Preset`. Jika semuanya berjalan dengan lancar, titik, garis, atau poligon yang Anda buat akan berubah warna atau memiliki suatu simbol. Ini tergantung dari informasi yang Anda masukkan ke dalam objek tersebut.

source: **Exercise:**
id: **Latihan:**

source: Now let’s draw a map in order to practice the techniques you have learned. You may wish to redraw the map that you drew on paper in Module 1.
id: Sekarang Anda akan membuat peta Anda sendiri untuk meningkatkan teknik-teknik yang telah kita pelajari. Anda bisa saja menggambar peta yang telah Anda buat di kertas ketika mempelajari Modul 1.

source: Drag the map away from the sample map. Hold the right mouse button and drag your mouse, until you have a nice empty area to draw on.
id: Tahan dan geser jendela dari peta contoh. Tahan tombol kanan dan geser mouse Anda hingga Anda mendapatkan area kosong untuk Anda menggambar.

source: Use the Draw tool to create points, lines, and shapes. Describe what your objects are by selecting from the Presets menu.
id: Gunakan alat menggambar untuk membuat titik, garis dan poligon. Jelaskan objek apa yang Anda buat dengan memilih dari menu preset.

source: When you are finished, you should have your own map, similar to the sample map that we opened in sample.osm.
id: Ketika Anda sudah selesai, Anda akan memiliki peta sendiri, yang sama dengan contoh yang ada pada file sample.osm.
