Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/beginner/osm/104-using-gps.po
Languages: id

source: *8.2. Install GPS Drivers*
id: *8.2. Menginstal Driver GPS*

source: You may need to install GPS drivers on your computer. Open your training folder and find software/USBDrivers_23.exe. Double-click it and install.
id: Anda mungkin perlu untuk melakukan instalasi driver GPS pada komputer Anda. Jika Anda mempunyai salinan dari **software/USBDrivers_23.exe** pada komputer Anda, klik dua kali pada file tersebut dan install.

source: If you don’t have this file, you can download it. Open your internet browser and go to: `http://www8.garmin.com/support/download_details .jsp?id=591 <http://www8.garmin.com/support/download_details.jsp?id=591>`_
id: Jika Anda tidak mempunyai file ini, Anda dapat mendownloadnya. Buka browser internet Anda dan pergi ke: `http://www8.garmin.com/support/download_details .jsp?id=591 <http://www8.garmin.com/support/download_details.jsp?id=591>`_

source: Click :guilabel:`Download` to get the installation file. Locate it on your computer, and :kbd:`double-click` to install.
id: Klik :guilabel:`Download` untuk mendapatkan file instalasi. Cari pada komputer Anda, dan :kbd:`klik-ganda` untuk menginstall.

source: *8.3. Get the GPSBabel Setup Program*
id: *8.3. Memperoleh Setup Program GPSBabel*

source: GPSBabel is a program that allows us to copy data from the GPS. It is saved as *GPSBabel-1.4.2-Setup* in the software/ folder.
id: GPSBabel adalah program yang dapat kita manfaatkan untuk menyalin data dari GPS. Installer dari program ini disimpan sebagai *GPSBabel-1.4.2-Setup* pada folder **software/**

source: If you don’t have GPSbabel already, open your web browser and go to `www.gpsbabel.org <http://www.gpsbabel.org>`_
id: Jika Anda belum mempunyai GPSBabel, buka browser internet Anda dan pergi ke `www.gpsbabel.org <http://www.gpsbabel.org>`_

source: Click :guilabel:`Downloads` at the top of the page.
id: Klik :guilabel:`Downloads` pada bagian atas halaman.

source: Scroll down the page. If your computer uses Windows, you want to download the installation file for Windows. Click *GPSBabel-1.4.2-Setup.exe*. The file will be downloaded to your computer.
id: Gulir ke bawah halaman. Jika komputer Anda menggunakan Windows, Anda akan mendownload file instalasi utuk Windows. Klik *“GPSBabel-1.4.2-Setup.exe”*. File akan didownload ke dalam komputer Anda.

source: *8.4. Install GPSBabel*
id: *8.4. Melakukan Instalasi GPSBabel*

source: Locate the GPSBabel setup file on your computer. :kbd:`Double-click` it to install.
id: Cari file setup GPSBabel pada komputer Anda. :kbd:`Klik-ganda` untuk menginstall.

source: Click :guilabel:`Next`.
id: Klik :guilabel:`Next`.

source: Click :guilabel:`I accept` and :guilabel:`Next`.
id: Klik :guilabel:`I accept` dan :guilabel:`Next`.

source: Continue clicking :guilabel:`Next` until the program installs.
id: Lalu terus klik :guilabel:`Next` hingga program mulai menginstall.

source: When the program has finished installing, click :guilabel:`Finish` to start GPSBabel.
id: Ketika program telah selesai di-install, klik :guilabel:`Finish` untuk memulai GPSBabel.

source: *8.5. Copy Tracks and Waypoints*
id: *8.5. Menyalin Trek dan Waypoint*

source: Click in the circle next to the word :guilabel:`Device` at the top of the window.
id: Klik pada lingkaran dengan kata :guilabel:`Device` di sampingnya pada bagian atas jendela.

source: In the dropdown menu labelled :guilabel:`Format`, select :guilabel:`Garmin serial/USB protocol`
id: Pada menu daftar pilihan yang berlabel :guilabel:`Format`, pilih :guilabel:`Garmin serial/USB protocol`

source: Go down to the middle of the window, under Output. In the dropdown menu labelled :guilabel:`Format`, select :guilabel:`GPX XML`:
id: Pergi ke bawah pada pertengahan jendela, di bawah Output. Pada menu daftar pilihan yang berlabel :guilabel:`Format`, pilih :guilabel:`GPX XML`:

source: Click :guilabel:`File Name` and type a name for your saved file. It should be something that describes the data, such as the date and the location. For example: *jakarta-07-07-2011*.
id: Klik :guilabel:`File Name` dan ketik sebuah nama untuk menyimpan file Anda. Nama tersebut sebaiknya dapat mendeskripsikan tentang data GPS, misalnya tanggal dan lokasi. Contoh: *jakarta-07-07-2011*.

source: Make sure your GPS is connected to the computer and turned on.
id: Pastikan GPS Anda terhubung dengan komputer dalam keadaan menyala.

source: Click :guilabel:`Apply` in the bottom right corner of the window.
id: Klik :guilabel:`Apply` pada bagian pojok kanan bawah jendela.

source: If all goes well you should see a bar move across the screen, indicating that the data is being retrieved from the GPS. When it is finished, your points and track will be saved in the file that you selected.
id: Jika semua berjalan dengan lancar seharusnya Anda akan melihat sebuah bar yang bergerak pada layar, menandakan bahwa data sedang diterima dari GPS. Ketika sudah selesai, titik dan track Anda akan disimpan ke dalam file yang Anda pilih.

source: *8.6. Open in JOSM*
id: *8.6. Membuka Waypoint dan Track di JOSM*

source: Now open JOSM. On the top menu, click :menuselection:`File > Open...`
id: Sekarang buka JOSM. Pada menu bagian atas, klik :menuselection:`File > Open...`

source: Find and select the file that you created with GPSBabel. Click :guilabel:`Open`.
id: Cari dan pilih file yang telah Anda buat dengan GPSBabel. Klik :guilabel:`Open`

source: You should now see your points and tracks loaded into JOSM.
id: Anda seharusnya dapat melihat titik dan track Anda termuat pada JOSM.

source: **9. Upload GPS data in JOSM**
id: **9. Cara Mengupload Track GPS di JOSM**

source: Adding GPS tracks and waypoints to the OSM server is very useful for many reasons / goals. (If you don’t want your GPX data is seen by others, you don’t need to read this section. You just show your GPX Data on JOSM locally on your computer). First of all, it should be understood that the tracks GPS is the most helpful way to collecting data and georeference (provides geographic/spatial references) objects in the OSM. Upload GPX tracks to the server allows you to share more information. Other people who don’t have access, who can’t reach the location or because of the limitations of GPS, they can still obtain information of data without the need to stay / settle on that location and do not need to rent a GPS.
id: Menambahkan track GPS dan *waypoint* ke server OSM sangat berguna untuk banyak alasan/tujuan. (Jika Anda tidak ingin data GPX Anda terlihat oleh orang lain, Anda tidak perlu membaca bagian ini. Anda cukup menampilkan data GPX Anda pada JOSM secara lokal pada komputer Anda). Pertama-tama, perlu dipahami bahwa track GPS merupakan cara yang paling bermanfaat untuk pengumpulan dan *georeference* (memberikan referensi geografis/spasial) objek pada OSM. Meng-upload track GPX ke server memungkinkan Anda untuk lebih banyak berbagi informasi. Orang lain yang tidak memiliki akses, tidak dapat menjangkau lokasi ataupun karena keterbatasan GPS, mereka tetap dapat memperoleh informasi data tanpa perlu tinggal/menetap pada lokasi tersebut serta tidak perlu menyewa GPS.

source: The easiest way to upload GPS tracks is to download the plugin :guilabel:`DirectUpload`:
id: Cara termudah untuk melakukan upload track GPS adalah dengan mendownload plugin :guilabel:`DirectUpload`:

source: Open JOSM and Click :menuselection:`Edit > Preference > Plugin` box.
id: Buka JOSM dan klik :menuselection:`Edit > Preference > Plugin` box.

source: Type directupload on the :guilabel:`Search` box, give the check mark, then click :guilabel:`OK`.
id: Pada kotak :guilabel:`Cari` ketik DirectUpload dan beri tanda centang lalu klik :guilabel:`OK`.

source: Open your GPX file on JOSM.
id: Buka file GPX Anda pada JOSM.

source: Click :menuselection:`Tools > Upload Traces`
id: Klik menu :menuselection:`Tools > Upload Traces`

source: Describe your GPX file, write multiple tags, and visibility. On visibility option, you can chose “private”, “public”, “trackable”, or “identifiable”:
id: Deskripsikan file GPX Anda, tulis beberapa tag, dan tingkat penglihatan. Tingkat penglihatan dapat Anda isi dengan “private”, “umum”, “trackable”, atau “identifiable”.

source: Private: tracks will not appear on the public track list. Trackpoints are accessible at different times through the GPS APIs public without time stamp.
id: **Private:** track tidak akan terlihat pada daftar track publik. Trackpoints dapat diakses pada urutan waktu melalui API GPS publik tanpa cap waktu.

source: Public: your tracks will be visible to the public (general) on your GPS tracks and GPS tracks on the public list. Other users can still download your tracks from the public track list and their time making a point contained in it. However, the data does not appear in the API reference on the page of your tracks.
id: **Umum:** track Anda akan terlihat untuk publik (umum) pada track GPS Anda dan pada daftar track GPS publik. Pengguna lain masih dapat men-download track Anda dari daftar track publik beserta waktu pengambilan titik yang termuat di dalamnya. Namun, data yang tampil pada API tidak mereferensikan pada halaman track Anda.

source: Trackable: tracks will not appear on the track list public, but trackpoints will remain accessible via the public API and its GPS time taking its points. Other users can still download trackpoints but it will not be referenced with you.
id: **Trackable:** track tidak akan terlihat pada daftar track publik, namun trackpoints akan tetap dapat diakses melalui API GPS publik beserta waktu pengambilan titiknya. Pengguna yang lain tetap dapat mendownload trackpoints tapi tidak akan direferensi/dikaitkankan dengan Anda.

source: Identifiable: Your tracks will be visible to the public (general) on your GPS tracks and public GPS tracks list. Other users can download your tracks and connect with your username. Making time points on the track can also be accessed through the public API GPS.
id: **Identifiable:** track Anda akan terlihat untuk publik (umum) pada track GPS dan pada daftar track GPS publik. Pengguna lain dapat men-download track Anda dan menghubungkannya dengan username Anda. Waktu pengambilan titik-titik pada track juga dapat diakses melalui GPS API publik.

source: Click :guilabel:`Upload Trace`. If requested to enter a username and password, you can enter the username and password of the account OpenStreetMap and check the :guilabel:`save user and password` then click :guilabel:`Authenticate`.
id: Klik :guilabel:`Upload Jejak`. Apabila diminta untuk memasukkan username dan kata sandi, Anda dapat memasukkan nama pengguna dan kata sandi dari akun OpenStreetMap dan centang :guilabel:`simpan user dan password` kemudian klik :guilabel:`Membuktikan`.

source: **10. Edit GPS Data using JOSM**
id: **10. Cara Melakukan editing berdasarkan data GPS yang diperoleh menggunakan JOSM**

source: After you successfully open and upload the GPS data, you must enter the GPS data as the field result into OSM server. The following way:
id: Setelah Anda berhasil membuka dan mengupload data GPS, Anda harus memasukkan data GPS hasil lapang tersebut ke dalam server OSM. Cara yang dapat dilakukan, yaitu :

source: Open a file gpx results of your field data back using JOSM.
id: Bukalah file gpx hasil data lapang Anda kembali dengan menggunakan JOSM.

source: Click :menuselection:`File > Download from OSM`, You don’t have to re-draw
id: Klik :menuselection:`Berkas > Download dari OSM`, Anda tidak harus menggambar ulang

source: the box to download because JOSM been reading your region according to the GPS layer automatically. Click :guilabel:`Download`.
id: kotak untuk mendownload karena secara otomatis JOSM telah membaca wilayah Anda sesuai dengan layer GPS. Klik :guilabel:`Download`.

source: After downloading the data successfully and appears in JOSM layer, you can edit the OSM Data (Data Layer) is based on the GPS field data. To make it easier to add data, you can add Bing Satellite imagery. You can draw an uncharted street (a line) with the following results of the existing record GPS tracks.
id: Setelah download data berhasil dan muncul dalam layer JOSM, Anda dapat mengedit data OSM (Data Layer) tersebut berdasarkan hasil GPS data lapang. Untuk memudahkan dalam menambahkan data, Anda dapat memunculkan citra satelit Bing. Anda dapat menggambar sebuah jalan yang belum dipetakan (berupa garis) dengan mengikuti hasil rekaman track GPS yang ada.

source: After you have finished editing OSM data, don’t forget to upload the data to the OSM, click :menuselection:`File > Upload Data`.
id: Setelah Anda selesai mengedit data OSM, jangan lupa untuk mengupload data OSM dengan klik :menuselection:`Berkas > Upload Data`.
