Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/beginner/osm/104-using-gps.po
Languages: id

source: Module 4: Using GPS
id: Modul 4: Penggunaan GPS

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Understanding what is GPS and types of GPS
id: Memahami pengertian GPS dan berbagai jenis GPS

source: Turn on GPS
id: Dapat menyalakan GPS

source: Setting GPS
id: Melakukan pengaturan GPS

source: Understanding the factor that affected GPS accuracy
id: Memahami berbagai faktor yang mempengaruhi ketelitian GPS

source: Understanding about track and waypoints
id: Memahami pengertian track/jalur dan Waypoints/titik

source: Collect data using GPS
id: Mengumpulkan data menggunakan GPS

source: Copy GPS data (track dan waypoint) to computer
id: Menyalin data GPS (track dan waypoint) ke komputer

source: Open waypoint and track on JOSM
id: Membuka waypoint dan track di JOSM

source: Upload GPS track in JOSM
id: Mengupload track GPS di JOSM

source: Editing based on GPS data on JOSM
id: Melakukan editing berdasarkan data GPS yang diperoleh menggunakan JOSM

source: **1. What is GPS?**
id: **1. Apakah yang dimaksud dengan GPS?**

source: A GPS is like a mobile phone, except that instead of receiving radio signals from telephone companies, it receives signals from satellites that are going around the Earth. By receiving these signals from the satellites, a GPS is able to calculate your exact location on the planet. It records this location in coordinates, which are two long numbers. One number tells you how far East or West you are - this is called **longitude**. The second number tells you how far North or South you are - this is called **latitude**. Every place on Earth has unique geographic coordinates.
id: Sebuah GPS bekerja seperti ponsel, namun jika ponsel menerima sinyal radio dari perusahaan telepon, GPS menerima sinyal dari satelit yang mengelilingi bumi. Dengan menerima sinyal tersebut dari satelit, sebuah GPS dapat memperhitungkan dengan tepat posisi Anda di permukaan bumi. GPS merekam lokasi ini dalam bentuk **koordinat**, dimana terdapat dua buah nomor yang panjang. Satu nomor menunjukan sejauh mana posisi Anda dari Timur atau Barat – biasa disebut posisi **bujur**. Nomor yang kedua menunjukan sejauh mana posisi Anda dari Utara atau Selatan – biasa disebut garis **lintang**. Setiap tempat di bumi memliki koordinat geografis yang unik.

source: For example: -8.639298 Latitude, 116.311607 Longitude is a location in Lombok, Indonesia.
id: Sebagai contoh: -8.639298 Lintang, 116.311607 Bujur: merupakan sebuah lokasi di Lombok, Indonesia.

source: *Google Earth software, showing coordinates of a place in Lombok, Indonesia.*
id: *Perangkat lunak Google Earth, menunjukan koordinat dari sebuah tempat di Lombok, Indoonesia.*

source: **2. Turn on the GPS**
id: **2. Menyalakan GPS**

source: Before you turn on your GPS, go outside where you have a clear view of the sky. Because the GPS determines your location by receiving signals from satellites, **it won’t work indoors**.
id: Sebelum Anda menyalakan GPS, pergilah keluar dimana Anda dapat melihat langit dengan jelas. Karena GPS menentukan lokasi Anda dengan menerima sinyal dari satelit, **GPS tidak akan bekerja di dalam ruangan**.

source: On the right side of your GPS, press and hold the :guilabel:`Power` button. The GPS will start, and it will show you the Satellites page. You should see something like the image below. Your GPS is looking for satellite signals. When it has connected to three or more satellites, it will have your location.
id: Pada bagian bawah sisi kanan GPS Anda, tekan dan tahan tombol :guilabel:`Power`. GPS akan menyala, dan akan menunjukkan halaman Satelit. Anda seharusnya dapat melihat sesuatu seperti pada gambar di bawah ini. GPS Anda sedang mencari sinyal satelit. Ketika sudah terhubung dengan tiga satelit atau lebih, GPS akan mendapatkan lokasi Anda.

source: Once your location is determined, the :guilabel:`Satellite` screen will disappear and you will see the :guilabel:`Main Menu`.
id: Setelah lokasi Anda telah ditentukan, layar :guilabel:`Satelit` akan menghilang dan Anda akan melihat :guilabel:`menu utama`.

source: **3. GPS Setting**
id: **3. Melakukan pengaturan GPS saat pertama kali digunakan**

source: *3.1. GPS mode settings*
id: *3.1. Pengaturan mode GPS*

source: Access the :guilabel:`Setup` menu on the :guilabel:`Main Menu` by using the :guilabel:`Page` button. Then go to the :guilabel:`System`.
id: Akses :guilabel:`Setup Menu` pada :guilabel:`Main Menu` dengan menggunakan tombol :guilabel:`Page`. Kemudian masuk ke :guilabel:`System`.

source: In the :guilabel:`System` menu you can find some of the settings are as follows:
id: Di dalam menu :guilabel:`System` Anda dapat menemukan beberapa pengaturan yaitu sebagai berikut:

source: GPS: regulate how the GPS sensor work. Choose the :menuselection:`Normal` option. The device captures only the signals from the GPS satellites. But your position accuracy sometimes less accurate (about 10-30 meters).
id: **GPS:** mengatur bagaimana sensor GPS bekerja. Pilih pilihan :menuselection:`Normal`. Pilihan ini baik untuk menghemat baterai Anda. Perangkat hanya menangkap sinyal dari satelit GPS. Namun akurasi posisi Anda terkadang kurang akurat (berkisar 10-30 meter)

source: WAAS/EGNOS: WAAS stands for Wide Area Augmentation System, while EGNOS stands for Euro Geostationary Navigation Overlay Service. There are generally provided by the GPS accuracy is 15 meters. WAAS / EGNOS is a system satellites and ground stations that provide GPS signal corrections, giving you a better position accuracy (to less than 3 meters). You should choose the mode WAAS / EGNOS by selecting :menuselection:`Enabled` to get better accuracy, but with the consequence you have to prepare a backup battery.
id: **WAAS/EGNOS:** WAAS merupakan kepanjangan dari *Wide Area Augmentation System*, sedangkan EGNOS merupakan kepanjangan *Euro Geostationary Navigation Overlay Service*. Pada umumnya, akurasi yang diberikan oleh GPS adalah 15 meter. WAAS/EGNOS merupakan sistem satelit dan stasiun bumi yang memberikan koreksi sinyal GPS, sehingga memberikan Anda akurasi posisi yang lebih baik (hingga kurang dari 3 meter). **Sebaiknya Anda memilih mode WAAS/EGNOS** dengan memilih :menuselection:`Enabled` untuk mendapatkan akurasi yang lebih baik, namun dengan konsekuensi Anda harus mempersiapkan baterai cadangan.

source: Battery Type: To optimize power usage, should be adapted to the type of battery you use (default: Alkaline).
id: **Battery Type:** Untuk optimalisasi penggunaan daya, sebaiknya disesuaikan dengan jenis baterai yang Anda gunakan (standarnya: Alkaline).

source: Text Language: You can choose language you want to use.
id: **Text Language:** Anda dapat memilih bahasa yang ingin Anda gunakan.

source: *3.2. Unit Settings*
id: *3.2. Pengaturan Satuan Unit*

source: Access the menu :menuselection:`Setup > Units`. In this menu, you can manage want to display units. For examples, in meter, feet, and other. You can also manage position format (decimal degree, decimal minutes degree, second minutes degree), datum (standard WGS 84) and projection (standard WGS 84).
id: Akses menu :menuselection:`Setup > Units`. Pada menu ini Anda dapat mengatur satuan unit yang ingin ditampilkan. Misalnya dalam meter, feet, dan lainnya. Selain itu Anda juga dapat mengatur format posisi (derajat desimal, derajat menit desimal, derajat menit detik), datum (standarnya WGS 84), dan proyeksi (standarnya WGS 84).

source: *3.3. Times Settings*
id: *3.3. Pengaturan Waktu*

source: Access the menu :menuselection:`Setup > Time`. You can manage time format (12 hours or 24 hours) and your time zone.
id: Akses menu :menuselection:`Setup > Time`. Anda dapat mengatur format waktu (12 jam atau 24 jam) dan juga zona waktu Anda.

source: *3.4. Page Settings*
id: *3.4. Pengaturan Halaman*

source: Access the menu :menuselection:`Setup > Page Sequences`. You remember about function Pages button ? You can manage pages function often your use, so you do not a lot of pressing a button to access the page function. You can press the Page button several times to page you want access the function . You can add page function with select :guilabel:`Add Page` then select function such as: :guilabel:`Tracks` (to see details of your trip), :guilabel:`Map` (to view maps), :guilabel:`Satellite` (to view the status satellite, position, and accuracy).
id: Akses menu :menuselection:`Setup > Page Sequences`. Masih ingat fungsi tombol **Pages**? Anda dapat mengatur halaman-halaman fungsi yang sering Anda gunakan, sehingga Anda tidak perlu banyak menekan tombol untuk mengakses halaman fungsi tersebut. Anda tinggal menekan tombol **Page** beberapa kali untuk menuju halaman fungsi yang ingin Anda akses. Anda dapat menambah halaman fungsi dengan memilih :guilabel:`Add Page` kemudian pilihlah fungsi seperti: :guilabel:`Tracks` (untuk melihat rincian perjalanan Anda), :guilabel:`Map` (untuk menampilkan peta), :guilabel:`Satellite` (untuk melihat status satelit, posisi, dan akurasi).

source: *3.5. Tracks*
id: *3.5. Pengaturan Track*

source: Access Tracks menu. Do you remember the track function? Tracks can record your track ride, it is very useful for mapping the road. In the menu there are a few settings such as:
id: Akses menu **Tracks**. Masih ingat fungsi track? Track dapat merekam jejak perjalanan Anda, sangat berguna untuk pemetaan jalan. Di dalam menu ini terdapat beberapa pengaturan seperti:

source: “On” - track record, track trail will be visible on the map. Make sure the setting is selected before you start mapping.
id: **“On”** - merekam track, jejak track akan terlihat pada peta. Pastikan pengaturan ini dipilih sebelum Anda mulai melakukan pemetaan.

source: “Off” - stop recording the track, should you choose this setting every time you finish mapping.
id: **“Off”** - berhenti merekam track, sebaiknya Anda pilih pengaturan ini setiap kali Anda selesai melakukan pemetaan.

source: Then, still in the :menuselection:`Track menu`, select :guilabel:`Setup`.
id: Kemudian, masih di dalam menu :menuselection:`Track`, pilih :guilabel:`Setup`.

source: “Wrap When Full”: Put a check in this option. GPS device can save automatic your track, after out of memory.
id: **“Wrap When Full”**: Beri tanda centang pada pilihan ini. Perangkat GPS akan otomatis menyimpan track Anda setelah kehabisan memori ruang penyimpanan.

source: Record Method:
id: Metode Perekaman:

source: “Distance” – track recording every certain distance range
id: **“Distance”** – perekaman track dilakukan setiap rentang jarak tertentu

source: “Time” – track recording every time range
id: **“Time”** – perekaman track dilakukan setiap rentang waktu tertentu

source: “Auto” – track recording automatic (should be choose this setting)
id: **“Auto”** – perekaman track dilakukan otomatis (sebaiknya pilih pengaturan ini)

source: This setting decide how often the GPS will record your track ride. Often you record your track make produce a line of track is smooth and tidy but will drain the battery faster. If least often, recording infrequently, the line produced track will appear broken.
id: Pengaturan ini menentukan seberapa sering GPS akan merekam jejak perjalanan Anda. Semakin sering atau "most often" akan menghasilkan garis track yang halus dan lebih teratur tetapi akan menghabiskan baterai lebih cepat, jika di atur jarang atau "least often", perekaman dilakukan secara jarang, garis track yang dihasilkan akan terlihat patah.

source: “Most often” – track recording at any time as often as possible
id: **“Most often”** – perekaman track dilakukan setiap saat sesering mungkin

source: “More often” – track recording done as often as possible
id: **“More often”** – perekaman track dilakukan sesering mungkin

source: “Normal” – track recording at normal
id: **“Normal”** – perekaman track dilakukan secara normal

source: “Less often” – track recording not at any time (below normally)
id: **“Less often”** – perekaman track dilakukan tidak setiap saat (di bawah normal)

source: “Least often” – track recording infrequently
id: **“Least often”** – perekaman dilakukan secara jarang

source: Color: You can change display line color on track maps.
id: **Color:** Anda dapat mengubah tampilan warna garis track pada peta.

source: **4. Navigate the GPS**
id: **4. Menavigasikan GPS**

source: The GPS has different screens and menus that allow you to do different things. To switch between screens, press the button marked :kbd:`X`, just above the power button on the right side of the device. This button also serves to go back. If you press something by mistake and would like to cancel or go back, press the :kbd:`X` button.
id: GPS memiliki layar yang berbeda dan menu yang dapat membuat Anda melakukan hal yang berbeda. Untuk memindahkan tampilan dari layar ke layar, tekan tombol yang bertanda :kbd:`X`, tepat berada di atas tombol Power pada sisi kanan perangkat. Tombol ini juga berfungsi untuk kembali. Jika Anda menekan sesuatu karena kesalahan dan Anda menginginkan untuk membatalkan atau kembali ke menu sebelumnya, tekan tombol :kbd:`X`.

source: By pressing the :kbd:`X` button, you should be able to flip through different screens that will look something like this:
id: Dengan menekan tombol :kbd:`X`, Anda seharusnya dapat mengganti tampilan dari layar ke layar yang berbeda seperti ini:

source: If you return to the :guilabel:`Satellites` page, you can see that you are connected to three or more satellites. In the upper left corner are your coordinates, your latitude and longitude.
id: Jika Anda kembali ke halaman :guilabel:`Satelit`, maka Anda akan dapat melihat bahwa Anda terhubung dengan tiga satelit atau lebih. Pada pojok kiri atas merupakan koordinat Anda, lintang dan bujur.

source: Flip to the Map page, and you can see a map of where you are. If you have added OSM maps to your GPS, you may see roads and places. Otherwise, the map may look quite blank. Zoom in and out by pressing the up and down arrow buttons on the left side of the GPS.
id: Ubah ke halaman Peta, dan Anda dapat melihat sebuah peta dimana Anda berada. Jika Anda telah menambahkan peta OSM pada GPS Anda, Anda dapat melihat jalan dan tempat. Selain itu, peta mungkin akan terlihat kosong. Perbesar dan perkecil dengan menekan tombol atas dan bawah pada sisi kiri GPS.

source: **5. Tracks and Waypoints**
id: **5. Track dan Waypoint**

source: Your GPS records two kinds of information that are useful for creating maps or saving the coordinates of a place. First, it allows you to save your location in the memory of the GPS. When you save a location, the coordinates will be saved with a name. For example, your first saved point will be named 001, the second 002, and so on. When you save a point, you can write down the number on a piece of paper, along with a note about what it is, any any attribute or indicators you would like to know. Saved locations on your GPS are called waypoints.
id: GPS Anda merekam dua jenis informasi yang berguna untuk membuat peta atau menyimpan koordinat dari sebuah tempat. Pertama, GPS dapat menyimpan lokasi Anda pada memori GPS. Ketika Anda menyimpan satu lokasi, koordinat akan disimpan dengan sebuah nama. Sebagai contoh, titik pertama yang tersimpan oleh Anda akan diberi nama 001, kedua 002, dan seterusnya. Ketika Anda menyimpan sebuah titik, Anda dapat menulis nomor tersebut pada selembar kertas, dengan sebuah catatan tentang titik apakah itu, atribut atau indikator apapun yang Anda ingin ketahui. Lokasi yang tersimpan ke dalam GPS Anda disebut *waypoints*.

source: Second, your GPS can save what are called tracks. While a waypoint only saves a single location, a track will save a series of locations wherever you move. For example, the track will record your location every one second, or every one meter, and the result will be a series of dots that show the path of where you have been. Tracks are useful for mapping objects that are represented by lines or shapes, such as the course of a road, or the shape of a field.
id: Kedua, GPS Anda dapat menyimpan apa yang disebut dengan "track". Ketika sebuah *waypoint* hanya menyimpan sebuah lokasi, sebuah track akan menyimpan sebuah seri lokasi kemanapun Anda bergerak. Sebagai contoh, track akan merekam lokasi Anda setiap satu detik, atau setiap satu meter, dan hasilnya akan berupa sebuah seri dari titik-titik yang menunjukan jalur lokasi dimana Anda pernah berada. Track sangat berguna untuk memetakan objek yang ditunjukan oleh garis atau bentuk, seperti sebuah jalan, atau bentuk dari sebuah lapangan.

source: A GPS can record a single point as well as a path of where you travel. Here the points are numbered in the order they are recorded. The path or “track” is shown in green line and the “waypoint” is shown in red.
id: Sebuah GPS selain dapat merekam satu titik juga dapat merekam sebuah jalur kemanapun Anda bepergian. Ini adalah titik yang diberi nomor berurutan sebagaimana mereka terekam. Jalur atau "track" ditunjukkan dengan garis berwarna hijau, sedangkan "waypoint" atau titik ditunjukkan dengan warna merah.

source: **6. Save Your Location**
id: **6. Menyimpan Lokasi Anda**

source: To save your current location as a waypoint, click the :kbd:`X` button until your reach the Main Menu. Using the joystick, move it so that :guilabel:`Mark` is highlighted on the screen. Push the joystick button down to open the :guilabel:`Save Waypoint` page.
id: Untuk menyimpan lokasi Anda sebagai sebuah waypoint, klik tombol :kbd:`X` hingga mencapai menu utama. Dengan menggunakan joystick, gerakan joystick hingga bagian :guilabel:`Mark` tersorot pada layar. Tekan tombol joystick ke bawah untuk membuka halaman :guilabel:`Save Waypoint`.

source: You can see on this page some information about the waypoint that you are saving. First is the name. If this is your first waypoint, it probably reads “001”. This is the number you should record on paper along with the information you want to collect with this object. Next you will see the time and date when the point is recorded. Below that are the coordinates, followed by the altitude.
id: Anda dapat melihat beberapa informasi tentang *waypoint* atau titik yang Anda simpan di halaman ini. Pertama adalah namanya. Jika ini titik pertama Anda, Anda akan membaca “001”. Ini merupakan nomor yang harus Anda catat di kertas bersamaan dengan informasi yang Anda ingin kumpulkan pada obyek ini. Selanjutnya Anda akan melihat jam dan tanggal ketika titik tersebut direkam. Di bawahnya terdapat koordinat, diikuti dengan ketinggian.

source: Use the joystick to move to the :guilabel:`OK` button at the bottom of the screen. Press the joystick button down to save this point. Be sure to write down the number of the point, along with what the place is and any other information you want to record about the place in your notebook.
id: Gunakan joystick untuk bergerak ke tombol :guilabel:`OK` pada bagian bawah layar. Tekan tombol joystick ke bawah untuk menyimpan titik ini. Yakinkan untuk menulis nomor titik, beserta keterangan tempat apakah itu dan berbagai informasi lainnya yang Anda ingin ketahui di dalam buku catatan Anda.

source: Press the :kbd:`X` button to go to the map page. You should now see your point on the map.
id: Tekan tombol :kbd:`X` untuk menuju halaman peta. Anda seharusnya akan melihat titik pada peta.

source: **7. Turn on the Track Log**
id: **7. Menyalakan Track Log**

source: Now that we have learned how to save points, let’s learn how to turn the track log on and off. When the track log is turned on, it will automatically record your path. It’s good practice to turn on the log when you begin mapping, and turn it off when you are finished. You will then be able to look at the track on a computer and see the path that you mapped. If you would like to map the course of a road, it is a good idea to save a waypoint at the beginning and end of the road, writing in your notebook the name and type of the road, and any other important information about the road.
id: Sekarang kita telah mempelajari bagaimana caranya untuk menyimpan titik, sekarang mari mempelajari bagaimana untuk menyalakan/mematikan *track log*. Ketika *track log* dinyalakan, secara otomatis GPS akan merekam jalur Anda. Pada saat mulai memetakan, sebaiknya *track log* dinyalakan, dan dimatikan pada saat Anda telah selesai. Anda akan dapat melihat trek pada sebuah komputer dan melihat jalur yang telah Anda petakan. Jika Anda ingin memetakan jalur pada jalan raya, menyimpan sebuah *waypoint* pada awal dan akhir jalan, menuliskan nama dan tipe jalan, serta informasi penting lainnya tentang jalan tersebut pada buku catatan.

source: To turn on the track log, click the :kbd:`X` button until your reach the page that says Track Log.
id: Untuk menyalakan *track log*, klik pada tombol :kbd:`X` hingga Anda mencapai halaman yang bernama *Track Log*.

source: If you would like to empty the track log to delete earlier recordings, use the joystick to select :guilabel:`Clear`, and press the joystick down. The bar at the top should read “0%”.
id: Jika Anda ingin mengosongkan *track log* untuk menghapus perekaman sebelumnya, gunakan joystick untuk memilih :guilabel:`Clear`, tekan joystick ke bawah. Pada bar yang terdapat di atas seharusnya terbaca “0%”

source: To turn on the log, move the joystick to highlight “On”, and press the joystick down. The track log is now recording your path.
id: Untuk menyalakan *track log*, gerakan joystick untuk menyorot “On”, kemudian tekan joystick ke bawah. *Track log* sekarang merekam jalur Anda.

source: Under the :guilabel:`Set up` option, you also can set time or distance intervals to track. Time intervals instruct your GPS to record your location at given intervals. If you have a memory card in your GPS, it is good practice to set this to 1 second, meaning that every second your location will be added to the track log. This may be useful when detailed surveys are needed.
id: Dibawah pilihan :guilabel:`Set up`, Anda juga dapat mengatur interval waktu atau jarak untuk trek. Interval waktu memerintahkan GPS Anda untuk merekam lokasi Anda setiap beberapa menit atau detik sesuai dengan pengaturan interval waktunya atau jika Anda memiliki kartu memori di GPS Anda, sebaiknya pilih pengaturan 1 second, artinya setiap detik lokasi Anda akan ditambahkan pada *track log*. Hal ini akan berguna jika sedang melakukan survey yang sangat detail.

source: Press the :kbd:`X` button to go to the map page. As you move you will see your track shown as a series of dots.
id: Tekan tombol :kbd:`X` untuk menuju halaman peta. Selama Anda bergerak maka Anda akan melihat trek yang ditunjukan dengan titik-titik berseri.

source: **8. Copy Waypoints and Tracks to the Computer**
id: **8. Menyalin Waypoint dan Trek ke Komputer**

source: *8.1. Attach GPS to the Computer*
id: *8.1. Menghubungkan GPS ke Komputer*

source: When you are finished mapping with the GPS you will want to copy the points and tracks to your computer so that you can open them in JOSM. First, turn off the track log on your GPS, by going to the track page and selecting :guilabel:`Off`.
id: Ketika Anda telah selesai memetakan dengan GPS Anda menginginkan untuk menyalin titik dan trek ke dalam komputer agar Anda dapat membukanya di JOSM. Pertama, matikan *track log* GPS Anda, dengan menuju halaman trek dan memilih :guilabel:`Off`.

source: Attach the GPS to your computer with the cable. One end should plug into your computer’s USB port, and the other goes into the back of the GPS, beneath the rubber flap at the top. The GPS should be turned on to copy the points and tracks.
id: Sambungkan GPS pada komputer dengan kabel. Satu ujung kabel harusnya tersambung pada port USB komputer Anda, dan ujung lainnya tersambung dengan GPS, di belakang flap karet pada bagian atas belakang GPS. GPS harus dinyalakan untuk menyalin titik dan track.
