Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/beginner/osm/105-field-papers.po
Languages: id

source: Module 5: Field Papers
id: Modul 5: Field Papers

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: How to use Field Papers
id: Memahami cara kerja Field Papers

source: Make and print Field Papers
id: Membuat dan mencetak Field Papers

source: Add data to print using Field Papers
id: Menambahkan data untuk dicetak dengan menggunakan Field Papers

source: Scan and upload Field Papers to Field Papers website
id: Melakukan scan dan upload Field Papers ke situs Field Papers

source: Open Field Papers into JOSM
id: Membuka Field Papers ke dalam JOSM

source: In this module we will see how we can record the coordinates of places without a GPS. We will use a tool called Field Papers, which allows you to print a map of an area, draw on it and add notes, and load the paper back into JOSM, where you can add your locations to OpenStreetMap.
id: Pada modul ini, kita akan melihat bagaimana kita dapat merekam koordinat dari suatu tempat tanpa GPS. Kita akan menggunakan sebuah tool bernama Field Papers, yang mana memungkinkan kita untuk mencetak peta suatu wilayah, menggambar dan menambahkan catatan di atasnya, dan membuka kertas tersebut di dalam JOSM, dimana Anda dapat menambahkan lokasi Anda ke OpenStreetMap.

source: **1. Overview of Field Papers**
id: **1. Gambaran tentang Field Papers**

source: Before going into detail about Field Papers, let’s look at an overview of how the process works:
id: Sebelum mempelajari lebih jauh tentang Field Papers, mari melihat gambaran bagaimana Field Papers bekerja:

source: **Step 1:** Locate the area you want to map on the Field Papers website. Print out a map of this area. You can choose to print the current map of the area with OpenStreetMap, or you can choose to print aerial imagery, if it is available in your area.
id: **Langkah 1:** Carilah pada situs Field Papers wilayah yang ingin Anda lakukan pemetaan. Buatlah peta untuk wilayah tersebut. Anda dapat memilih untuk mencetak peta tersebut dengan latar belakang peta berupa peta OpenStreetMap ataupun citra satelit, jika citra satelit tersebut tersedia untuk wilayah Anda.

source: **Step 2:** Use your printed map to survey the area. Add more places by drawing them on the map. Draw lines for roads, shapes for buildings, and so forth. Write notes about each location directly on the map, or write numbers on the map that relate to numbers in your notebook, where you can write more detailed information about each object.
id: **Langkah 2:** Gunakan Field Papers yang telah tercetak tersebut untuk melakukan survei pada wilayah Anda. Tambahkan lebih banyak tempat/objek dengan menggambarnya di atas Field Papers. Gambarlah garis untuk jalan, bentuk untuk bangunan, dan seterusnya. Tulislah catatan secara langsung pada Field Papers tentang masing-masing objek yang Anda gambar, atau, Anda juga dapat memberi nomor untuk setiap objek pada Field Papers, kemudian Anda menggunakan nomor tersebut untuk menghubungan gambar dengan kode pada catatan. Anda dapat memberikan keterangan lebih rinci pada catatan tersebut.

source: **Step 3:** Scan your paper into the computer. If you do not have a scanner, you can take a photograph of the paper, if your camera is able to take high quality pictures. Upload the image to the Field Papers website (`http://fieldpapers.org/upload.php <http://fieldpapers.org/upload.php>`_ ).
id: **Langkah 3:** Scan Field Paper Anda. Jika Anda tidak memiliki scanner, Anda dapat mem-foto Field Papers Anda, jika kamera Anda dapat mengambil gambar dengan kualitas yang baik dan resolusi tinggi. Kemudian upload gambar hasil scan dari Field Papers tersebut ke situs Field Papers (`http://fieldpapers.org/upload.php <http://fieldpapers.org/upload.php>`_ ).

source: **Step 4:** In JOSM, load the Field Papers. Use the objects you drew as a reference to add them digitally into OpenStreetMap.
id: **Langkah 4:** Pada JOSM, tambahkan Field Papers Anda. Gunakan objek yang telah Anda gambar sebagai acuan untuk menambahkan objek-objek tersebut menjadi peta digital ke dalam OpenStreetMap.

source: **2. How does Field Papers work?**
id: **2. Bagaimana Field Papers Bekerja?**

source: If you follow the Field Papers process described above, you will be collecting accurate geographic coordinates of places with nothing more than paper. How is this possible?
id: Jika Anda mengikuti bagaimana cara kerja Field Papers sebagaimana dijelaskan di atas, Anda akan mengumpulkan koordinat dari suatu tempat/lokasi secara akurat hanya dengan menggunakan kertas. Bagaimama mungkin?

source: When you print a Field Papers, the paper comes with a square barcode on the bottom of the page. This bar code allows Field Papers to determine the exact location of the map that you are using to survey. Later, when you load the paper back into JOSM, all the objects that you drew will be in shown in their actual locations, or at least quite close, which is good enough for us.
id: Ketika Anda mencetak sebuah Field Papers, kertas tersebut tercetak dengan sebuah barcode berbentuk kotak pada bagian bawah halaman. Barcode ini memungkinkan Field Papers untuk menentukan lokasi pasti dari peta yang Anda gunakan untuk survei. Selanjutnya, ketika Anda menambahkan Field Papers ke dalam JOSM, semua objek yang telah Anda gambar akan nampak pada lokasi sebenarnya, atau paling tidak cukup dekat, yang mana cukup bagus untuk kita.

source: Now let’s learn how to create and use Field Papers.
id: Sekarang mari belajar bagaimana untuk membuat dan menggunakan Field Papers.

source: **3. Create and Print**
id: **3. Membuat dan Mencetak Field Papers**

source: Open your web browser - this may be Firefox, Chrome, Opera, or Internet Explorer.
id: Buka browser internet Anda - misalnya Firefox, Chrome, Opera, atau Internet Explorer.

source: In the address bar at the top of the window, enter the following text and press Enter: `http://fieldpapers.org/ <http://fieldpapers.org>`_
id: Pada isian alamat situs pada bagian atas halaman browser, tulislah alamat berikut kemudian tekan Enter:`http://fieldpapers.org/ <http://fieldpapers.org>`_

source: The website should look something like this:
id: Situs tersebut seharusnya nampak seperti ini :

source: Click on :guilabel:`Make yourself an Atlas`
id: Klik pada :guilabel:`Make yourself an Atlas`.

source: Enter a place where you would like to print out a map, and press :kbd:`Enter`. Here we will search for “jakarta.”
id: Ketiklah nama wilayah yang ingin Anda cetak peta nya, kemudian tekanlah Enter. Dalam contoh ini, kita akan mencari untuk wilayah “jakarta”.

source: Now you are presented with an interface where you can define the boundaries of your Field Papers. The map that you see shows the area that you would like to print on paper. You can print multiple pages, zoom in and out, and drag the papers to cover specific boundaries on the map.
id: Sekarang Anda akan mendapatkan tampilan yang meminta Anda untuk membatasi wilayah yang akan Anda cetak peta pada Field Papers. Peta yang Anda lihat menunjukkan wilayah yang akan Anda cetak petanya. Anda dapat mencetak peta wilayah dalam beberapa halaman, memperbesar dan memperkecil peta, dan menarik tepi-tepi kertas untuk memberikan batas wilayah yang akan dicetak pada Field Papers.

source: Click on the various buttons to see what each does. Note that in our example, we are presented with a two page set of Field Papers. To add or subtract a page, we can click on the :guilabel:`+` and :guilabel:`-` buttons on the map.
id: Klik pada berbagai tombol yang ada untuk melihat apa fungsi dari setiap tombol tersebut. Perhatikan bahwa pada contoh ini kami menampilkan Field Papers dengan dua halaman. Untuk menambahkan atau mengurangi sebuah halaman, kita dapat mengklik pada tombol :guilabel:`+` dan :guilabel:`-` pada peta.

source: We can expand or decrease the area of the papers by dragging the button in the lower right corner.
id: Kita dapat memperluas ataupun mengurangi luasan kertas dengan menarik tombol pada pojok kanan bawah.

source: You can move the paper by clicking and dragging the button in the upper left corner.
id: Anda dapat memindahkan kertas dengan mengklik dan menggeser tombol pada pojok kiri atas.

source: You can adjust the paper orientation and type of map using the controls at the top
id: Anda dapat menyesuaikan arah cetak kertas dan jenis peta yang akan menjadi latar belakang dengan menggunakan berbagai tombol pada sisi atas peta

source: When you’re finished, click :guilabel:`Next`
id: Ketika Anda telah selesai, klik :guilabel:`Next`

source: Next give your map a name, and if you want, you can add notes to be printed on the map, such as questions you want to remember to answer or specific places you want to identify. After you fill out the form, click :guilabel:`Next`
id: Selanjutnya berilah nama pada Field Papers yang Anda buat. Jika Anda menginginkan, Anda dapat menambahkan catatan untuk dicetak pada Field Papers, misalnya catatan tentang pertanyaan yang ingin Anda ingat untuk dijawab atau catatan tentang tempat-tempat yang ingin Anda identifikasi. Setelah Anda mengisi semua form, klik :guilabel:`Next`

source: Finally choose your layout. You can indicate whether you want pages only for your maps, or if you want notes on the same page. If you choose the notes option, then half of your page will be left for taking notes, and the other half will contain your map.
id: Terakhir, pilih layout Anda. Anda dapat memilih apakah Anda ingin Field Papers hanya berisi peta, ataukah ingin mencetak juga catatan yang ada pada lembar Field Papers tersebut. Jika Anda memilih untuk mencetak juga catatan yang ada, maka separuh dari halaman Anda akan digunakan untuk mencetak catatan tentang peta tersebut, dan separuh yang lainnya akan berisi peta Anda.

source: It may take a few minutes to prepare your Field Papers.
id: Proses persiapan Field Papers Anda mungkin akan memakan waktu beberapa menit.

source: When your print is ready, scroll to the bottom and click :guilabel:`Download PDF` The Field Papers should begin downloading. If it loads in your browser, you may need to save it by going to :menuselection:`File > Save`.
id: Ketika Field Papers Anda telah siap, geser halaman Anda ke bawah kemudian klik :guilabel:`Download PDF` Selanjutnya Field Papers Anda seharusnya sudah mulai ter-download. Jika Field Papers Anda langsung termuat di dalam browser, Anda harus menyimpan file Field Papers tersebut dengan mengklik :menuselection:`File > Save`.

source: When the download is finished, open the PDF file. Connect your computer to a printer and print the page. If everything goes well, you should now have your map printed on paper.
id: Ketika download telah selesai, buka file PDF. Hubungkan komputer Anda dengan sebuah printer dan cetaklah halaman-halaman Field Papers Anda. Jika semuanya berjalan dengan lancar, seharusnya kini Anda telah mendapatkan Field Papers Anda yang telah tercetak di atas kertas.

source: **4. Map with Field Papers**
id: **4. Melakukan pemetaan menggunakan Field Papers**

source: Take your Field Papers outside, and use it as a guide to walk and identify new places that are not on the map.
id: Bawalah Field Papers Anda keluar, dan gunakan Field Papers sebagai panduan untuk berjalan dan mengidentifikasi tempat-tempat baru yang belum ada pada peta.

source: Draw lines for roads, shapes for buildings, and so forth. Write notes about each location directly on the map, or write numbers on the map that relate to numbers in your notebook, where you can write more detailed information about each object.
id: Gambarlah garis untuk jalan, bentuk untuk bangunan, dan seterusnya. Tulislah catatan tentang masing-masing lokasi secara langsung pada peta, atau tulislah angka pada peta yang menghubungkan objek pada peta dengan catatan, dimana Anda menuliskan informasi yang lebih detail tentang objek Anda.

source: When you are satisfied with your additions on the paper map, then you can add them digitally into OpenStreetMap.
id: Ketika Anda sudah merasa puas dengan penambahan pada Field Papers, kemudian Anda dapat menambahkannya secara digital ke dalam OpenStreetMap.

source: **5. Scan and Upload**
id: **5. Scan dan Upload**

source: Field Papers are very useful for mapping with nothing more than paper, but they are not 100% magic. We will still need to add our paper into JOSM, add our information digitally, and save our changes on OpenStreetMap.
id: Field Papers sangat berguna untuk melakukan pemetaan lebih dari kertas, namun Field Papers tidak 100%. Kita masih perlu menambahkan Field Papers ke dalam JOSM, menambahkan informasi kita secara digital, kemudian menyimpan perubahan kita pada OpenStreetMap.

source: The first step is to scan your Field Papers into your computer. You can do this by attaching a scanner to your computer, scanning the paper, and saving it as an image file. If you don’t have a scanner, you can take a photography of the paper, but you should be carefully to take a very good photo. Make sure that the paper is flat and your camera is directly in front of it. Be sure to include the barcode in the image, as Field Papers will not work without it. Here is an example of a scanned/photographed image:
id: Langkah pertama adalah scan Field Papers Anda ke komputer. Anda bisa melakukan hal ini dengan memasang dan menghubungkan sebuah scanner ke komputer, scan kertas Field Papers, dan menyimpan hasil scan tersebut menjadi sebuah file gambar. Jika Anda tidak memiliki scanner, Anda dapat mem-foto kertas Field Papers, namun Anda harus berhati-hati agar dapat mengambil gambar yang baik. Pastikan Field Papers dalam kondisi benar-benar datar dan kamera Anda tepat berada di depan kertas Field Papers. Pastikan Anda mengikutsertakan barcode untuk foto, karena Field Papers tidak akan bekerja tanpa barcode ini. Berikut ini adalah contoh kertas Field Papers yang telah di-scan ataupun difoto :

source: Once you have your Field Papers scanned and saved on the computer, open your web browser and return to `Field Papers website <http://fieldpapers.org/>`_ just as before.
id: Begitu Anda men-scan Field Papers dan menyimpannya di komputer Anda, buka browser internet Anda dan bukalah situs <http://fieldpapers.org/>`_

source: Click on the :guilabel:`Upload` tab at the top of the page.
id: Klik pada tab :guilabel:`Upload` di sisi atas halaman.

source: Click :guilabel:`Choose File` and navigate to the file where you scanned/photographed your Field Papers.
id: Klik :guilabel:`Choose File` dan arahkan ke file hasil scan/foto Field Papers Anda.

source: Click :guilabel:`Upload`. It may take a few minutes for your paper to upload, depending on the speed of your internet connection.
id: Klik :guilabel:`Upload`. Proses upload ini membutuhkan beberapa menit, tergantung pada kecepatan koneksi internet Anda.

source: You’ll be able to add additional notes to your Field Papers, but we will skip this for now. Click on :guilabel:`Finished`
id: Anda dapat menambahkan catatan tambahan pada Field Papers, namun untuk saat ini kita akan melewatinya saja. Langsung klik :guilabel:`Finished`

source: **6. Open in JOSM**
id: **6. Buka JOSM**

source: When your scan have been processed, now you can add the results of your scan in JOSM and add your information to OpenStreetMap. To display Field Papers scan result in JOSM, you can use the fieldpapers plugin.
id: Ketika hasil scan Anda telah selesai diproses, kini dapat menambahkan hasil scan tersebut di JOSM dan menambahkan informasi ke OpenStreetMap. Untuk menampilkan hasil scan Field Papers didalam JOSM, Anda dapat menggunakan plugin fieldpapers.

source: Open JOSM and Click :menuselection:`Edit > Preference`
id: Buka JOSM dan klik :menuselection:`Edit > Preference`

source: Choose :guilabel:`Plugin` box
id: Pilih kotak :guilabel:`Plugin`

source: and type ‘fieldpapers’ on the :guilabel:`Search` box. After it was found, put checks on the fieldpapers box - Click :guilabel:`OK` then Restart your JOSM.
id: dan ketikkan ‘fieldpapers’ pada kotak :guilabel:`Cari` Setelah ditemukan, beri tanda centang pada kotak fieldpapers - klik :guilabel:`OK` kemudian Restart JOSM Anda.

source: Open your browser and open Field Papers website: http://fieldpapers.org
id: Buka browser Anda dan buka situs http://fieldpapers.org

source: Click :guilabel:`Watch` Menu - move your mouse to the bottom and click :guilabel:`Snapshots` until your browser page looks like this:
id: Klik Menu :guilabel:`Watch` - arahkan mouse ke bawah dan klik :guilabel:`Snapshots`, sampai halaman browser Anda terlihat seperti ini :

source: Then select Field Papers according with the scans results that have been uploaded.
id: Kemudian pilih Field Papers sesuai dengan hasil scan yang sudah diupload.

source: If you've found an image that correspond to the scan results, click on the image until the url appear as shown below, copy the URL for example *http://fieldpapers.org/snapshot.php?id=67v87z5n#18/-5.15534/119.43913* and paste on Field Papers menu in JOSM.
id: Jika sudah ditemukan gambar yang sesuai dengan hasil scan, klik gambar tersebut dan sampai muncul url seperti gambar dibawah ini, copy URL sebagai contoh *http://fieldpapers.org/snapshot.php?id=67v87z5n#18/-5.15534/119.43913* dan paste pada Menu Field Papers di JOSM.

source: Open your JOSM and make sure there are Field Papers menu on the top of toolbar.
id: Buka JOSM Anda dan pastikan terdapat Menu Field Papers di bagian atas toolbar

source: Click :menuselection:`Field Papers > Scanned Map` then paste the URL that we have copy of Field Papers site by pressing :kbd:`Ctrl + V` on your keyboard.
id: Klik :menuselection:`Field Papers > Scanned Map` kemudian paste alamat URL yang sudah kita copy dari situs Field Papers dengan cara tekan tombol :kbd:`Ctrl + V` pada keyboard.

source: Click :guilabel:`OK`.
id: Klik :guilabel:`OK`.

source: Please wait a moments until Field Papers map appears on your JOSM layer.
id: Mohon tunggu beberapa saat sampai muncul peta field papers pada layer JOSM Anda.

source: Currently you have Field Papers layers that can be used as a reference to add OSM data according to field result (survey) that has been done. It is important to remember to edit the data we need to download OSM data first by clicking :menuselection:`File > Download from OSM`. You don’t have to re-draw the box to download because JOSM been reading your region according to the Field Papers layer automatically. Then Click :guilabel:`Download` to download that area.
id: Saat ini Anda telah memiliki layer Field Papers yang dapat dijadikan acuan dalam menambahkan data OSM sesuai hasil lapang (survey) yang dilakukan. Hal yang penting untuk diingat untuk mengedit data OSM kita perlu mendownload data OSM terlebih dahulu dengan klik :menuselection:`File > Download from OSM` dari OSM, Anda tidak perlu menggambar ulang kotak yang akan didownload, karena secara otomatis kotak berwarna merah menyesuaikan layer JOSM sehingga sudah sesuai dengan area Field Papers Anda. Kemudian klik :guilabel:`Download` untuk mendownload area tersebut.

source: Wait until the download is complete and the layer that contains OSM data appear as shown below.
id: Tunggu hingga proses download selesai dan muncul data layer yang berisi data OSM seperti gambar di bawah ini.

source: You can edit the OSM data according to the field results (survey).
id: Anda dapat mengedit data OSM sesuai dengan hasil lapang (survey).

source: After editing all area are finished, don’t forget to upload the OSM data by clicking File and select Upload Data.
id: Setelah semua area selesai diedit, jangan lupa untuk mengupload data OSM tersebut dengan cara klik Berkas lalu pilih Upload Data.

source: Now you have finished adding OSM data according to field result (survey) that has been done.
id: Saat ini Anda telah selesai menambahkan data OSM yang sesuai dengan hasil lapang (survey) yang dilakukan.
