Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/beginner/osm/106-editing-osm-with-josm.po
Languages: id

source: You can use the :menuselection:`Presets` menu to open up a form and edit the information, or
id: Menggunakan menu :menuselection:`Presets` untuk membuka suatu form dan mengedit informasi pada form tersebut, atau

source: you can edit the tags directly in the :guilabel:`Properties` window on the right.
id: Mengedit tag secara langsung pada panel :guilabel:`Properti` di sebelah kanan JOSM.

source: *4.2. Common Mistake*
id: *4.2. Kesalahan Umum:*

source: *Tagging Nodes When You Want to Tag Lines or Polygons.*
id: *Memberi Tag pada Suatu Node, Padahal yang Sebenarnya Anda Inginkan adalah memberi Tag pada Objek Garis ataupun Area/Poligon Anda.*

source: When you are adding tags to a node, you select the node and then add your tags (or use the :menuselection:`presets` menu). When you want to add tags to a line or polygon, it is important that you select the line, and NOT the nodes that make up the line.
id: Ketika Anda menambahkan tag pada suatu objek titik, Anda terlebih dahulu harus memilih titik kemudian menambahkan tag (atau gunakan menu :menuselection:`presets`). Namun, penting untuk diperhatikan bahwa jika Anda ingin menambahkan tag pada suatu objek garis atau bentuk/poligon, Anda harus memilih pada garis dari objek, dan BUKAN pada titik-titik penyusun garis/poligon.

source: A common mistake is to use the JOSM select tool to draw a box around an object, which causes everything, both the line and the nodes to be selected, and when you add tags they are applied to the nodes as well. Be sure to only select lines when you want to add tags to them.
id: Kesalahan yang umum terjadi pada JOSM yaitu Anda menggunakan tool “Pilih” untuk menggambar kotak yang mengelilingi/mencakup suatu objek. Hal ini mengakibatkan semua elemen dari objek tersebut, baik garis maupun titik-titik pada garis tersebut, menjadi dalam posisi terpilih. Dan ketika Anda memberikan tag, maka tag tersebut akan berlaku untuk semua elemen yang terpilih, bahkan pada titik-titik atau *node* nya. Pastikan bahwa Anda hanya memilih garis pada objek yang akan Anda beri tag/keterangan tersebut.

source: For more information about tags and presets can be found on the Intermediate OpenStreetMap Guide Module 4: XML and Preset in JOSM.
id: Untuk informasi lebih lanjut tentang tag dan preset dapat Anda temukan pada Panduan OpenStreetMap Tingkat Menengah *Modul 4: XML dan Preset pada JOSM*.

source: **5. Upload Changes**
id: **5. Upload Perubahan**

source: After you have made a couple of changes to improve the map, let’s save those changes to OpenStreetMap. To save the changes, we need to be connected to the internet, because we are in fact uploading the changes to OpenStreetMap.
id: Setelah Anda melakukan beberapa perubahan dan perbaikan pada peta, segera simpan perubahan-perubahan tersebut pada OpenStreetMap. Untuk menyimpan perubahan tersebut, kita membutuhkan koneksi internet, karena proses penyimpanan ini pada dasarnya meng-upload perubahan-perubahan tersebut ke OpenStreetMap.

source: Click :menuselection:`File` on the top menu, and then click :menuselection:`Upload Data`. This will open up the upload window. You can access this window more simply by clicking on the upload button, shown here:
id: Klik menu :menuselection:`Berkas` pada bagian atas halaman JOSM, kemudian klik submenu :menuselection:`Upload Data`. Langkah ini akan membuka kotak dialog “Upload”. Anda juga dapat mengakses kotak dialog “Upload” ini dengan lebih mudah dengan mengklik tombol :menuselection:`Upload` seperti terlihat disini:

source: The window that appears shows a list of the objects that you are adding and the objects you are modifying or deleting. In the box at the bottom you are asked to provide a comment about the changes that you are making. Type in here a description of your edits.
id: Jendela yang muncul menampilkan daftar objek yang Anda tambahkan, edit, atau pun Anda hapus. Pada kotak di bagian bawah, Anda diminta untuk memberikan komentar tentang perubahan yang Anda buat. Ketikkan disini deskripsi dari perubahan Anda.

source: Click :guilabel:`Upload Changes`.
id: Klik tombol :guilabel:`Upload Perubahan`.

source: If this is your first time saving changes to OpenStreetMap, you will be asked for the username and password that you created in Module 2 . Enter them in the window that appears. If you check the box in this window, your username and password will be saved and you won’t need to enter them again in the future. Click :guilabel:`Authenticate`.
id: Jika ini adalah pertama kali Anda menyimpan perubahan peta pada OpenStreetMap, Anda akan ditanya tentang username dan password OpenStreetMap Anda, yang telah Anda buat pada Modul 2. Masukkan username dan password pada jendela yang muncul. Jika Anda mencentang “Simpan user dan password - unencrypted” pada bagian bawah kotak dialog tersebut, maka username dan password Anda akan tersimpan dan Anda tidak perlu mengetikkan username dan password pada upload berikutnya. Selanjutnya klik :guilabel:`Membuktikan`.

source: You will need to wait a few seconds for your changes to be uploaded, and then you are done! You have made your first edits to OpenStreetMap. You may continue editing to add all your points if you wish. Always be sure to upload your changes before you close JOSM.
id: Anda perlu menunggu beberapa detik hingga perubahan-perubahan Anda ter-upload, dan kemudian selesai! Anda baru saja melakukan editing pertama pada OpenStreetMap. Anda dapat melanjutkan pengeditan untuk menambahkan titik-titik lainnya jika Anda mau. Selalu pastikan bahwa Anda meng-upload perubahan sebelum menutup JOSM.

source: After changes we are doing have been uploaded, now let's look the changes on the OpenStreetMap Map with the following steps:
id: Setelah perubahan yang kita lakukan sudah ter-upload, sekarang mari kita lihat perubahan tersebut pada Peta OpenStreetMap dengan langkah-langkah sebagai berikut:

source: Open your internet browser and go to `openstreetmap.org <http://openstreetmap.org>`_
id: Buka browser internet Anda, kemudian buka alamat situs berikut `openstreetmap.org <http://openstreetmap.org>`_

source: Move the map to the area that you edited.
id: Geser peta OpenStreetMap ke area yang telah Anda edit.

source: You should see your changes now appearing on the map! If you don’t, try pressing :kbd:`CTRL+R` to refresh the web page. Sometimes the map doesn’t update properly and needs to be reloaded.
id: Seharusnya Anda sekarang telah melihat perubahan Anda pada peta OpenStreetMap. Jika tidak, Refresh halaman browser Anda, dengan menekan :kbd:`CTRL + R` pada keyboard Anda. Jika masih belum tampak perubahan yang Anda buat, terkadang browser belum mengupdate peta dengan baik, dan perlu di-reload kembali.

source: What if you don’t see your changes? Don’t worry - it may take a few minutes for the changes to be shown on the map. Also, check your additions in JOSM to make sure that you added them correctly. A good general rule is, if your point has an icon in JOSM, then it should be seen on the main map at the OpenStreetMap website.
id: Bagaimana jika perubahannya masih belum tampak? Jangan khawatir, terkadang dibutuhkan beberapa menit hingga perubahan Anda muncul pada halaman OpenStreetMap. Cek pula penambahan-penambahan yang Anda buat pada JOSM, untuk memastikan bahwa Anda telah menambahkannya dengan benar. Ada satu aturan sederhana, jika titik-titik Anda ataupun garis dan area telah tampil dengan suatu simbol/ikon tertentu pada JOSM, maka objek tersebut seharusnya juga muncul pada situs OpenStreetMap.

source: **6. Saving OSM files**
id: **6. Menyimpan File OSM**

source: Sometimes after you download some OSM data, you may wish to save it so that you can edit it offline, and then upload it later when you have internet access again.
id: Setelah Anda mendownload beberapa data OSM, terkadang Anda mungkin ingin menyimpan data tersebut, kemudian Anda ingin mengeditnya secara offline dan mengupload hasil edit tersebut ketika Anda mendapat koneksi internet.

source: To save an OSM file, make sure that it is the active layer in the the Layers panel. Click :menuselection:`File` on the top menu, and click :menuselection:`Save`. Choose a location for the file and give it a name. You can also save by clicking this button:
id: Untuk menyimpan file OSM, pastikan bahwa layer yang aktif adalah layer OSM. Klik menu :menuselection:`Berkas` pada bagian atas halaman JOSM, dan pilih submenu :menuselection:`Simpan`. Pilih pada folder mana Anda akan menyimpan file OSM, dan beri nama file tersebut. Anda juga dapat menyimpan file OSM dengan mengklik ikon berikut ini:

source: You can now close JOSM and your data will be saved. When you want to open the file again, simply open JOSM, go to the :menuselection:`File` menu, and click :menuselection:`Open...`
id: Sekarang Anda dapat menutup JOSM dan data akan tersimpan. Ketika Anda ingin membuka file tersebut kembali, Anda tinggal membuka JOSM, kemudian klik menu :menuselection:`Berkas` dan kemudian klik submenu :menuselection:`Buka…`.

source: **7. Choosing a variety of options and menu by using the keyboard**
id: **7. Pemilihan berbagai pilihan dan menu dengan menggunakan keyboard**

source: Sometimes you become dizzy to click again and again to select the various options and different menu in JOSM. Fortunately, there is a shortcut in JOSM on the keyboard that allows you to do common things. This is the list of keyboard shortcuts and their functions are generally used:
id: Terkadang Anda bisa menjadi pusing untuk mengklik lagi dan lagi untuk memilih berbagai pilihan dan menu yang berbeda dalam JOSM. Untungnya dalam JOSM terdapat jalan pintas atau *shortcut* pada keyboard yang memungkinkan Anda untuk melakukan hal-hal umum. Di bawah ini adalah daftar jalan pintas pada keyboard beserta fungsinya yang pada umumnya digunakan:

source: :kbd:`S`: Select tool (select objects)
id: :kbd:`S`: Select tool (memilih objek)

source: :kbd:`A`: Draw tool (draw objects)
id: :kbd:`A`: Draw tool (menggambar objek)

source: :kbd:`Ctrl + >` : Zoom out
id: :kbd:`Ctrl + >` : Zoom out - untuk memperkecil tampilan

source: :kbd:`Ctrl + <` : Zoom in
id: :kbd:`Ctrl + <` : *Zoom in* - untuk memperbesar tampilan

source: :kbd:`P`: Split Way
id: :kbd:`P`: Split Way - memisahkan garis

source: :kbd:`C`: Combine Way
id: :kbd:`C`: Combine Way - menggabungkan garis

source: :kbd:`O`: Align in Circle (set the points into a circle)
id: :kbd:`O`: Align in Circle (mengatur susunan dari titik-titik menjadi sebuah lingkaran)

source: :kbd:`L`: Align in line (set the points into a straight line)
id: :kbd:`L`: Align in line (mengatur susunan dari titik-titik menjadi sebuah garis lurus)

source: :kbd:`Q`: Orthogonalize (make into a square shape)
id: :kbd:`Q`: Orthogonalize (membuat suatu bentuk menjadi sebuah persegi)
