Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/beginner/osm/106-editing-osm-with-josm.po
Languages: id

source: Module 6: Editing OpenStreetMap with JOSM
id: Modul 6: Mengedit OpenStreetMap dengan JOSM

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Download current OSM data on the area you want to edit.
id: Mendownload data OSM terkini pada wilayah yang akan diedit.

source: Set the layer JOSM
id: Mengatur layer JOSM

source: Editing OSM data
id: Mengedit Data OSM

source: Editing Tag
id: Mengedit Tag

source: Upload OSM data
id: Upload data OSM

source: Save OSM files
id: Simpan file OSM

source: In Module 3 you installed JOSM and began drawing your first points, lines, and shapes. You added presets to these objects in order to attach information about them. By the end, you were able to draw your own map in JOSM.
id: Pada Modul 3 Anda telah mempelajari cara menginstal JOSM dan mulai menggambar *node* (titik), garis, dan bentuk/poligon. Kemudian Anda dapat menambahkan preset pada objek-objek yang Anda gambar tersebut untuk memberikan informasi tentang objek tersebut. Pada akhirnya, Anda telah dapat menggambar peta menggunakan JOSM.

source: Drawing maps in Module 3 was an exercise to learn JOSM and learn how to draw places on the map. But our maps were not accurate, because we had not yet included location. In the past two modules we have examined two tools, GPS and Field Papers, which allow us to collect actual locations of places (Generally, GPS receivers determine your location within +/- 10 meters, so they may not be completely accurate, especially if you only take one waypoint). These locations are represented by coordinates.
id: Menggambar peta pada Modul 3 merupakan latihan untuk mempelajari JOSM dan bagaimana cara menggambar suatu objek pada peta. Namun, peta kita belum akurat karena kita belum memberikan lokasi yang benar. Pada dua modul sebelumnya, kita telah mempelajari dua *tool*, yaitu GPS dan Field Papers, yang memungkinkan Anda untuk mengumpulkan data lokasi secara aktual dari suatu tempat (Secara umum, GPS mendefinisikan lokasi Anda dalam rentang +/- 10 meter, sehingga lokasi yang didapat dengan menggunakan GPS sebenarnya tidak terlalu akurat, apalagi jika Anda hanya mengambil satu *waypoint*). Lokasi ini direpresentasikan atau diwujudkan dalam bentuk koordinat.

source: Drawing a real map, that is, a map where all the points, lines, and shapes are in their proper location, is no different than drawing the maps we drew in Module 3. But now, we will use our GPS points and tracks, and our Field Papers, to draw similar maps at their correct locations on the planet.
id: Membuat peta sesungguhnya, yaitu peta yang setiap titik, garis, dan bentuk/poligon nya berada pada lokasi yang sesungguhnya, tidaklah berbeda dengan menggambar peta yang kita gambar pada Modul 3. Tapi sekarang, kita akan menggunakan titik-titik dan *track* (trek) GPS serta Field Papers untuk menggambar peta serupa pada lokasi yang sebenarnya di atas bumi ini.

source: In this module we will learn how to edit the map on OpenStreetMap and add our improvements. We’ll learn the basic cycle of mapping on OSM:
id: Pada modul ini kita akan mempelajari bagaimana mengedit dan menambahkan data pada peta OpenStreetMap. Kita akan mempelajari langkah-langkah dasar pemetaan dalam OSM:

source: *I. Download the current map data from OSM*
id: *I. Download data peta terkini dari OSM*

source: Explore JOSM
id: Eksplorasi JOSM

source: Download OSM Data
id: *Download* data peta OSM

source: JOSM Layers
id: *Layer* pada JOSM

source: *II. Edit OSM data*
id: *II. Edit data OSM*

source: Common Problem
id: Masalah yang Sering Dijumpai

source: *III. Save changes to OpenStreetMap*
id: *III. Simpan perubahan ke server OpenStreetMap*

source: Upload Changes
id: *Upload* Perubahan

source: See Your Changes on the Map
id: Lihat perubahan yang Anda buat pada peta OpenStreetMap

source: Saving OSM files
id: Menyimpan *file* OSM

source: By the end of this module, we will be able to see our additions on the OSM map.
id: Di akhir modul ini, kita dapat melihat penambahan yang kita lakukan pada peta OSM.

source: **1. Explore JOSM**
id: **1. Eksplorasi JOSM**

source: First, to start JOSM click on the Start Menu in the lower left corner of your computer, and find the program “JOSM”.
id: Pertama-tama, untuk memulai JOSM klik *Start Menu* pada pojok kiri bawah komputer Anda, dan carilah program “JOSM”.

source: Then, load your gpx file and your Field Paper in JOSM. You don’t need to open both, but you can if you want. Refer to the previous two modules if you don’t remember how to open these in JOSM.
id: Kemudian, buka **file gpx** Anda dan *Field Papers* Anda pada JOSM. Anda tidak harus membuka keduanya, tapi jika Anda ingin, Anda dapat membuka kedua file tersebut. Buka kembali dua modul sebelumnya jika Anda lupa bagaimana caranya untuk membuka file tersebut pada JOSM.

source: A quick tour of JOSM’s features: JOSM has many different features. The main window in JOSM you are already familiar with- this is the map window, and it is where most of the action takes place. Here you view, edit, and add to the OpenStreetMap data.
id: JOSM memiliki banyak fitur dan fitur yang berbeda-beda. Halaman utama JOSM yang Anda telah mengenal halaman ini adalah halaman peta atau “map window”, dan pada halaman ini hampir semua pekerjaan dilakukan. Pada halaman ini Anda dapat melihat, mengedit, dan menambahkan data ke OpenStreetMap.

source: To the right of the map window are a series of panels, which each do something different. Typically when you first install JOSM several panels are shown by default, such as :guilabel:`Layers`, :guilabel:`Properties`, and :guilabel:`Selection`. When you select a point, line, or shape in the map window, it will be shown in the :guilabel:`Selection` panel. Information about the object will be shown in the :guilabel:`Properties` panel, and the username of the author of that object will be shown in the :guilabel:`Authors` panel.
id: Pada sisi kanan halaman peta terdapat beberapa panel yang masing-masing memiliki tugas dan fungsi yang berbeda-beda. Ketika Anda pertama kali menginstal JOSM beberapa panel telah muncul secara otomatis, seperti panel :guilabel:`Layer`, :guilabel:`Properti`, dan :guilabel:`Seleksi`. Ketika Anda memilih suatu objek titik, garis, ataupun bentuk/poligon pada halaman peta, objek tersebut akan muncul pada panel :guilabel:`Seleksi`, dan informasi-informasi tentang objek tersebut akan muncul pada panel :guilabel:`Properti`, dan nama pengguna pembuat objek tersebut akan muncul pada panel :guilabel:`Pembuat`.

source: On the left side of JOSM, there are several toolbars, which consist of many buttons. At the top of this bar are different buttons which change what you can do with your mouse. You are already familiar with the first two, the :guilabel:`Select` tool and the :guilabel:`Draw tool`. The other tools make it easier to zoom in, delete an object, draw a shape, or create a line that is parallel to another line.
id: Pada sisi kiri JOSM terdapat beberapa toolbar, yang mana terdiri dari banyak tombol/ikon. Masing-masing toolbar ini memiliki fungsi yang berbeda-beda. Anda telah mengenal dua toolbar pertama, yaitu tool :guilabel:`Select` dan tool :guilabel:`Draw`. Alat-alat yang lain berfungsi untuk mempermudah *zoom in* atau memperbesar peta, menghapus objek, menggambar bentuk-bentuk tertentu, ataupun membuat sebuah garis yang sejajar dengan suatu garis.

source: Below these tools are many more buttons. These buttons control what you see on the right side of JOSM. Using these buttons you can open and close the boxes on the right, such as :guilabel:`Properties`, :guilabel:`Selection`, and :guilabel:`Author`.
id: Di bawah alat-alat ini terdapat banyak tombol, yang mengontrol apa yang dapat kita lihat pada sisi kanan halaman JOSM. Dengan menggunakan tombol-tombol tersebut, Anda dapat membuka ataupun menutup kotak/panel pada sisi kanan JOSM, seperti kota/panel :guilabel:`Properti`, :guilabel:`Seleksi`, dan :guilabel:`Pembuat`.

source: *1.1. Download OSM Data*
id: *1.1. Download Data OSM*

source: Remember the cycle of editing OpenStreetMap described in the introduction of this module? Download, edit, save. Before we can edit the map, we must download the existing OSM data in our area.
id: Masih ingat dengan tahapan edit data OpenStreetMap yang dijelaskan pada awal modul ini? *Download, edit, simpan*. Sebelum kita mengedit peta, kita harus mendownload data OSM pada wilayah kerja kita. Untuk apa? Untuk mengetahui objek apa saja yang telah tergambar. Jika suatu objek telah tergambar, Anda tidak perlu menggambar kembali objek tersebut. Sedangkan bagi objek-objek yang belum tergambar, Anda dapat menambahkan gambar dengan mendigitasi pada objek tersebut.

source: When you open your gpx track or Field Paper, the map window will show what you have opened, and will automatically move to the correct coordinates. After you open your files, look in the bottom left corner of JOSM. You can see the latitude and longitude (coordinates) of your mouse cursor.
id: Ketika Anda membuka trek GPS atau Field Papers Anda, jendela peta akan menunjukkan apa yang Anda buka, dan secara otomatis akan berpindah ke koordinat yang tepat. Setelah Anda membuka file Anda, lihat pada pojok kiri bawah JOSM. Anda dapat melihat *Y / Latitude* dan *X / Longitude* (koordinat) dari kursor mouse Anda.

source: Because our map window is already showing the area that we want to edit, it is easy to download the OpenStreetMap data for this area. Click on :menuselection:`File` in the top left corner of JOSM and click :menuselection:`Download from OSM`. This will open up the :guilabel:`Download` window. You can access this window more simply by clicking on the :guilabel:`Download` button, shown here:
id: Karena halaman peta telah menunjukkan area yang akan kita edit, maka mudah saja bagi kita untuk mendownload data OpenStreetMap sesuai area kerja kita. Klik menu :menuselection:`Berkas` pada pojok kiri atas JOSM, kemudian pilih submenu :menuselection:`Download dari OSM`, maka akan terbuka kotak dialog :guilabel:`Download`. Juga Anda dapat mengakses kotak dialog tersebut dengan cara yang lebih cepat dan mudah, yaitu dengan mengklik tombol :guilabel:`Download`, seperti di bawah ini:

source: When the download window opens, you should see a map with a pink box drawn on it. If you don’t see the map, click on the tab marked :guilabel:`Slippy map`
id: Ketika kotak dialog terbuka, Anda seharusnya melihat sebuah peta dengan kotak berwarna merah muda di atas peta tersebut. Kotak berwarna merah muda itu menunjukkan lokasi wilayah Anda. Jika Anda tidak melihat peta, klik tab :guilabel:`Pencarian peta secara cepat`.

source: The pink box represents the area of the map that we would like to download for editing. Unless you have moved the map window since you opened your GPS file or Field Papers, the box should be drawn around the correct area. However if you would like to download a larger area, you can draw a new box . To draw a new box, click on the map, hold your left mouse button down, and drag your mouse to create a box. Release the mouse button to finish drawing the box.
id: Kotak berwarna merah muda menunjukkan area yang akan didownload datanya untuk selanjutnya Anda edit. Jika Anda tidak menggeser peta pada halaman peta ataupun menutup halaman peta dimana Anda membuka file GPS atau Field Papers, kotak merah muda seharusnya sudah tergambar di sekitar area yang benar yaitu pada wilayah kerja Anda. Namun, jika Anda ingin mendownload data untuk wilayah yang lebih luas, Anda dapat menggambar kotak baru. Untuk menggambar kotak baru, klik pada peta, klik kiri dan tahan tombol kiri mouse, kemudian drag mouse Anda untuk membuat sebuah kotak. Lepaskan tombol kiri mouse Anda yang mana sejak tadi Anda tekan dan tahan, untuk menyelesaikan penggambaran kotak merah muda.

source: When you are satisfied with the size and location of the box, click :guilabel:`Download` at the bottom of the window. JOSM will get the data for this area from OpenStreetMap and open it in your map window for editing.
id: Ketika ukuran dan lokasi/posisi kotak merah muda sudah sesuai dengan Anda, klik tombol :guilabel:`Download` yang terdapat pada bagian bawah kotak dialog. JOSM akan mendapatkan dan mendownload data OpenStreetMap untuk area tersebut dan bukalah pada halaman peta Anda untuk mengeditnya.

source: *2. JOSM Layers*
id: *2. Layer JOSM*

source: Open your GPS file and downloaded data from OpenStreetMap, if you haven’t already. You may notice that when you open a file, or add Field Papers, or download from OpenStreetMap, another item is added to the :guilabel:`Layers` panel on the right side of JOSM. Your :guilabel:`Layers` panel may look something like this:
id: Buka file GPS Anda dan download data dari OpenStreetMap. Perhatikan bahwa ketika Anda membuka sebuah file, atau menambahkan Field Papers, atau mendownload dari OpenStreetMap, sebuah item baru akan bertambah pada panel :guilabel:`Layer` di sisi kanan JOSM. Panel :guilabel:`Layer` Anda seharusnya terlihat seperti berikut:

source: Each item in this list represents a different source of data that you have open in your map window. In the example above, “Data Layer 2” is the OpenStreetMap data that we want to edit. “Markers” are the waypoints from the GPS, and “30 Juni 2011.gpx” is the track from the GPS. Finally, “Field Papers” is the layer created when I added my Field Papers into JOSM. You can add the Bing imagery layer, which shows satellite imagery, by clicking :menuselection:`Imagery` on the top menu of JOSM and selecting :menuselection:`Bing Sat`.
id: Setiap item pada daftar tersebut menunjukkan data atau file apa saja yang telah Anda buka pada JOSM berikut sumber datanya. Pada contoh di atas, “Data Layer 2” merupakan layer yang isinya berasal dari data OpenStreetMap yang mana akan kita edit. “Penanda” merupakan layer yang isinya adalah waypoint dari GPS, dan “30 Juni 2011.gpx” merupakan layer yang isinya adalah track GPS. Terakhir, “Field Papers” merupakan layer yang terbentuk saat kita menambahkan Field Papers kita pada JOSM. Anda dapat menambahkan layer Citra Satelit “Bing”, dengan meng-klik menu :menuselection:`Citra Satelit` kemudian memilih submenu :menuselection:`Bing Sat`.

source: To hide one of these layers, select one of them with your mouse and click the :guilabel:`Show/Hide` button that looks like this:
id: Untuk menyembunyikan salah satu layer, pilih dengan mouse layer yang ingin Anda sembunyikan tersebut dan klik tombol :guilabel:`Tampilkan/Sembunyikan` seperti ini:

source: You should see the layer that you selected disappear in the map window. Click :guilabel:`Show/Hide` again, and it will reappear.
id: Begitu Anda meng-klik “Tampilkan/Sembunyikan”, seharusnya layer yang Anda pilih tersebut menjadi tidak tampak pada halaman peta. Klik :guilabel:`Tampilkan/Sembunyikan` lagi, maka Anda akan melihat layer muncul kembali.

source: You can close a layer by selecting it and using the :guilabel:`Delete` button:
id: Anda dapat menutup/menghapus suatu layer dengan memilih layer tersebut dengan menyosorot nama layer Anda, kemudian klik kiri mouse Anda, kemudian klik tombol :guilabel:`Hapus` yang terdapat di pojok kanan bawah panel “Layer”

source: Lastly, it’s important to know that you can only edit the layer that is considered "Active” by JOSM. If you are unable to edit the map in your map window, it’s probably because you don’t have the correct layer set as active . Most layers, such as GPS points, Field Papers, and satellite imagery, can’t be edited. The only layers that can be edited are data from OpenStreetMap, which are usually called “Data Layer 1”.
id: Terakhir, penting untuk dipahami bahwa Anda hanya dapat mengedit layer yang berada dalam posisi “Aktif”. Jika Anda tidak dapat mengedit peta pada halaman peta, hal ini kemungkinan karena layer yang aktif bukanlah layer yang Anda inginkan untuk diedit. Sebagian besar layer, seperti titik/waypoint GPS, Field Papers, dan citra satelit, tidak bisa diedit. Satu-satunya layer yang bisa diedit adalah layer yang berasal dari OpenStreetMap, yang biasanya bernama “Data Layer 1”.

source: To make a layer active, select it in the :guilabel:`Layers` panel, and click on the :guilabel:`Activate` button:
id: Untuk mengaktifkan suatu layer, pilih nama layer Anda pada panel :guilabel:`Layer`, kemudian klik tombol :guilabel:`Aktifkan`:

source: The next step is to edit the map and add new items. This is not always easy at first, but with practice you will get better and better. Note that you can select various tools in JOSM by clicking on their icons, or you can use buttons on the keyboard as shortcuts. The shortcut keys will be indicated in parentheses below.
id: Langkah selanjutnya adalah mengedit peta dan menambahkan item-item ataupun data baru. Sedikit rumit jika Anda baru pertama kali melakukan editing pada JOSM, namun dengan praktek dan latihan secara rutin Anda akan semakin mahir dan mudah dalam melakukan Editing pada JOSM. Catatan Anda dapat memilih variasi tool pada JOSM dengan klik ikon, atau Anda dapat menggunakan tombol pada keyboard sebagai jalan pintas. Jalan pintas yang terindikasi di bawah ini.

source: If you want to move a point, line, or shape, use the :`guilabel:`Select` tool (:kbd:`S`).Click on an object and drag it where it should be. This can be used to correct the location of items that have been put in the wrong place.
id: Jika Anda ingin menggeser atau memindahkan suatu titik, garis, ataupun bentuk/poligon; gunakan tombol :guilabel:`Pilih` (:kbd:`S`). Klik pada objek yang ingin digeser/dipindahkan, kemudian geser pada lokasi yang seharusnya. Kita dapat menggunakan cara ini untuk memperbaiki lokasi/posisi objek kita yang sebelumnya dalam posisi yang salah ataupun kurang tepat.

source: Use the :guilabel:`Draw` tool (:kbd:`A`) to draw new points, lines, and shapes. Describe these objects by selecting from the :menuselection:`Presets` menu, as you did in Module 3.
id: Gunakan tombol :guilabel:`alat Gambar` (:kbd:`A`) untuk menggambar titik, garis, ataupun bentuk/poligon yang baru. Deskripsikan dan berikan keterangan-keterangan lain yang menjelaskan objek apakah itu. Gunakan menu :menuselection:`Preset` untuk memberikan keterangan-keterangan tentang objek, sebagaimana yang telah dijelaskan pada Modul 3.

source: Remember that your GPS points and your Field Papers don’t automatically go into OpenStreetMap. You need to add them to the OSM map digitally, using the :guilabel:`Draw` tool. But your points, tracks, and Field Papers can be seen in the background as a guide.
id: Ingat, titik-titik GPS dan Field Paper Anda tidak otomatis masuk menjadi bagian dari data OpenStreetMap. Anda harus menambahkan titik-titik GPS dan Field Paper Anda ke data OpenStreetMap secara digital, yaitu dengan menggambar titik-titik tersebut menggunakan :guilabel:`alat Gambar`. Jadi, titik-titik GPS, track GPS, dan Field Papers Anda hanya menjadi latar belakang sebagai panduan saat kita akan menggambar dan melakukan editing.

source: Let’s assume that you saved a waypoint on your GPS named 030, and you wrote in your notebook that 030 is a school. To add this point into OpenStreetMap, you should select the :menuselection:`Draw` tool, and double-click on top of point 030 in your map window. This will create a point. Then go to the :menuselection:`Presets` menu, and find the preset for school. Enter the name of the school and click :guilabel:`Apply Preset`. Do the same to add lines and shapes.
id: Sebagai contoh, misalnya Anda menyimpan satu waypoint pada GPS Anda dengan nama titik 030, dan pada buku catatan Anda memberikan keterangan bahwa titik 030 adalah sebuah sekolah. Untuk menambahkan titik ini ke OpenStreetMap, Anda harus menggambarnya sendiri. Caranya, terlebih dahulu klik tombol :menuselection:`alat Gambar`, dan lakukan double-klik tepat di atas titik 030 pada halaman peta Anda. Maka akan terbentuk satu objek titik. Langkah selanjutnya adalah memberikan keterangan bahwa objek tersebut adalah suatu sekolah. Bagaimana caranya? Gunakan :menuselection:`Preset`. Klik menu :menuselection:`Presets`, kemudian carilah preset untuk sekolah. Tuliskan nama sekolahnya dan klik :menuselection:`Tambahkan Preset`. Lakukan cara yang sama untuk menggambarkan objek garis dan bentuk/poligon.

source: **4. Tags**
id: **4. Tag**

source: When you draw a point, line, or shape, it has a location, but no information about what it is. In other words, we know where it is, but not what it is. Before now, we have been using items from the :menuselection:`Presets` menu to define what it is. The way OpenStreetMap knows what an object is is by using tags.
id: Ketika Anda menggambar suatu objek titik, garis, ataupun bentuk/poligon, objek tersebut telah memiliki lokasi, namun tidak ada informasi tentang objek apakah itu. Dengan kata lain, kita tahu **dimana** objek tersebut, tapi kita tidak tahu apakah itu. Sebelumnya, kita menggunakan menu :menuselection:`Preset` untuk mendefinisikan **apakah** suatu objek itu. Cara OpenStreetMap mengetahui apakah suatu objek itu adalah dengan menggunakan **tag**.

source: A tag is like a label that you can put on something. For example, if I draw a square, it’s only a square. But then I add multiple tags to it that describe what it is: this square is a building, the name of the building is **“Menara Thamrin”**, the building is 16 levels high.
id: Sebuah tag adalah mirip sebuah label yang mana Anda dapat menambahkan keterangan di dalamnya. Sebagai contoh, Saya menggambar sebuah area persegi, maka persegi tersebut hanyalah sebuah bentuk persegi. Namun kemudian Saya menambahkan banyak tag untuk mendeskripsikan objek apakah yang Saya gambar tersebut: bahwa persegi tersebut adalah sebuah gedung, dengan nama gedung **“Menara Thamrin”**, dan memiliki 16 lantai.

source: You can add as many tags as you want to an object. Tags are saved as pairs of text, called the keys and the values. In OpenStreetMap, the tags written above would in fact be: **building = yes**, **name = Menara Thamrin**, **building:levels = 16**.
id: Anda dapat menambahkan tag sebanyak apapun pada suatu objek. Tag disimpan sebagai sepasang teks, yaitu keys dan values. Pada OpenStreetMap, tag yang ditulis di atas tersebut sebenarnya tertulis sebagai berikut: **building = yes**, **name = Menara Thamrin**, **building:levels = 16**.

source: If you select an object in JOSM, you can see all the tags that are attached to it in the :guilabel:`Properties` panel on the right.
id: Jika Anda memilih suatu objek pada JOSM, Anda dapat melihat semua tag yang terdefinisi untuk objek yang Anda pilih tersebut. Tag-tag dan nilainya tersebut dapat dilihat pada panel :guilabel:`Properti` di sisi kanan JOSM.

source: *4.1. Editing Tags*
id: *4.1. Cara Mengedit Tag*

source: You can add, edit, and delete these tags from this panel. The tags are traditionally in English however, so it is often better to use the :menuselection:`Presets` menu. When you add or change tags, such as primary highway versus footpath, the style will change according to the tag.
id: Anda dapat menambahkan, mengedit, dan menghapus suatu tag. Akan tetapi, tag-tag ini dalam bahasa Inggris, jadi sepertinya akan lebih mudah dan lebih disarankan untuk menggunakan menu :menuselection:`Preset`. Ketika Anda menambahkan atau mengubah tag, misalnya jalan primer, jalan kolektor, dan lain-lain, simbol yang muncul pada peta akan berubah/berganti sesuai tag yang terdefinisi.

source: To edit an existing object:
id: Untuk mengedit tag pada suatu objek yang telah ada tag-nya:

source: Select it.
id: Pilih objek.

source: Edit the tags in one of two ways:
id: Kemudian Anda dapat mengedit tag dari objek tersebut dengan dua cara:
