Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/beginner/osm/107-imagery-offset.po
Languages: id

source: When using aerial imagery layers, you should ALWAYS check for existing offsets, and when you create your own offset, you should ALWAYS save it to this database.
id: Ketika Anda menggunakan citra satelit, Anda HARUS SELALU mengecek offset yang ada, dan ketika Anda sudah membuat nilai pergeseran citra satelit, Anda HARUS SELALU menyimpannya di database yang ada.

source: *4.2. Add Imagery Offset from the Database*
id: *4.2. Cara memasukkan nilai pergeseran citra satelit melalui database*

source: When you add an imagery layer, the new plugin will alert you that you should check the imagery database for an existing offset. You will see an icon with a red exclamation point on it at the top of JOSM, like this:
id: Ketika Anda memasukkan layer citra satelit, plugin baru akan memberi tahu Anda bahwa Anda harus mengecek database untuk melihat pergeseran citra satelit yang ada. Anda akan melihat ikon dengan tanda seru merah pada bagian atas JOSM seperti ini:

source: Click on the button and the plugin will communicate with the database to see if there are existing offsets in this area.
id: Klik pada tombol tersebut dan plugin akan berkomunikasi dengan database untuk melihat apakah ada yang menyimpan nilai pergeseran citra satelit pada area tersebut.

source: Here we have downloaded OSM data and GPS tracks in Kuta, Bali, Indonesia. In this case, we have found one existing offset. Click on it to apply to the map.
id: Disini kita sudah mengunduh data OSM dan trek GPS di Kuta, Bali, Indonesia. Pada kasus ini kita menemukan salah satu nilai pergeseran citra satelit. Klik pada nilai tersebut untuk memakainya.

source: This causes the imagery layer to shift. However, when we add someone else’s offset like this, we should check that it is valid by comparing to GPS tracks.
id: Ini akan membuat citra bergeser. Akan tetapi, ketika kita menambahkan nilai offset dari pengguna lain, kita harus mengecek melalui track GPS.

source: We can see that the imagery layer is in fact misaligned. We don’t want other users to use this offset, so we should mark it as incorrect in the database. Click on the :guilabel:`Offsets` button again (it won’t have a red exclamation mark anymore).
id: Kita bisa melihat bahwa citra satelit masih belum bergeser dengan benar. Kita tidak menginginkan untuk menggunakan data ini, sehingga kita harus menandai sebagai salah di database. Klik tombol Offset sekali lagi (sekarang tidak ada tanda seru di tombolnya).

source: This time when the dialog opens, right-click on the offset and click :guilabel:`Deprecate Offset`.
id: Kali ini ketika muncul jendela dialog, klik kanan dan klik :guilabel:`Pergeseran yang sudah tidak digunakan`.

source: Click :guilabel:`Yes` to confirm.
id: Klik :guilabel:`Ya` untuk konfirmasi.

source: You will need to enter a reason for deprecating this offset.
id: Anda akan harus memberikan alasan untuk menandakan bahwa nilai offset ini sudah tidak bisa digunakan lagi.

source: *4.3. Add Imagery Offset to the Database*
id: *4.3. Cara menambahkan data pergeseran citra satelit ke database*

source: Now that we have marked this user’s offset as "deprecated", we should add an improved offset to the database.
id: Sekarang Anda sudah memberi tanda data offset pengguna lain sebagai data yang lama, kita harus menambahkan data offset ke dalam database.

source: Click on the :guilabel:`Adjust imagery offset` button.
id: Klik tombol :guilabel:`Atur offset citra`.

source: Adjust the imagery to match the GPS tracks. Click OK in the box.
id: Atur citra satelit agar sesuai dengan track GPS. Klik OK di kotak.

source: Now go to :menuselection:`Offset ‣ Store Imagery Offset...`
id: Pergi ke :menuselection:`Citra Satelit ‣ Menyimpan Pergeseran Citra Satelit...`

source: Enter a description of the offset in the box that opens.
id: Beri deskripsi dari data offset yang akan Anda masukkan.

source: Click :guilabel:`OK`. Your offset will be saved to the database.
id: Klik :guilabel:`OK`. Data offset Anda akan tersimpan di database.

source: Now let’s hide the GPS layer and look at the OSM data against the correctly placed imagery.
id: Sekarang hilangkan layer GPS dan lihat data OSM yang posisinya menjadi tepat dengan citra satelit.

source: Oh No! Somebody mapped this area with misaligned imagery, so the area is not correctly mapped. This will take some time to fix.
id: Tidak! Seseorang telah memetakan area ini dengan data yang salah. Ini akan membutuhkan waktu untuk memperbaikinya.

source: *4.4. Imagery Offset Database Website*
id: *4.4. Situs Database Pergeseran Satelit*

source: Lastly, for more information on the offset database, you can visit the website at http://offsets.textual.ru/. This lists all the offsets that have been uploaded to the database, and it also has a cool map feature that visualizes where the offsets are located, as you can see here:
id: Terakhir, untuk informasi di database pergeseran satelit, Anda bisa pergi ke situs http://offsets.textual.ru/. Ini akan menunjukkan daftar pergeseran satelit yang telah diupload oleh pengguna dan juga tampilan yang bagus yang menunjukkan dimana pergeseran satelit ada, seperti yang Anda lihat disini:

source: One last thing to remember is that the imagery may not be offset the same distance everywhere! This is especially true in regions where there are lots of hills and mountains. So if the imagery seems to be offset differently in different areas, you’ll need to move it again.
id: Satu hal yang perlu diingat adalah jarak pergeseran satelit tidak sama dengan daerah lain! Hal ini terutama di daerah yang memiliki banyak gunung dan bukit. Jadi, jika citra satelit bergeser berbeda di area yang lain, Anda harus menggesernya kembali.
