Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/intermediate/osm/301-advanced-editing.po
Languages: id

source: Relations are difficult to understand and do not have to be used often, but they are necessary to know about. As you get more developed with your OSM skills and want to create more complex building, river and routes, relations will be useful.
id: Relasi sangat sukar untuk dipahami dan tidak harus digunakan secara rutin, tetapi mereka penting untuk diketahui. Jika anda ingin lebih mengembangkan kemampuan OSM anda, anda mungkin ingin membuat bangunan yang lebih kompleks, sungai atau rute, maka relasi akan sangat berguna.
