Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/intermediate/osm/301-advanced-editing.po
Languages: id

source: Module 1: Advanced Editing
id: Modul 1: Teknik Editing Lebih Lanjut

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Use Advanced Editing Tools in JOSM
id: Menggunakan alat edit di JOSM

source: Make relations among objects
id: Membuat relasi antar objek

source: Welcome to the intermediate guide for spatial data collection with OpenStreetMap. In the previous unit you learned how to draw points, lines, and shapes in JOSM; how to open your GPS waypoints and tracks in JOSM; and how to download, edit, and upload your changes on OpenStreetMap. In this chapter, we will describe relations, JOSM editing tools and editing techniques in greater detail.
id: Selamat datang pada panduan tingkat lanjut untuk pengumpulan data spasial dengan OpenStreetMap. Pada unit sebelumnya anda telah mempelajari bagaimana menggambar titik, garis, dan bentuk, pada JOSM; bagaimana membuka waypoint dan track GPS anda pada JOSM; dan bagaimana mendownload, mengedit, dan mengupload perubahan anda pada OpenStreetMap. Pada bab ini, kita akan mendeskripsikan relasi, tool editing di JOSM dan teknik editing dalam detail lebih lanjut.

source: While this chapter is not extremely advanced, it is a step higher than the previous chapters. If you don’t feel like you fully understand the lessons leading up to this, you may wish to practice a little bit more before continuing.
id: Bab ini tidak memerlukan kemahiran tingkat tinggi, namun merupakan selangkah lebih tinggi dari bab-bab sebelumnya. Jika anda merasa tidak mengerti secara penuh mengenai materi lanjutan ini, anda mungkin ingin berlatih sedikit sebelum anda melanjutkan.

source: Topics covered in this chapter:
id: Topik yang akan dibahas pada modul ini:

source: Advanced Editing Tools
id: Tool Mengedit JOSM Tingkat Lanjut

source: Relations
id: Relasi

source: Editing Techniques: The Dos and Don’ts
id: Teknik editing: yang harus dilakukan dan jangan dilakukan

source: Keyboard Shortcuts
id: Jalan pintas menggunakan keyboard

source: **1. Advanced Editing Tools**
id: **1. Tool Mengedit JOSM Tingkat Lanjut**

source: There are a few ways you can access more editing tools in JOSM. We will look more at the default tools, some plug-ins and then keyboard editing shortcuts.
id: Terdapat beberapa cara untuk mengakses alat mengedit dalam JOSM. Kita akan melihat lebih jauh pada tool standar, beberapa plug-ins dan tombol keyboard untuk akses cepat.

source: *1.1 Default Drawing tools*
id: *1.1 Tool untuk Menggambar*

source: JOSM has some additional tools to make it easier to draw lines and shapes. These tools are found in the :menuselection:`Tools` menu at the top of JOSM.
id: JOSM memiliki tool-tool tambahan untuk membuat proses gambar garis atau bentuk menjadi lebih mudah. Alat-alat ini dapat ditemukan di menu :menuselection:`Alat` pada bagian atas JOSM.

source: In order to apply the functions in this menu, you must first select a point, line or shape in the map window. Some of the most useful functions are described here:
id: Untuk mengaplikasikan fungsi-fungsi yang ada di dalam menu ini, pertama-tama anda harus memilih sebuah titik, garis, atau area/poligon pada jendela peta. Beberapa fungsi yang paling berguna akan dijelaskan di bawah ini:

source: **Split Way:** This allows you to divide a line into two separate lines. This is useful if you want to add different attributes to different parts of a road, such as a bridge. To use this function, select a point in the middle of the line that you want to split, Select :menuselection:`Split Way` from the :menuselection:`Tools` menu, and your line should be split in two.
id: **Memisahkan Garis:** Tool ini dapat anda gunakan untuk membagi sebuah garis menjadi dua bagian. Ini sangat berguna jika anda ingin menambahkan atribut pada bagian garis tertentu. Untuk menggunakan fungsi ini, pilihlah sebuah titik pada garis yang ingin anda bagi, pilih :menuselection:`Memisahkan Garis` dari menu :menuselection:`Alat` , dan garis anda seharusnya sudah terbagi menjadi dua bagian.

source: **Combine Way:** This does the opposite of :guilabel:`Split Way`. To combine two lines into a single line, they must share a single point. To use this function, select both lines that you want to combine. You can select more than one object by holding the :kbd:`SHIFT` key on your keyboard and clicking on each line. When you have selected both lines, select :menuselection:`Combine Way` from the :menuselection:`Tools` menu.
id: **Menggabungkan Garis:** Merupakan fungsi yang berlawanan dengan :guilabel:`Membagi Garis`. Untuk menggabungkan dua garis menjadi sebuah garis, garis-garis tersebut harus berbagi dengan sebuah titik. Untuk menggunakan fungsi ini, pilih kedua garis yang ingin anda gabung. Anda dapat memilih lebih dari satu objek dengan menahan tombol :kbd:`SHIFT` pada keyboard anda dan mengklik pada setiap garis. Ketika anda telah memilih kedua garisnya, pilih :menuselection:`Menggabungkan Garis` dari menu alat.

source: Note that you are combining roads that have different directions, you might get this warning:
id: Catatan Jika anda menggabungkan jalan yang memiliki arah yang berbeda, anda akan mendapatkan peringatan seperti ini:

source: If the roads are connected and go in the same direction, then choose :guilabel:`Reverse and Continue`
id: Jika jalan tersebut sudah terhubung dan menuju kearah yang sama, klik :guilabel:`Balik dan Gabungkan`

source: **Reverse Way:** This will change the direction of the line. If the line incorrectly represents a road or river that is one way, you may want to change its direction. Unless someone has intentionally created a way to be one way you do not usually have to worry about altering the direction because ways in OSM default to both ways.
id: **Membalikkan Jalur - Jalur:** Fungsi ini akan merubah arah dari suatu garis. Jika garis anda menggambarkan sebuah jalan satu arah atau anda ingin menggambarkan arah sungai, anda mungkin ingin mengganti arahnya. Kasus lain, arah tidak begitu penting.

source: **Simplify Way:** If your line has too many points in it and you’d like to make it simpler, this will remove some of the points from a line.
id: **Sederhanakan Jalur**: Jika garis anda memiliki terlalu banyak titik dan anda ingin membuatnya sederhana, ini akan mengurangi beberapa titik dari sebuah garis.

source: **Create Circle OR Align Nodes in Circle:** If you are trying to make a circular shape, draw the circle as best you can and then select three nodes and the function. It will help arrange your points in a circle.
id: **Buat Lingkaran atau Sejajarkan Node Membentuk Lingkaran:** Jika anda ingin membuat bentuk melingkar, gambar sebuah lingkaran sesuai kemampuan anda dan kemudian pilih fungsi ini. Fungsi ini akan membantu untuk menyusun titik-titik anda menjadi sebuah lingkaran.

source: **Align Nodes in Line:** This function will align a series of points into a
id: **Sejajarkan Node dalam Garis:** Fungsi ini akan menyusun sebuah titik-titik berseri menjadi sebuah

source: straight line. With long lines it is best to select sections of the line to straighten. Be careful as this does have the tendency to shift the line a little.
id: garis lurus. Dengan garis panjang yang terbaik adalah untuk memilih bagian dari garis untuk meluruskan. Hati-hati karena hal ini memang memiliki kecenderungan untuk menggeser garis sedikit.

source: **Orthogonalize Shape:** This function is very useful for drawing regular shapes such as buildings. After you draw an area, this function will reshape it to have square corners. This feature is most useful for other regularly shaped features, such as tennis courts, or landuse areas. (Using the :guilabel:`Building Plugin`, which will be explained below, might be easier).
id: **Ortogonalisasi Bentuk:** Fungsi ini sangat berguna untuk menggambar bentuk sederhana seperti bangunan. Setelah anda menggambar sebuah area. Fungsi ini akan membentuk ulang menjadi sebuah persegi. Plugin buildings, bagaimanapun, menandakan bahwa fitur ini adalah fitur yang paling berguna untuk fitur sederhana lainnya, seperti lapangan tenis, atau wilayah penggunaan tanah. (Gunakan :guilabel:`Building Plugin`, yang akan dijelaskan di bawah ini, mungkin lebih mudah).

source: **Unglue way:** This tools allows you to detach nodes that are connected.
id: **Memisahkan Garis :** Tool ini berguna untuk memisahkan titik yang terhubung.

source: The line and node will not actually appear separate as the last screen shot implies.
id: Garis dan titik sebenarnya tidak akan muncul terpisah seperti dicontohkan gambar terakhir dibawah

source: This plug-in is by far one of the most useful tools for editing (digitizing). Install it as with any other plugin. It will appear as an icon on the left hand toolbar. The functionality of this tool is explained here:
id: Sejauh ini merupakan tool tambahan yang paling berguna untuk editing (digitasi). Instal dengan beberapa plugin lain. Itu akan muncul dengan ikon di sebelah kiri toolbar. Fungsi dari alat ini akan dijelaskan:

source: The :guilabel:`Building Tool` allows you to create shapes with 90 degree corners with just three clicks. First, you trace the edge of your building and then you drag out the line to make it a polygon.
id: :guilabel:`Building Tool` dapat membantu anda untuk membuat persegi dengan sudut 90 derajat hanya dengan tiga kali klik. Pertama, anda digit bagian pojok bangunan anda, kemudian anda geser untuk menjadikannya sebuah poligon.

source: You can also create more complicated buildings by using the merge option. Create your building outline, select all of the polygons (press :kbd:`SHIFT` to highlight them all) and then hit :kbd:`SHIFT + J` to merge the objects.
id: Anda juga dapat membuat bangunan yang rumit dengan menggunakan pilihan merge . Buatlah garis bangunan anda, kemudian pilih semua poligon (tahan :kbd:`SHIFT` untuk memilih semua poligon) kemudian tekan :kbd:`SHIFT + J` untuk menggabungkan seluruh objek.

source: **Utilsplugin2 (More Tools)**
id: **Utilsplugin2 (Alat Tambahan):**

source: The plugin utilsplugin2 has several features that are also useful for editing.
id: Tool utilsplugin2 tambahan ini memiliki beberapa fitur yang mungkin berguna untuk editing.

source: After you install this plugin, a new menu will appear called :menuselection:`More Tools`
id: Setelah anda me-restart JOSM, anda akan mendapati sebuah tab bernama :menuselection:`Alat Tambahan`:

source: The following tools are generally the most useful:
id: Tool-tool ini telah terbukti paling berguna:

source: **Add Nodes at Intersections:** This tool is very helpful for adding missing nodes in intersections of selected ways. It is good practice that roads and rivers should always have common nodes where they intersect.
id: **Tambah Node/Titik di Persimpangan:** Tool ini sangat berguna untuk menambah titik yang hilang pada perpotongan jalur yang terpilih. Memiliki node pada perpotongan akan membuatnya semakin mudah untuk mengedit perpotongan.

source: **Copy Tags from Previous Selection:** This function makes copying tags easier. If you want to create many objects with the same tags, first draw the objects. Then add the tags to one object. Click on another object and press :kbd:`Shift + R` to copy the tags from the previously selected object. You can do this for all objects that you want to tag. Remember that the tags will be copied from the previously selected object, so if you click on an untagged object and then another untagged object, you will not be able to copy any tags.
id: **Salin tag dari pilihan sebelumnya:** Fungsi ini dapat menyalin tag dari objek yang sebelumnya telah terpilih pada satu objek baru yang dipilih. Tool ini mengingat tag mana saja yang dimiliki pada objek terakhir yang dipilih, dan menyalinnya pada pilihan objek selanjutnya. Jadi, untuk menyalin tag dari satu objek ke objek lainnya, anda tidak perlu menekan dua tombol cepat – tapi pilih satu objek, kemudian pilih objek yang diingankan dan tekan :kbd:`Shift+R`.

source: **Add Source Tag:** This tool simplifies adding a source tag. It remembers the source that was specified last and adds it as remembered source tag to your objects. You can insert the source with just one click.
id: **Tambahkan Tag Sumber:** Tool ini menambahkan tag sumber. Itu mengingatkan pada sumber yang spesifik dan menambahkan tag sumber pada objek. Anda dapat memasukkan sumber dengan satu kali klik.

source: **Replace Geometry:** This tool is great if you want to redraw a poorly shaped object, but want to keep the history, attributes and ID number of that object. For example, if you come across a building that is complicated and drawn in a poor fashion, then instead of painfully changing each node, you can (2) just draw the object again (3) select the old and new object (4) press :guilabel:`Replace Geometry` to transfer all the information over.
id: **Ganti Geometri:** Alat ini berguna jika anda ingin menggambar kembali objek yang tidak tergambar dengan baik, akan tetapi anda ingin untuk tetap menyimpan history, attribut, dan nomor ID dari objek tersebut. Contohnya adalah jika anda menemukan objek bangunan yang sangat rumit yang tergambar dengan tidak baik, daripada anda memindahkan titik satu persatu pada setiap sudutnya, anda bisa (2) gambar objek tersebut kembali (3) pilih objek baru dan objek lama (4) Klik :guilabel:`Ganti Geometri` untuk memindahkan semua informasi termasuk history, atrribut, dan nomor ID dari objek yang lama.

source: Utilsplugin2 also provides a new selection menu that provides more tools:
id: Utilsplugin2 Juga menyediakan menu seleksi baru yang memberikan alat tambahan:

source: These tools have proved to be the most useful:
id: Tool-tool yang dinilai paling berguna:

source: **Unselect Nodes:** This tool allows you deselect nodes, which makes it useful for tagging the objects selected. This tool is necessary if you have mapped several polygon objects with similar attributes and would like to tag the objects without tagging the nodes. To do so, select all of the objects
id: **Membatalkan pilihan titik:** Anda dapat membatalkan pilihan dari titik-titik pada jalur atau objek yang telah dipilih dimana akan sangat berguna untuk memberikan tag pada objek yang anda pilih. Tool ini sangat penting jika anda telah memetakan beberapa poligon dengan atribut yang sama dan anda ingin memasukan tag yang sama tanpa memberikan tag pada titik. Untuk itu, pilih seluruh objek

source: -- polygons, ways and relations -- unselect the nodes and tag appropriately.
id: —poligon, garis dan relasi—kemudian pilih Membatalkan Pilihan Titik dan berikan tag yang sesuai.

source: **Select Last Modified Nodes:** This tool permits you to go back to the nodes that you most recently changed. It is like undo: node style.
id: **Pilih node/titik yang terakhir dimodifikasi:** Tool ini memperbolehkan anda untuk kembali pada titik yang baru saja anda ubah. Itu seperti mengembalikan seperti semula: model titik.

source: **2. Relations**
id: **2. Relasi**

source: In the first unit we learned that there are three types of objects that can be drawn in OpenStreetMap - points (nodes), lines (ways), and polygons. Lines contain numerous points, and the line itself carries the attributes that define what it represents. Polygons are the same as lines, except that the the line must finish where it begins in order to form a shape.
id: Pada Panduan Pemula kita telah mempelajari bahwa terdapat tiga objek yang dapat digambar dalam OpenStreetMap – titik (node), garis (ways), dan poligon. Garis terdiri dari sejumlah titik, dan garis itu sendiri membawa beberapa atribut yang mendefinisikan objek tersebut di lapangan. Poligon sama seperti garis, kecuali garis tersebut harus menutup pada titik awalnya untuk membentuk suatu bentukan.

source: In fact, there is one other type of object in OpenStreetMap, and these are called relations. In the same way that a line consists of other points, a relation contains a group of other objects, be they points, lines, or polygons. If you are looking to obtain advanced editing skills, then understanding and knowing how to properly edit relations is important.
id: Faktanya adalah, terdapat salah satu tipe di OpenStreetMap yang disebut relasi. Sama halnya dengan garis yang terdiri dari titik-titik, sebuah relasi mengandung beberapa kelompok dari objek lain, mereka bias berupa titik-titik, garis-garis, atau poligon-poligon. Jika anda ingin meningkatkan kemampuan editing anda lebih lanjut, maka memahami dan mengetahui bagaimana untuk mengedit suatu relasi sangat penting.

source: For example, imagine that you want to map a building that has courtyards in the center. You would need to draw a polygon around the outside of the building, and you would want a other polygons around the courtyards to indicate that they are not part of the building. This is an example of a relation. The relation would contain several polygons - and the attributes of the building would be attached to the relation, not the polygons.
id: Sebagai contohnya, bayangkan anda ingin memetakan sebuah bangunan yang memiliki halaman di tengahnya. Anda perlu menggambar sebuah poligon dari bangunannya, dan anda mungkin ingin menambahkan poligon di sekitar halaman bangunan tetapi mengindikasikan poligon tersebut bukanlah bangian dari bangunan. Ini merupakan salah satu contoh relasi. Relasi dapat mengandung beberapa poligon- dan atribut dari bangunan dapat dilampirkan pada relasinya, bukan pada poligon.

source: Relations are used to represent anything that requires a collection of objects to define. Other examples are bus routes (a collections of lines), long and complex objects (rivers or roads), or multiple polygons that are all part of one location (like buildings in a university).
id: Relasi digunakan untuk menggambarkan apapun yang membutuhkan sekelompok dari suatu objek untuk didefinisikan. Contoh lain adalah rute bus (sekelompok garis), objek yang panjang dan kompleks (sungai atau jalan raya), atau beberapa poligon yang merupakan bagian dari suatu lokasi (seperti bangunan di sebuah universitas).

source: There are mainly four types of relations you will encounter in OSM: **Multipolygons, Routes, Boundaries and Restrictions** (such as, no left turns). In this section we will go over Multipolygons and Routes.
id: Terdapat empat tipe relasi yang akan anda temukan di OSM: **Multipoligon, Rute, Batas Wilayah dan Larangan** (misalnya, tidak boleh belok kiri langsung). Pada bagian ini, kita akan membahas Multipoligon dan Rute.

source: *2.1 Editing Relations*
id: *2.1 Mengedit Relasi*

source: The multipolygon above contains a polygon for the outer limits of the building and two more to mark the inner courtyards. To create a relation from these three polygons you need to:
id: Multipoligon berikut ini memiliki sebuah poligon untuk luar bangunan dan dua poligon lagi untuk menandai halaman di bagian dalam. Untuk membuat relasi dari ketiga tipe poligon ini anda butuh:

source: Select all of the polygons.
id: Memilih seluruh poligon

source: Go to :menuselection:`Tools ‣ Create multipolygon`
id: Pergi ke :menuselection:`Alat ‣ Buat Multipoligon`

source: The polygons should automatically be created as a multi-polygon.
id: Poligon harusnya sudah dibuat sebagai multipoligon secara otomatis.

source: You will then see your building as a a solid shape with the inner polygons represented with gaps. The data behind the relation in this example is visible on OpenStreetMap: You can see this multipologyon on OSM by going to http://www.openstreetmap.org/browse/relation/2435797. It will appear on OpenStreetMap like this:
id: Anda akan melihat bangunan anda sebagai bentuk yang solid dengan poligon bagian dalam yang direpresentasikan dengan lubang. Data di balik relasi ini terlihat dalam OpenStreetMap: http://www.openstreetmap.org/browse/relation/2435797. Bangunan ini diproses oleh Mapnik seperti pada gambar berikut:

source: *2.2 Another MultiPolygon*
id: *2.2 Contoh Multipoligon Lainnya*

source: This river is another example of a multiploygon. Effectively it is the same as the building example, but with a greater number of members and covering a much larger area. It can be viewed on the OpenStreetMap site here: http://www.openstreetmap.org/browse/relation/1046961.
id: Sungai ini merupakan salah satu contoh lain dari sebuah multipoligon. Pada dasarnya sama saja seperti contoh bangunan, tetapi dengan sejumlah member dan area yang lebih besar. Contoh tersebut dapat dilihat di situs OpenStreetMap ini: http://www.openstreetmap.org/browse/relation/1046961.

source: *This river contains ten ways that are connected like a long polygon.*
id: *Sungai ini terdiri dari sepuluh garis yang dikoneksikan dengan panjang poligon.*

source: *2.3 Linestring Relations*
id: *2.3 Relasi dari Kumpulan Garis*

source: Relations are also very useful for creating, labeling and editing large linestrings; for example, bus routes, hiking trails, bicycle paths, etc. These differ from multipolygons because they are relations with members, as supposed to complex areas. A linestring could simply be one line with multiple members, these can be tagged as such. Additional features, such as bus stops represented by separate nodes can also be tagged as relation members.
id: Relasi juga sangat berguna untuk membuat, memberikan teks, dan mengedit banyak linestrings/garis-garis; contoh, sebuah rute bus. Jika linestring adalah satu garis dengan beberapa anggota, linestring ini dapat diberikan tag. Fitur-fitur tambahan, seperti tempat pemberhentian bus yang dapat digambarkan oleh titik terpisah juga dapat ditag sebagai anggota dari relasi.

source: Make sure that all of the ways in which the route runs along are appropriately tagged. For example, **highway = footway**.
id: Pastikan anda yakin bahwa seluruh garis yang akan anda gambarkan sebagai rute telah diberikan tag dengan baik. Sebagai contoh, **highway= footway**.

source: Select all of the highways or ways that the bus takes. If you would only like to select certain parts of the way, then, sadly, you must divide the way into the section you would like to select. This creates more work, but you can easily do it with the :guilabel:`Split Way`tool. Once some or all of the ways are selected, click :guilabel:`Edit` in the :guilabel:`Relation` panel. The relation editing dialog will pop up.
id: Pilih seluruh jalan atau garis yang merupakan rute dari sebuah bus. Jika anda hanya ingin memilih bagian dari suatu garis tertentu, kemudian, sayangnya anda harus membagi garis-garis tersebut menjadi beberapa bagian. Ini akan menambah pekerjaan anda, tetapi anda dapat melakukannya dengan mudah yaitu memanfaatkan tool :guilabel:`Bagi Jalur`. Setelah sebagian atau seluruh garis telah dipilih, klik :guilabel:`Edit` pada panel :guilabel:`Relation`. Dialog untuk mengedit relasi akan muncul.

source: Go to the :menuselection:`Presets` Menu and down at the bottom click :menuselection:`Public Transport` and then :menuselection:`Route` or :menuselection:`Route Master`. :menuselection:`Route master` is the main route that a bus takes, while route is a variant path of the bus.
id: Pergi ke menu :menuselection:`Presets` dan sorot “Transportasi” lalu :menuselection:`Transportasi Publik` kemudian pilih :menuselection:`Route` atau :menuselection:`Route Master`. Route master merupakan rute utama yang diambil bus, sedangkan route adalah variasi jalur dari bus.

source: Fill in the corresponding information about the bus route.
id: Isilah informasi yang ada tentang rute bus tersebut.
