Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/intermediate/osm/302-quality-assurance.po
Languages: id

source: Module 2: Quality Assurance
id: Modul 2: Penjaminan Kualitas

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Use validation tools in JOSM
id: Menggunakan tool validasi pada JOSM

source: Use online validation tools
id: Menggunakan tool validasi secara online

source: Contributing to OpenStreetMap is easy to learn, but difficult to master. Everybody makes mistakes, but the system works because even when one person does something the “wrong” way, there are always other mappers ready to help and fix errors. As you map more and more, it will continue to get easier, and you will learn the “proper” way to do things. In this chapter we will take a look at the JOSM validation tool, which is an automated tool to search for errors and warnings in your data. We will also take a look at one of the online validation tools, which can aid us further in identifying mistakes on OpenStreetMap.
id: Berkontribusi di Openstreetmap merupakan hal yang mudah untuk dipelajari, namun sulit untuk dikuasai. Setiap orang dapat melakukan kesalahan, akan tetapi sebuah sistem bekerja karena ketika seseorang melakukan sebuah kesalahan, akan selalu ada orang lain yang siap membantu untuk menyelesaikan kesalahan tersebut. Seiring Anda melakukan pemetaan secara terus menerus, hal tersebut akan menjadi lebih mudah dan Anda akan mengerti cara yang tepat untuk melakukan pemetaan. Modul ini ditujukan untuk membantu Anda memberikan kontribusi yang lebih baik. Kita akan memulai dari mendiskusikan berbagai macam teknik mengedit di JOSM yang akan membuat Anda bekerja lebih baik dan mengerti kesalahan umum yang sering dibuat pada awal pemetaan. Kita akan mendiskusikan tool validasi JOSM dimana merupakan cara otomatis untuk mengecek kesalahan pada data OpenStreetMap.

source: **1. Errors and Warnings**
id: **1. Kesalahan dan Peringatan**

source: Sometimes when you go to upload your edits you get a pop-up window like this:
id: Ada kalanya ketika Anda ingin upload hasil data OpenStreetMap yang sudah dimodifikasi akan mendapatkan jendela seperti dibawah ini:

source: This is JOSM’s way of telling you that there is suspicious data and that you might want to review the errors and warnings before uploading to OSM.
id: Ini adalah cara JOSM memberitahu bahwa ada data yang salah dan harus diperbaiki atau ditinjau sebelum mengupload ke server OSM.

source: JOSM comes with a tool that does an automated analysis of possible mistakes. This is useful for finding errors that you may have overlooked. When you run the validation tool, it will return two lists of problems:
id: JOSM hadir dengan tool yang berfungsi untuk menganalisis secara otomatis kesalahan yang ada. Hal ini sangat membantu untuk menemukan kesalahan yang tidak terlihat oleh Anda. Ketika Anda menjalankan alat validasi ini, alat ini akan menghasilkan 2 jenis masalah:

source: **Errors:** These are important to fix, and therefore usually you should not ignore these. Examples of errors include duplicated objects or overlapping lines and polygons.
id: **Kesalahan:** Kesalahan penting untuk diperbaiki dan oleh karena itu Anda seharusnya tidak mengabaikan. Salah satu contoh dari error ini adalah objek yang terduplikasi atau garis dan poligon yang saling overlay.

source: **Warnings:** These are problems that are important to fix, but in some cases, they are tolerable.
id: **Peringatan:** Kesalahan jenis ini merupakan kesalahan yang penting untuk diperbaiki namun pada beberapa kasus hal tersebut bisa ditoleransi.

source: One thing to note is that if you download a large area of the map and run the validation tool, you may get a very long list of errors and warnings. This is because the validation tool works on the whole map, not only the changes that you have made. So you may see mistakes that other mappers have made, and you can fix them, or ignore them. But the validation tool gives you the opportunity to look at the mistakes one by one.
id: Satu hal yang perlu diperhatikan jika Anda mendownload area yang besar dan menjalankan tool validasi, Anda mungkin akan mendapatkan daftar kesalahan dan peringatan yang sangat panjang. Hal ini dikarenakan tool validasi ini bekerja pada seluruh peta, tidak hanya perubahan yang telah Anda buat. Sehingga Anda mungkin akan melihat kesalahan yang dibuat oleh orang lain dan Anda bisa memperbaikinya atau menghiraukannya. Akan tetapi alat validasi memberikan Anda kesempatan untuk melihat kesalahan satu persatu.

source: **2. Using the Validation Tool**
id: **2. Gunakan Tool Validasi**

source: Let’s see how to use the validation tool:
id: Mari kita lihat bagaimana cara menggunakan tool validasi:

source: In JOSM, download a section of the map. If you don’t see the :guilabel:`Validation Results` window in the right panel, click on the blue checkmark on the left to show it.
id: Pada JOSM, download satu daerah pada peta. Jika Anda tidak melihat :guilabel:`Validation Results` pada jendela di panel bagian kanan, klik pada tanda centang berwarna biru pada bagian kiri untuk memunculkannya.

source: Ensure that nothing on the map is selected. If you run the validation tool with anything selected, it will only validate what you have selected, and not the whole map. Hover your mouse in the validation window and click :guilabel:`Validation`.
id: Pastikan bahwa tidak ada bagian pada peta yang dipilih. Jika Anda menjalankan tool validasi dengan sesuatu yang dipilih, hal tersebut hanya akan memvalidasi daerah yang Anda pilih, dan tidak seluruh peta. Arahkan mouse anda pada jendela validasi dan klik :guilabel:`Validasi`.

source: The map will change and any warnings will be circled in yellow, errors in red. In the :guilabel:`Validation Results` window you will see a list of warnings and errors, if there are any.
id: Peta tersebut akan berubah dan segala macam peringatan akan terlihat berwarna kuning dan untuk kesalahan berwarna merah. Pada jendela :guilabel:`Hasil Validasi` Anda akan melihat daftar peringatan dan kesalahan, jika ada.

source: Errors should almost always be fixed. You can zoom to an error, by right clicking on it in the window and selecting :guilabel:`Zoom to Problem`. Then you can fix the mistake manually. Some errors can be automatically fixed, such as "Duplicated nodes” errors. You can click on the folder for these types of errors and click the :guilabel:`Fix` button in the window. Many errors, however, need to be corrected manually.
id: Kesalahan harus seluruhnya diperbaiki. Anda dapat memperbesar di daerah yang terdapat kesalahan dengan cara klik kanan pada kesalahan pada jendela tersebut dan kemudian pilihlah “Perbesar hingga Problem”. Setelah itu Anda bisa memperbaiki kesalahan tersebut secara manual. Beberapa kesalahan dapat diperbaiki secara otomatis, seperti “Titik yang terduplikasi”. Anda dapat melihat pada folder untuk beberapa tipe error dan memilih tombol :guilabel:`Perbaiki` pada jendela tersebut. Beberapa error membutuhkan untuk diperiksa secara manual.

source: Usually there are many more warnings than errors. By giving you a warning, JOSM is telling you that it is probably a mistake, but not always. So you will need to use your judgement to see if it is an error or not.
id: Biasanya terdapat lebih banyak Peringatan daripada Kesalahan. Dengan memberikan peringatan, JOSM memberitahukan Anda bahwa hal tersebut kemungkinan kesalahan, tapi tidak selalu. Sehingga Anda akan menggunakan keputusan Anda untuk melihat apakah hal tersebut merupakan sebuah kesalahan atau tidak.

source: If you select a warning from the list and decide that it is not a problem, click :guilabel:`Ignore` and it will be removed from the list.
id: Jika Anda memilih salah satu warning dari daftar dan memutuskan bahwa hal tersebut bukanlah masalah, klik :guilabel:`abaikan` dan warning tersebut akan di hapus dari daftar.

source: You can re-run the validation tool at any time by clicking :guilabel:`Validation`
id: Anda dapat menjalankan ulang tool validasi sewaktu-waktu dengan mengklik :guilabel:`Validation`

source: **3. Using The Tasking Manager**
id: **3. Menggunakan Tasking Manager**

source: HOT Tasking Manager, a tool that mappers can use to sort an area into a grid, and work together to map an area in an organized way. Aside from being more organized, the tasking manager is also one way to avoid conflicts, because it is impossible for more than one person editing the same area.
id: HOT Tasking Manager, sebuah tool atau media dimana pembuat peta dapat membagi sebuah daerah menjadi banyak grid, lalu dapat bekerja bersama pembuat peta lainnya untuk memetakan daerah tersebut dengan cara yang lebih terorganisir. Selain lebih terorganisir, tasking manager juga merupakan salah satu cara untuk menghindari konflik, karena tidak memungkinkan lebih dari satu orang memetakan satu area yang sama.

source: One consistent challenge is coordinating field and/or remote workers to map an area together. To help address this, HOT has developed an OpenStreetMap Tasking Tool to make it easier for administrators to define the areas of mapping interest and to delegate workers. The idea behind this tool is that if there is an area, let’s say a city, that we want to map, and we have some people mapping on the ground, and some people mapping remotely using satellite imagery, this tool will allow us to create a grid of the entire area. Collaborators can select blocks in the grid that they plan to map, and when they finish, they can mark that area as complete. In this way a team of many people can coordinate to map the entire grid.
id: Satu tantangan utama adalah ketika harus mengkoordinasikan para pembuat peta dari berbagai area untuk bekerja membuat peta bersama-sama untuk satu daerah. Untuk membantu memecahkan permasalahan ini, HOT telah mengembangkan sebuah tool tasking/pekerjaan OpenStreetMap untuk mempermudah administrator untuk menentukan area yang perlu dipetakan dan untuk mendelegasikan pembuat peta. Ide dibalik perangkat ini adalah apabila ada suatu area, misalnya sebuah kota, yang ingin kita petakan, dan sudah ada beberapa orang yang melakukan pemetaan di area tersebut, dan beberapa orang yang memetakannya dari jarak jauh menggunakan citra satelit, perangkat ini dapat membuat sebuah grid untuk area tersebut. Para pelaku pemetaan di area tersebut dapat memilih sebuah kotak pada grid yang ingin dipetakan, dan ketika mereka selesai memetakannya, mereka dapat menandai kotak tersebut sebagai komplit atau sudah selesai dipetakan. Dengan cara ini, sebuah tim yang berisi banyak orang yang tersebar di berbagai daerah dapat berkoordinasi bersama untuk menyelesaikan pemetaan pada grid tersebut.

source: To see how the tasking manager works, let’s take a closer look.
id: Untuk melihat bagaimana tasking manager bekerja, marilah kita lihat lebih dekat.

source: Open your Internet browser and go to tasks.hotosm.org. You will see a page like this:
id: Buka lah browser internet Anda dan buka situs tasks.hotosm.org. Anda akan melihat sebuah halaman seperti ini:

source: Click :guilabel:`Log in using your OpenStreetMap account` Here you are agreeing to allow this application some access to your OpenStreetMap account. Click :guilabel:`Save Changes`.
id: Klik :guilabel:`Log in using your OpenStreetMap account`. Dengan melakukan klik pada tombol tersebut, berarti Anda setuju aplikasi ini mengakses akun OpenStreetMap Anda. Klik :guilabel:`Save Changes`.

source: Now you will see the current list of projects. These are different places that people are coordinating to map.
id: Sekarang Anda akan melihat sebuah daftar berisi proyek-proyek yang sedang ada saat ini. Pada daftar tersebut berisi proyek-proyek dari negara-negara berbeda dimana mereka melakukan koordinasi untuk melakukan pemetaan.

source: Click on one of the projects to see more information about it.
id: Klik pada salah satu proyek untuk melihat informasi lebih lanjut.

source: This page shows you everything you need to know about the project. On the left side of the page is a description of the mapping project and how it is being organized. You can click on the different tabs to get more information. On the right side is a grid showing the area to be mapped. Red grid squares have been completed, green squares have been completed and checked by another person, and the remaining squares still need to be mapped or are being worked on. By clicking on the “Workflow” tab, you can get information about how collaborators are meant to help map. By clicking on :guilabel:`Task` you can take a grid square to work on yourself.
id: Halaman ini menunjukkan semua hal yang Anda perlu ketahui mengenai proyek tersebut. Pada sebelah sisi kiri halaman adalah sebuah deskripsi dari proyek pemetaan tersebut dan bagaimana mengaturnya. Anda dapat klik pada tab-tab yang ada untuk melihat informasi tebih lanjut. Pada sisi kanan terdapat sebuah grid yang menunjukkan area yang sedang dipetakan. Kotak grid yang berwarna merah telah selesai dipetakan, kotak berwarna hijau telah selesai dipetakan dan telah dilakukan pengecekan oleh orang lain dan divalidasi datanya, kotak dengan pinggiran berwarna kuning berarti sedang ada orang lain yang mengerjakan peta pada area tersebut, sedangkan kotak kosong lainnya belum ada atau belum selesai dipetakan. Anda dapat klik pada tab “Workflow”, disitu Anda akan mendapat informasi atau instruksi mengenai bagaimana Anda dapat membantu melakukan pemetaan pada area tersebut. Dengan melakukan klik pada :guilabel:`Task` Anda dapat mengambil sebuah kotak grid untuk Anda kerjakan.

source: Here you see a view of the square that you have offered to map. You can automatically open the area up for editing with JOSM, Potlatch 2, or create a Walking Paper. If you plan to edit with JOSM, you need to enable a JOSM plugin before you will be able to launch the application from the Tasking Manager. To do this, open JOSM and go the :menuselection:`Preferences` menu. Click on the :guilabel:`Remote Settings` tab and check the box next to :guilabel:`Enable remote control`. Restart JOSM.
id: Disini Anda dapat melihat sebuah kotak yang Anda inginkan untuk dipetakan. Anda dapat membuka area tersebut secara otomatis untuk diedit menggunakan JOSM, Potlatch 2, atau membuat Walking Paper. Jika Anda berencana untuk mengedit menggunakan JOSM, Anda perlu mengaktifkan sebuah plugin pada JOSM sehingga nantinya Anda dapat langsung membuka area dari Tasking Manager ke JOSM. Untuk melakukan ini, bukalah JOSM dan buka menu :menuselection:`Preferences` . Klik pada tab :guilabel:`Remote Settings` dan ceklis pada kotak di samping :guilabel:`Enable remote control`. Restart JOSM. Lalu tutuplah JOSM dan buka kembali.

source: Go back to the Tasking Manager and choose JOSM. If you have JOSM open and you correctly enabled the remote control, the grid area of the map you selected will automatically be loaded into JOSM.
id: Kembali ke Tasking Manager dan pilih JOSM. Jika Anda telah membuka JOSM dan Anda telah mengaktifkan remote control dengan benar, area pada grid yang Anda ingin edit akan muncul dengan otomatis pada JOSM.

source: You may now edit the area using the instructions provided in the project information. When you are finished, you can return to the tasking manager website and add comments about your changes. Click :guilabel:`Mark task as done` to let other collaborators know that you have finished this grid square. If you were unable to complete the task, click :guilabel:`Unlock it` to make it available again for other mappers.
id: Sekarang Anda dapat mengedit area tersebut menggunakan instruksi yang tersedia pada informasi proyek. Ketika Anda selesai melakukan editing dan menguploadnya, Anda dapat kembali ke tasking manager dan menambahkan komentar mengenai perubahan yang Anda buat. Klik :guilabel:`Mark task as done` agar pembuat peta lainnya tahu bahwa Anda telah menyelesaikan kotak grid tersebut. Jika Anda tidak dapat menyelesaikan kotak tersebut, klik :guilabel:`Unlock it` sehingga kotak tersebut dapat dikerjakan oleh pembuat peta lainnya.

source: If you are wondering what happens when you finish an area, the grid square will turn red on the map to indicate that is done. Someone else will then look at your work to make sure it is good, and if they agree that you’ve completed the square well, the grid square will turn green, meaning it is complete!
id: Jika Anda bertanya-tanya apa yang terjadi bila Anda telah menyelesaikan suatu area, grid tersebut akan berubah menjadi warna merah yang menandakan area pada grid tersebut telah selesai dipetakan. Orang lain akan memeriksa hasil pekerjaan Anda dan memastikan hasilnya baik dan sesuai harapan, apabila sesuai, grid tersebut akan berubah menjadi warna hijau, artinya telah benar-benar selesai!

source: **4. Editing Tips**
id: **4. Tips Editing**

source: In this section we will go over some common mistakes in JOSM and provide some editing tips for making your maps great!
id: Pada bagian ini, kita akan menjelaskan beberapa kesalahan umum di JOSM dan menyediakan beberapa tips mengedit untuk membuat peta anda menjadi lebih baik!

source: **Some Objects Should Not Connect**
id: **Beberapa Objek Sebaiknya Tidak Saling Terhubung**

source: When you are creating polygons and lines that are not supposed to be connected, make sure that they are not merged together by sharing a node. For example, highway nodes should not be snapped to buildings, because no one likes a road that leads directly into a wall! If you want to disentangle two or more obejcts that share the same node, select the node and press :kbd:`G`.
id: Ketika anda membuat poligon dan garis, mereka sebaiknya tidak saling terhubung, pastikan mereka tidak terhubung oleh satu titik. Sebagai contoh, titik jalan raya sebaiknya tidak menempel pada bangunan, karena tidak ada jalan yang menempel pada sebuah dinding! JIka Anda ingin memisahkan dua atau lebih objek yang saling berbagi node yang sama, pilih node dan klik :kbd:`G`.

source: **But, Some Objects Should Connect**
id: **Tetapi, Beberapa Objek Harus Terhubung**

source: However, some objects SHOULD connect! Road intersections should always be snapped together. If two roads do not share a common node, then the computer has no way of knowing that the roads actually connect to each other.
id: Bagaimanapun, beberapa objek HARUS terhubung! Persimpangan jalan harus selalu terhubung. Jika dua jalan tidak terhubung pada satu titik, maka komputer tidak akan mengetahui bahwa jalan tersebut sebenarnya saling terhubung satu sama lain.

source: **Overlapping Objects**
id: **Objek-Objek yang Saling Overlay**

source: A common error is to have overlapping polygons when the objects they represent do not overlap in real life. A building cannot overlap another building. This mistake is commonly made with buildings and landuse polygons. For example, a polygon drawn to represent a park outside a building should not overlap with the building. Instead it should be drawn next to the building. There are some exceptions to this rule, such as schools. Within a school yard you might identify individual buildings using polygons, yet you also might want to create a polygon around the entire school yard. In this case it is fine for the polygons to overlap, but the rule to follow here is to make sure that the buildings are completely inside the landuse polygon.
id: Salah satu kesalahan umum adalah poligon yang saling overlay ketika objek yang digambarkan tidak bertumpukan di keadaan sebenarnya. Sebuah bangunan tidak dapat bertumpukan bangunan lainnya. Kesalahan ini umumnya terjadi dengan poligon bangunan dan poligon penggunaan tanah. Sebagai contoh, sebuah poligon yang dibangun untuk menggambarkan taman diluar bangunan sebaaiknya tidak saling bertumpukan dengan bangunannya. Seharusnya digambar di sebelah bangunannya. Terdapat beberapa pengecualian pada aturan ini, misalnya sekolah. Di dalam halaman sekolah mungkin Anda ingin mengidentifikasi setiap bangunan menggunakan poligon, tetapi mungkin Anda juga ingin membuat sebuah poligon yang meliputi seluruh halaman sekolah. Dalam kasus seperti ini, poligon diperbolehkan untuk saling overlap, tetapi aturannya adalah pastikan bahwa bangunan-bangunan secara menyeluruh berada dalam poligon penggunaan lahan.

source: We all make mistakes, and as you map more you will make less mistakes! Just remember that even if you upload data that contains mistakes, it is simple to fix your mistakes and upload the change again. This is what is great about OSM, you can always make it better!
id: Kita semua membuat kesalahan, dan jika Anda memetakan lebih banyak maka kesalahan akan semakin berkurang! Hanya ingat, jika Anda mengupload data yang memiliki kesalahan, cara mudahnya adalah Anda hanya memperbaiki kesalahan tersebut dan mengupload kembali perubahannya. Di sinilah hebatnya OSM, Anda dapat selalu membuatnya lebih baik!

source: **Tracing Correctly**
id: **Mendigitasi dengan Benar**

source: OSM can do amazing things with identifying where objects end and what labels these objects should have; however, it needs your help in doing so. For example, if you create a road that turns into another road without a distinct node, then JOSM will continue labeling the road as the previous one. Therefore, it is necessary that you make all of your roads and objects as clearly and rigid as possible.
id: OSM dapat melakukan hal yang luar biasa dengan mengidentifikasi dimana objek berakhir dan bagaimana tulisan akan muncul pada objek tersebut; bagaimanapun, OSM membutuhkan bantuan Anda. Sebagai contoh, jika Anda membuat sebuah jalan yang berbelok ke jalan lain tanpa sebuah node/titik, maka JOSM akan melanjutkan pemberian nama jalan sebagaimana jalan sebelumnya. Oleh karena itu, sangat penting untuk membuat jalan dan objek Anda digambar sejelas mungkin.

source: We will conclude this section with additional tips: Rotate object: If you hold :kbd:`CTRL + SHIFT` and hold while sliding your mouse, then you can rotate the selected object.
id: Kami akan mengakhiri bagian ini dengan tambahan tips: Memutar objek: Jika Anda menahan :kbd:`CTRL + SHIFT` dan menahan sambil menggeser mouse Anda, maka Anda dapat memutar objek yang dipilih.

source: **Ways that are not closed**: usually a line that does not form a polygon. Common examples are buildings where the first node does not meet the last node.
id: **Way/Jalan yang tidak tertutup**. Merupakan peringatan dikarenakan jalur tidak tertutup, biasanya terbentuk dari garis yang tidak membentuk sebuah poligon. Contoh umumnya adalah gedung dimana titik pertama tidak bertemu dengan titik akhir.

source: To fix this, select both nodes and go to :menuselection:`Tools -> Merge Nodes` to connect them.
id: Untuk menyelesaikan masalah ini, pilih kedua titik dan pilih :menuselection:`Tools -> Merge Nodes` untuk menyambung kedua titik tersebut.

source: **Crossing Buildings (Overlapping Buildings)**: buildings that overlap each other.
id: **Bangunan yang bertampalan (Overlapping Buildings)**: gedung yang saling overlay satu sama lain.

source: To fix this, move the nodes of one of the buildings outside of the other building.
id: Untuk menyelesaikan masalah ini, gerakkan titik dari salah satu gedung ke arah luar dari gedung lain.

source: **Untagged Nodes or Ways**: If someone draws a point or a line but forgets to give it any tags, then it is useless, because it does not mean anything.
id: **Node/titik atau way/jalan yang belum memiliki tag** - Jika seseorang menggambar titik atau garis tetapi lupa untuk memberikan beberapa tag, kemudian titik atau garis yang digambar menjadi tidak berguna, karena itu tidak memiliki arti.

source: To fix this, apply tags to the object to identify it, or delete it if it is a mistake.
id: Untuk menyelesaikan ini, pilih objek yang tidak mempunyai tag dan masukkan presets yang sesuai, atau hapus itu jika merupakan kesalahan.
