Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/intermediate/osm/302-quality-assurance.po
Languages: id

source: **End node near another way**: If a line ends very close to another line but does not connect, this raises a warning.
id: **Ujung *node* terletak dekat dengan garis lain**: Jika sebuah garis berujung sangat dekat dengan garis lainnya namun tidak terhubung satu sama lain, maka akan menimbulkan peringatan.

source: Many times this warning is not important, but it helps to find road intersections that are supposed to connect but do not.
id: Seringkali peringatan ini tidak terlalu penting, namun cukup membantu bila kita ingin mencari persimpangan jalan yang seharusnya terhubung namun tidak terhubung.

source: **Crossing ways**: Lines that cross other lines without being connected will raise warnings. Many times this is not a problem, because the crossing ways are intentional - such as in the case of bridges, or streets and rivers that cross landuse polygons. It is sometimes helpful, however to find errors.
id: **Garis yang bersimpangan/berpotongan**: Merupakan peringatan yang muncul akibat jalur berpotongan. Sebuah garis yang berpotongan dengan garis lain tanpa tersambung dapat memunculkan warnings. Hal ini juga bisa saja tidak menjadi masalah, karena jalur yang berpotongan bisa saja disengaja, seperti pada kasus jembatan, atau jalan dan sungai yang berpotongan dengan poligon landuse. Hal ini terkadang membantu, untuk menemukan error.

source: OpenStreetMap depends on people correcting and editing mistakes. Editing and validating data is important for improving maps. If you do not have time to get in the field with a GPS or trace imagery, validating objects and attribute data is a good way to contribute.
id: OpenStreetMap bergantung pada orang yang memperbaiki dan mengedit kesalahan. Editing dan validasi data penting untuk meningkatkan peta. Jika Anda tidak mendapatkan cukup waktu untuk survei ke lapangan dengan GPS atau mendigitasi citra, validasi objek dan atribut data merupakan cara terbaik untuk berkontribusi.

source: **5. Presets Standardization**
id: **5. Standardisasi Preset**

source: OpenStreetMap allows the users to give as much informations as they can to their map. These informations can be attached to every objects that they mapped using presets menu that is available in OSM editor. Many times we found inconsistency in some objects information. That’s why we should make a presets standardisation.
id: OpenStreetMap memperbolehkan seluruh penggunanya untuk memberikan informasi sebanyak-banyaknya mengenai peta mereka. Informasi ini dapat dicantumkan pada tiap objek yang dipetakan menggunakan menu presets yang tersedia pada editor OSM. Kita seringkali menemukan ketidakkonsistenan dalam pemberian informasi pada berbagai objek. Oleh karena itulah dibuat standardisasi presets.

source: The presets standardization purposes are:
id: Standardisasi presets ini dibuat dengan tujuan:

source: Assuring data consistency and stability
id: Menjamin stabilitas konsistensi data

source: Easier data search and analysis
id: Memudahkan pencarian dan pengolahan data

source: As a standard in giving information using presets
id: Sebagai patokan dalam pemberian informasi melalui preset

source: As a benchmark if we want to make improvements or data validation
id: Sebagai acuan apabila ingin melakukan perbaikan atau validasi data

source: Maximizing the use of Internal Presets that are available in JOSM
id: Memaksimalkan penggunaan Internal Presets yang sudah ada di JOSM

source: Maximizing data visualisation on OpenStreetMap website
id: Memaksimalkan visualisasi data pada situs OpenStreetMap

source: With this preset standardisation, hopefully all OSM users are willing to use this preset when they edit their maps. One of the benefit if we use the internal preset that is available in JOSM is the visualisation will show up on OpenStreetMap website. You can find the list of these standard presets **here**
id: Dengan adanya standardisasi preset ini, diharapkan seluruh pengguna OSM mau menggunakan standar ini ketika melakukan editing. Salah satu keuntungan menggunakan internal preset yang sudah tersedia pada JOSM adalah nantinya visualisasi objek tersebut akan muncul pada situs OpenStreetMap. Anda dapat menemukan daftar standar presets *disini*

source: The Keep Right website is another useful validation tool for OpenStreetMap. Open your web browser and head to http://keepright.at.
id: KeepRight merupakan situs yang melakukan pengecekan/pemeriksaan kesalahan-kesalahan penggambaran pada peta OpenStreetMap. Kesalahan-kesalahan ini ditunjukkan dalam simbol petir berwarna-warni, yang mana setiap warna menunjukkan jenis-jenis kesalahan yang berbeda. Bekerja dengan “ www.keepright.ipax.at ”

source: You can switch the site into Indonesian by choosing :guilabel:`id` from the dropdown box in the in the upper right.
id: Jika Anda baru pertama kali membuka situs ini, maka situs ini akan berbahasa Indonesia. Jika Anda ingin agar situs ini berbahasa Indonesia, klik pada pojok kanan atas, dan pilihlah :guilabel:`id`.

source: Click on “Pengecekan data untuk Asia” to check the OSM data in Asia. This will open up a slippy map with errors displayed on it. You can navigate to your area of interest by using the zoom and pan functions.
id: Klik pada "Pengecekan data untuk Asia" untuk pengecekan data Asia. Ini akan terbuka pada tampilan peta dengan gambaran kesalahan diatasnya. Anda dapat menavigasikan ke area yang Anda inginkan dengan menggunakan perbesaran dan fungsi tanda panah.

source: The types of errors are listed on the left of the map. You can get more details about each error by clicking on the icons which hover above the map.
id: Jenis dari kesalahan terdiri dari daftar yang terletak disebelah kiri dari peta. Anda akan mendapatkan lebih detail setiap kesalahan dengan klik pada ikon yang terdapat di peta.

source: After you find territory and find out his mistake. Certainly next step is to fix the error. First step, make sure you have selected an error/lightning (by left click on the lightning image). After that, determine where you would fix the error, whether on the "JOSM" or "Potlatch".
id: Setelah Anda menemukan wilayah Anda dan mengetahui kesalahannya, tentu langkah selanjutnya adalah memperbaiki kesalahan tersebut. Pertama-tama, pastikan Anda telah memilih satu kesalahan/petir (dengan cara klik kiri pada gambar petir tersebut). Setelah itu, tentukan di mana Anda akan memperbaiki kesalahan tersebut, apakah pada “JOSM” atau “Potlatch”.

source: we recommend that the editing in JOSM, because its editing features are more complete.
id: kami menyarankan agar editing dilakukan pada JOSM, karena fitur editing nya lebih lengkap.

source: In order to fix one of the errors, you can click on the links to edit in either JOSM or Potlatch. Note that to edit in JOSM you must have the JOSM Remote Control enabled.
id: Untuk memperbaiki salah satu dari kesalahan tersebut, Anda dapat klik pada link untuk mengedit baik pada JOSM atau Potlatch. Harap dicatat bahwa pastikan JOSM Anda telah terbuka dan aktifkan Remote Control JOSM.

source: Setting “Remote Control” JOSM
id: Pengaturan "Remote Control" JOSM

source: Before you start working with "Keepright", make sure you have enabled "Remote Control" in JOSM. To check this, open your JOSM, then select the menu :menuselection:`Edit > Preferences`. Once the window :guilabel:`Preferences` appears, select the tab :guilabel:`Remote Control`
id: Sebelum Anda mulai bekerja dengan "Keepright", pastikan Anda mengaktifkan "Remote Control" pada JOSM. Untuk memeriksa ini, buka JOSM Anda, kemudian pilih menu :menuselection:`Edit > Preferences. Setelah jendela :guilabel:`Preferences` muncul, pilih tab :guilabel:`Remote Control`

source: Next, you will see the window like this
id: Selanjutnya, Anda akan melihat jendela seperti ini

source: *image (a)*
id: *gambar (a)*

source: *image (b)*
id: *gambar (b)*

source: Check box in the left of :guilabel:`Enable Remote Control` is checked/enabled. In Image (a) the :guilabel:`Enable Remote Control` is not activated. If not, please checklist the box, such as Image (b). Click :guilabel:`OK` and Restart JOSM. Furthermore, you can work with "www.keepright.ipax.at".
id: Kotak centang di sebelah kiri :guilabel:`Enable Remote Control` telah dicentang/diaktifkan. Pada gambar (a) :guilabel:`Enable Remote Control` belum diaktifkan. Jika belum, silakan centang kotak, seperti gambar (b). Klik :guilabel:`OK` dan Restart JOSM. Selanjutnya Anda dapat bekerja dengan "www.keepright.ipax.at".

source: Now, open JOSM you will see that JOSM now been content with data that we have chosen earlier on the site "KeepRright".
id: Sekarang, buka JOSM dan Anda akan melihat bahwa pada JOSM telah ada tampilan data yang kita pilih sebelumnya di situs "KeepRight".

source: Make sure JOSM is open
id: Pastikan JOSM terbuka

source: Now OSM data from “KeepRight” delivered to your JOSM
id: Sekarang data OSM dari "KeepRight" telah dikirim ke JOSM Anda

source: Immediately fix to existing errors. How do I fix and what tools are needed to fix it??? It all depends on the type of error. If you forget, go back material on "Advanced Editing" and "Quality Assurance"
id: Segera perbaiki kesalahan yang ada. Bagaimana cara memperbaiki dan alat apa yang dibutuhkan untuk memperbaikinya??? Itu semua tergantung pada jenis kesalahan. Jika Anda lupa, kembali ke materi "Advanced Editing" dan "Quality Assurance"

source: After fixed the error, return to website "www.keepright.ipax.at" to confirm error has been fixed or not. If you've fixed the error, select (by left- clicking) on the top radio button option.
id: Setelah kesalahan diperbaiki, kembali ke situs “www.keepright.ipax.at” untuk mengkonfirmasi apakah kesalahan telah diperbaiki atau belum. Jika kesalahan telah Anda perbaiki, pilih (dengan cara klik kiri) pada pilihan radio button paling atas.
