Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/intermediate/osm/305-using-private-data-store.po
Languages: id

source: Module 5: Using Private Data Store
id: Modul 5: Menggunakan *Private Data Store*

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Understand the functions of the SDS
id: Memahami fungsi dari SDS

source: Understand what data should be kept publicly and what needs to be private
id: Memahami data apa yang bisa dipublikasikan dan mana yang sebaiknya tidak (data pribadi)

source: Install SDS plugin in JOSM
id: Menginstal Plugin SDS di JOSM

source: Use SDS presets
id: Menggunakan Preset SDS

source: Use SDS plugin for selecting public and private data
id: Menggunakan plugin SDS untuk memilih data publik dan data pribadi

source: Access online datastore
id: Mengakses datastore secara online

source: OpenStreetMap data is open and available to anyone who would like to access it. However, there may be times when you want to use OpenStreetMap to collect data, but you would like to keep some attributes stored in a private database. For this, HOT has developed an additional tool for JOSM known as the SDS (Separate Data Store). The SDS allows you to create maps and add data into JOSM the same as always, but when you upload your edits, public data will be saved to the OpenStreetMap database, and private data will be saved separately to the HOT Datastore.
id: Data OpenStreetMap bersifat terbuka dan tersedia untuk siapa saja yang ingin mengaksesnya. Akan tetapi ada saat tertentu ketika anda ingin menggunakan OpenStreetMap untuk mengumpulkan data tapi anda ingin menyimpan beberapa atribut sebagai data pribadi anda. Untuk memfasilitasi hal ini, HOT telah mengembangkan sebuah alat bantu untuk JOSM yang disebut dengan SDS (Separate Data Store). SDS memungkinkan anda untuk membuat peta dan menambahkan data anda ke dalam JOSM sama seperti biasanya akan tetapi ketika anda mengunggah/memasukkan hasil editan anda, data yang bersifat umum akan tersimpan di database OpenStreetMap dan data pribadi anda akan disimpan terpisah di HOT Datastore.

source: *How the SDS Plugin works with JOSM*
id: *Cara Kerja Plugin SDS pada JOSM*

source: Data uploaded to the private HOT Datastore is only accessible to people who have an account at datastore.hotosm.org. This chapter is designed for people who already have an account and desire to store private geospatial information, such as household income, personal health care data, or the location of gold mines.
id: Data yang anda simpan di HOT privat datastore hanya dapat diakses oleh orang yang memiliki akun di datastore.hotosm.org. Bab ini dirancang untuk anda yang telah memiliki akun dan ingin menyimpan data-data informasi geospasial seperti pendapatan rumah tangga, kesehatan seseorang, atau lokasi tambangan emas.

source: ..Note:: If you do not have a HOT Datastore account or if you want to set up
id: .. Note:: Jika Anda belum memiliki akun HOT Datastore atau Anda ingin mengatur

source: your own private datastore server please contact us (team.id[at]hotosm.org).
id: server penyimpanan data pribadi Anda mohon hubungi (team.id[at]hotosm.org).

source: **1. Installing the SDS plugin**
id: **1. Cara Menginstal Plugin SDS**

source: This plug-in allows private data to be streamlined into the private data store. The newest version of JOSM is required for the SDS plugin to run. (If you do not have a recent version of JOSM, download and install it from http://josm.openstreetmap.de/. If you cannot install the latest version, go to the Appendix to see how you can install this plug-in by source).
id: Plugin ini memungkinkan data pribadi Anda dimasukkan ke dalam ruang penyimpanan data pribadi. Versi terbaru dari JOSM akan meminta plugin SDS untuk dijalankan. (Jika Anda belum memiliki versi tebaru dari JOSM, download dan install dari http://josm.openstreetmap.de/. Jika Anda tidak dapat menginstal versi terbaru, pergi ke Appendix untuk melihat bagaimana cara menginstal plugin ini dari sumber).

source: Open the preferences menu in JOSM and go to the plugins tab.
id: Buka Menu Preferensi di JOSM dan pergi ke tab plugin.

source: Click :guilabel:`Download List` to ensure that all available plugins are listed.
id: Klik :guilabel:`Daftar Download` untuk memastikan semua plugin ada di dalam daftar.

source: In the search box, type *sds*
id: Ketik dalam kotak pencarian *sds*.

source: Check the box next to the plugin to activate it. You will need to restart JOSM.
id: Tandai kotak penanda di sebelah plugin untuk mengaktifkannya. Anda butuh me-restart JOSM anda.

source: If JOSM is open, restart it.
id: Jika JOSM terbuka sebelumnya, restart JOSM Anda.

source: **Installing SDS Plugin by Source**
id: **Cara menginstall Plugin SDS melalui sumber**

source: If you are unable to find the “sds” plugin on the Preferences menu, you may need to install it manually as described here:
id: Jika langkah diatas bekerja dengan baik/berhasil maka anda tidak perlu melakukan langkah yang akan dijelaskan berikut ini. Tetapi jika tidak menemukan plugin “sds” didalam menu Preferences, anda harus melakukan langkah manual dalam menginstall plugin sds, yaitu :

source: Download the sds plugin by going to http://kunden.geofabrik.de/03df698c95134f04949eb67ac7ba2195/ and clicking on *sds.jar*
id: Download plugin sds di website http://kunden.geofabrik.de/03df698c95134f04949eb67ac7ba2195/ dan klik di *sds.jar*

source: Click on the Start Menu and type *%APPDATA%* into the search box. Click on the folder named *Roaming*
id: Klik Start Menu dan tipe *%APPDATA%* di dalam search box. Klik folder nama *Roaming*.

source: In the window that opens, double-click on “JOSM” to open the JOSM program files.
id: Pada jendela yang terbuka, double-klik di “JOSM” untuk membuka program file JOSM.

source: Double-click on the *plugins* folder to open it. Move the *sds.jar* file into this folder.
id: Double-click folder *plugins* . Pindahkan *sds.jar* yang telah didownload ke dalam folder ini.

source: **2. Using the Plugin**
id: **2. Cara Menggunakan Plugin**

source: Editing the map works just the same as before. The only difference is that when you upload changes, some tags will be automatically saved on the private datastore, and the rest will be saved directly onto OpenStreetMap.
id: Edit peta sama seperti sebelumnya. Perbedaan yang ada adalah ketika anda ingin me-unggah perubahan yang anda lakukan, beberapa tag akan otomatis tersimpan dalam privat datastore, dan sisanya akan tersimapn langsung ke dalam OpenStreetMap.

source: After installing the plugin, the first time you download data you will be asked for your HOT datastore username and password.
id: Setelah menginstal plugin, pertama kali ketika Anda mendownload data Anda akan diminta oleh HOT datastore untuk nama pengguna dan kata sandi.

source: In order to use the plugin, you need to enter your username and password. To save them, check the box next to :guilabel:`Save user and password`.
id: Untuk menggunakan plugin anda harus memasukkan nama pengguna dan kata sadi anda. Untuk menyimpannya tandai kotak di sebelah tulisan :guilabel:`Save user and password`.

source: The private datastore is now working. When you upload changes, the usual tags will be saved to OSM, and special private tags will be saved to the datastore.
id: Privat datastore sekarang sudah berfungsi. Ketika Anda meng-*upload* perubahan yang Anda lakukan, objek dengan tag biasa akan tersimpan di OSM dan objek dengan tag khusus akan tersimpan di data store.

source: **3. How It Works**
id: **3. Bagaimana Plugin SDS Bekerja**

source: How does the plugin know which data you want to store on OpenStreetMap and which data you want to store publicly? Quite simply, it knows because of the tags. Normal tags go to OpenStreetMap, as always, but you can use new tags with a special prefix that will be sent to the private datastore. By default, any tag that begins with the prefix **“hot:”** will go to the private datastore. If you open the Preferences menu you will see a new tab on the bottom for SDS plugin options:
id: Bagaimana plugin mengetahui data mana yang ingin Anda simpan di OpenStreetMap dan data yang Anda simpan secara pribadi? Cukup sederhana, plugin SDS mengetahuinya karena ‘tag’. Tag biasa disimpan di OpenStreetMap seperti biasa, tetapi Anda dapat menggunakan tag baru dengan awalan khusus yang akan dikirim ke private datastore. Sesuai pengaturan awal, setiap tag yang dimulai dengan awalan **"hot:"** akan tersimpan ke private datastore. Jika Anda membuka menu Preferences akan terlihat tab baru di bagian bawah WMS TMS untuk pilihan Plugin SDS :

source: There are some basic settings here. By default the server URL is set to the HOT datastore, and your username and password can be saved here as well. The line labelled **“SDS tag prefix” **contains the prefix that will cause tags to be saved on the private datastore. By default it is **“hot:”**
id: Ada beberapa pengaturan dasar di sini. Sesuai pengaturan awal URL server diatur oleh datastore HOT, username dan password dapat disimpan di sini juga. Baris berlabel **"SDS tag prefix"** mengandung awalan tag yang akan disimpan pada private datastore. Sesuai pengaturan awal adalah **"hot:"**

source: When you create or edit an object on the map, you can apply tags like this:
id: Ketika anda membuat atau mengedit objek di dalam peta, anda bisa mengganti tag seperti ini :

source: In this case, the first two tags will be saved on OSM. The third tag, because it has the prefix **hot:** will be saved on the private datastore.
id: Dalam kasus ini, dua tag pertama akan disimpan pada OSM. Tag ketiga, karena memiliki awalan **hot:** akan disimpan pada private datastore.

source: You will most likely collaborate with others when using the private datastore, so you will have a standard list of tags to use for the specific data your are collecting. These tags can then be made into a presets menu, which will provide an easy-to-use form for adding both public and private data.
id: Anda kemungkinan akan berkerjasama dengan orang lain ketika menggunakan private datastore, sehingga Anda akan memiliki daftar standar dari tag yang digunakan untuk data spesifik yang Anda kumpulkan. Tag ini kemudian dapat dibuat menjadi menu preset, yang akan memberikan kemudahan untuk menambahkan data baik secara publik maupun pribadi.

source: **4. Access the Datastore Online**
id: **4. Mengakses Datastore secara Online**

source: Just like `openstreetmap.org <http://openstreetmap.org>`_ , you can access the online datastore directly, by visiting http://sds.openstreetmap.or.id and logging in with your username and password.
id: Seperti mengunjungi `openstreetmap.org <http://openstreetmap.org>`_ , anda dapat mengakses data store secara online dengan langsung mengunjungi http://sds.openstreetmap.or.id dan login dengan username dan password.

source: *4.1 Private Data Store Users*
id: *4.1 Pengguna Private Data Store*

source: There is 2 types of Data Store users. They are Admin who can add new projects or users onto SDS and Personal are regular users who joined on some project that using SDS.
id: Di dalam Private Data Store ini terdapat 2 jenis pengguna yaitu Admin yang dapat menambahkan projek ataupun pengguna ke dalam SDS ini dan Personal yaitu user biasa yang tergabung dalam projek tertentu yang menggunakan SDS.

source: This is the screenshot :
id: Berikut adalah tampilannya :

source: *4.2 Figure of Using Private Data Store and JOSM*
id: *4.2 Diagram Penggunaan Private Data Store dan JOSM*

source: *4.3 Editing Data Store Online*
id: *4.3 Mengedit Data Store secara Online*

source: You can edit your data in SDS online. These are the steps :
id: Anda dapat mengedit data di SDS secara online. Berikut Langkah-langkahnya :

source: Open this site http://sds.openstreetmap.or.id
id: Buka situs berikut http://sds.openstreetmap.or.id

source: Click :guilabel:`tag search`
id: Klik :guilabel:`tag search`

source: Add 'String' which is a name when we saved the sds tag and click search
id: Masukkan ‘String’ berupa nama pada saat kita menyimpan tag sds dan klik seach

source: You only can edit the objects attribute that has saved in JOSM but if you want to delete objects you must to use JOSM.
id: Anda hanya dapat mengedit attribut objek yang disimpan pada JOSM, tetapi untuk menghapus objek hanya bisa menggunakan JOSM

source: Click :guilabel:`Save Tags`
id: Kemudian Klik :guilabel:`Save Tags`

source: *4.4 Add data on Data Store Online*
id: *4.4 Menambahkan Data pada Data Store Secara Online*

source: You can directly add your data on Data Store. These are the steps :
id: Anda dapat secara langsung menambahkan data anda ke dalam Data Store. Caranya sebagai berikut :

source: Click Map Search and Load OSM Geometries
id: Klik Map Search dan Load OSM Geometries

source: After that add/edit information about object that chosen by you
id: Kemudian isi/edit atribut informasi dari objek yang dipilih :

source: After you finish click Save tags
id: Ketika sudah selesai klik Save Tags

source: *4.5 Add and Edit User on Private Data Store*
id: *4.5 Menambahkan dan Mengedit User Pada Private Data Store*

source: Open this site : http://sds.openstreetmap.or.id
id: Buka situs berikut http://sds.openstreetmap.or.id

source: Click :guilabel:`user administration`
id: Klik :guilabel:`user administration`

source: Click :guilabel:`Add New User`
id: Klik :guilabel:`Add New User`

source: Click :guilabel:`Save` if you finished
id: Klik :guilabel:`Save` jika sudah selesai

source: *Edit Users*
id: *Mengedit User*

source: Click "Eye Symbol" in the left box
id: Klik Tanda Mata pada kotak sebelah kiri

source: Click :guilabel:`Edit User`
id: Klik :guilabel:`Edit User`

source: *4.6 Add Project on Private Data Store*
id: *4.6 Menambahkan Project Pada Private Data Store*

source: Click :guilabel:`Project`
id: Klik :guilabel:`Project`

source: Click :guilabel:`Create New Project`
id: Klik :guilabel:`Create New Project`

source: Next you have to write Tag Fields Definition in JavaScript Object Notation (JSON) language. You have to translate Extensible Mark-up Language (XML) language at Preset that you want to use into JSON language.
id: Selanjutnya Anda harus menulis Tag Field Definition dalam JavaScript Object Notation (JSON). Anda harus menerjemahkan Extensible Mark-up Language (XML) bahasa pada Preset yang ingin Anda gunakan ke dalam bahasa JSON.

source: Let's see the difference between XML Preset and JSON
id: Mari kita lihat perbedaan antara XML dan JSON Preset

source: If your preset use ELEMENT COMBO, MULTISELECT or CHECK KEY it must converted with format:
id: Jika anda menggunakan ELEMENT COMBO, MULTISELECT or CHECK KEY maka harus dituliskan dalam format :

source: Example (first is XML, second is JSON)
id: Contoh : (Di atas adalah contoh XML dan di bawah adalah JSON)

source: If your preset use ELEMENT TEXT, it must converted with format:
id: Jika preset anda menggunakan ELEMENT TEXT maka harus dituliskan dalam format :

source: Write your tag definition into JSON language at the available row of Tag Field Definition (JSON)
id: Tuliskan tag definisi kedalam bahasa JSON pada baris Tag Field Definition (JSON)

source: Click :guilabel:`Create Project` if your finish
id: Klik :guilabel:`Create Project` jika sudah selesai

source: You can upload your presets in your project to the row of :guilabel:`Preset File`
id: Anda dapat meng-upload preset Anda dalam proyek Anda ke deretan :guilabel:`Preset Berkas`

source: If you click :guilabel:`Project` on right corner, you can see your Project. Click :guilabel:`View Table` to see the data. If there is any ERROR, it possibly there is mistake at your JSON tag definition! If it doesn't you will see a table like this :
id: Jika Anda mengklik :guilabel:`Proyek`di sudut kanan, Anda dapat melihat proyek Anda. Klik :guilabel:`View Table` untuk melihat data. Jika ada ERROR apapun, mungkin ada kesalahan pada Anda tag definisi JSON! Jika tidak Anda akan melihat sebuah tabel seperti ini:

source: You also can download the table in the CSV format or Excel format.
id: Anda dapat mendownloadnya dalam format CSV ataupun Excel

source: **5.General Questions**
id: **5. Pertanyaan Umum**

source: *How to save our data?*
id: *Bagaimana cara menyimpan data kita?*

source: To save your private data the steps are similar like upload your changes to OSM. Remember to always use right prefix (in this case is :hot) with your private tag to make sure that they will be saved on your private database and would not be published.
id: Menyimpan data pribadi adalah sama dengan meng-*upload* perubahan ke OSM. Ingatlah untuk menggunakan awalan yang benar (dalam kasus ini: hot) dengan tag pribadi Anda, untuk memastikan bahwa mereka akan disimpan pada database pribadi dan tidak terpublikasi.

source: *How much users can use the same account? How if I would like to add users?*
id: Berapa banyak pengguna dapat menggunakan account yang sama? Bagaimana jika saya ingin menambahkan pengguna?

source: There is no limit for users account. At the moment users access organized by HOT.
id: Tidak ada batasan untuk account pengguna. Saat ini akses pengguna dikelola oleh HOT.

source: *How much data that I can save in my private server?*
id: *Berapa banyak data yang dapat saya simpan di server pribadi?*

source: A lot of Data
id: Banyak

source: *Is there any easy way to search certain private data?*
id: *Apa cara termudah untuk mencari data pribadi tertentu?*

source: When you login to the datastore.hotosm.org you will have a choice to do some tag search. This is possible to you to search certain tag.
id: Ketika Anda login ke datastore.hotosm.org, Anda memiliki pilihan untuk melakukan pencarian tag. Hal ini memungkinkan Anda untuk mencari tag tertentu.
