Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/intermediate/osm/306-editing-wiki-osm.po
Languages: id

source: Module 6: Editing Wiki OpenStreetMap
id: Modul 6: Mengedit Wiki OpenStreetMap

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Make an account on OSM wiki
id: Membuat akun di Wiki OSM

source: Understand conventions and rules in developing a wiki page
id: Memahami format dan aturan dalam pembuatan halaman wiki

source: Edit the OSM wiki
id: Mengedit Wiki OSM

source: Upload files and images
id: Meng-*upload* file dan foto/gambar

source: Translate and revise wiki
id: Menerjemahkan dan merevisi wiki

source: OpenStreetMap is based around a community of mappers working together. Because of this it is necessary to have a way to communicate with each other, whether it be to organize social mapping events, to discuss different projects related to OSM and/or to create standards for mapping processes. The key avenue for mappers to do this is through the OpenStreetMap wiki, a website where users can create different web pages about different topics and in different languages. To see the OSM wiki, visit http://wiki.openstreetmap.org
id: OpenStreetMap berbasiskan komunitas orang-orang yang membuat peta bersama dari seluruh dunia. Maka sangat penting untuk bisa saling berkomunikasi antara satu dengan yang lainnya, mendiskusikan berbagai proyek yang berkaitan dengan OSM dan membuat standar-standar dalam proses pemetaan. Salah satu cara untuk mereka berkomunikasi adalah dengan menggunakan wiki OpenStreetMap, sebuah situs dimana para pengguna dapat membuat berbagai halaman web mengenai topik-topik yang berbeda dan di dalam berbagai bahasa. Untuk melihat wiki OSM, anda dapat mengunjungi http://wiki.openstreetmap.org

source: **1. Definition of Wiki OpenStreetMap**
id: **1. Pengertian Wiki OpenStreetMap**

source: A wiki is a website where any user can add pages and edit existing pages. It is based on the same principle as OpenStreetMap, the only difference is that with OSM users are editing maps, while wiki users are editing text. The most famous wiki is Wikipedia (http://www.wikipedia.org), an online encyclopedia that covers almost every topic imaginable.
id: Situs wiki adalah sebuah situs dimana semua pengguna dapat menambahkan atau mengedit halaman-halaman yang ada. Prinsipnya sama seperti OpenStreetMap, hanya saja perbedaannya yaitu pengguna OSM mengedit peta sedangkan di wiki pengguna mengedit tulisan. Wiki yang paling terkenal yaitu Wikipedia (http://www.wikipedia.org), sebuah kamus online dimana menampilkan informasi tentang hampir seluruh hal atau topik.

source: The OpenStreetMap wiki contains information about everything related to OSM. When someone is working on a project that uses OSM, they create a wiki page so that other people can read about their project. The wiki contains help for users wanting to learn more about OSM, for common standards on how to make maps and on how to tag objects on the map, as well as many other OSM things. You have already seen at least one of the OSM wiki pages, which describes all of the most common features that you can add to the map, and how they are commonly tagged. This is the Map Features page: http://wiki.openstreetmap.org/wiki/Map_Features
id: Wiki OpenStreetMap berisi informasi tentang segala sesuatu yang berkaitan dengan OSM. Ketika seseorang bekerja dalam suatu proyek yang menggunakan OSM, mereka dapat membuat sebuah halaman di Wiki sehingga orang lain dapat membaca dan mengetahui tentang proyek mereka. Wiki juga dapat membantu para pengguna untuk mempelajari lebih banyak hal tentang OSM, petunjuk-petunjuk umum dalam membuat peta dan bagaimana memberikan tag di objek yang ada pada peta dan masih banyak hal lainnya. Anda telah melihat setidaknya satu dari halaman Wiki OSM yang menjelaskan fitur-fitur umum yang dapat Anda tambahkan ke dalam peta dan bagaimana biasanya suatu objek diberikan tag. Berikut adalah halaman dari Map Features: http://wiki.openstreetmap.org/wiki/Map_Features

source: In this chapter we will learn how to add and edit pages on the OSM wiki. We will learn the guidelines for contributing, the special markup language for creating a wiki page, and helpful ways for improving the wiki, such as translating important pages.
id: Dalam modul ini kita akan belajar bagaimana membuat dan mengedit halaman yang ada di OSM Wiki. Kita akan mempelajari bagaimana cara berkontribusi, membuat bahasa khusus dalam membuat halaman Wiki dan cara untuk membantu meningkatkan Wiki seperti menerjemahkan halaman-halaman penting yang ada di Wiki.

source: **2. The Wiki and Signing Up**
id: **2. Pembuatan Akun Wiki**

source: Go to http://wiki.openstreetmap.org to see the main wiki page. You’ll see a lot of things here, and many links to other pages on the wiki. In the left column are links to some of the main pages. At the top of the page are a list of all the languages in which you can view this page. If it’s available, you can switch the page to your language. Try exploring some of the links on the page and see the kind of information available on the wiki.
id: Kunjungi http://wiki.openstreetmaps.org untuk melihat halaman utama dari wiki. Anda akan melihat banyak hal, dan banyak yang terhubung ke halaman-halaman lain yang ada di wiki. Di kolom kiri adalah link untuk menuju ke beberapa halaman utama. Di bagian atas halaman terdapat daftar dari berbagai bahasa yang dapat Anda gunakan untuk membaca halaman ini. Jika tersedia, maka Anda dapat mengganti halaman ke dalam bahasa Anda. Cobalah untuk mempelajari lebih lanjut beberapa link yang ada di halaman ini dan melihat informasi apa saja yang tersedia di wiki.

source: You don’t need to have an account in order to view the OSM wiki, but you will need to create an account if you want to edit or add pages. Note that this is not the same as your OpenStreetMap account. You need to create a new account, although you can use the same name on the wiki as you did when signing up for OpenStreetMap.
id: Anda tidak harus memiliki akun untuk melihat OSM wiki, akan tetapi Anda harus mempunyai akun jika Anda ingin mengedit atau membuat sebuah halaman. Perlu diingat bahwa akun di wiki ini tidak sama dengan akun yang anda miliki di OpenStreetMaps. Anda harus membuat akun baru, namun Anda dapat menggunakan nama yang sama dengan nama yang Anda gunakan di OpenStreetMap untuk membuat akun di wiki.

source: To create a new account, click on :guilabel:`Log in / create account` in the upper right corner of the website.
id: Untuk membuat akun baru, klik :guilabel:`Log in / create account` di pojok kanan atas dari halaman situs.

source: If you already have an account you can login on this page. Otherwise click on :guilabel:`Create an account`.
id: Jika Anda telah memiliki akun, Anda dapat masuk ke halaman ini. Akan tetapi jika belum, Anda dapat klik :guilabel:`Create an account`.

source: Fill in the form with the username you want to create, your password twice, your email address, and your real name. In the CAPTCHA box at the top you need to type the two words that are shown in the box. This is a security prevention to ensure that you are human, and not a computer.
id: Isilah kotak-kotak yang ada dengan username yang Anda ingin gunakan, ketik password Anda dua kali, alamat email dan nama asli Anda. Dalam kotak CAPTCHA di atas Anda perlu untuk menuliskan dua kata yang ada di kotak tersebut. Hal ini untuk memastikan bahwa Anda yang membuat akun ini adalah manusia, bukan komputer.

source: When you have filled in all the fields click :guilabel:`Create account`.
id: Ketika Anda telah mengisi semuanya Anda dapat klik :guilabel:`Create account`.

source: Now you will be automatically logged in, and you will see your username and other links available in the upper right corner of the website.
id: Sekarang Anda akan otomatis masuk dan Anda dapat melihat username Anda dan link yang ada di sudut kanan atas halaman ini.

source: Let’s start out by editing our user page. Every user has a page on the wiki. These pages are commonly used to provide information about yourself, your location, for interpersonal communication, and for creating test pages and drafts.
id: Kita akan mulai dari mengedit halaman user kita. Setiap pengguna memiliki sebuah halaman di wiki. Halaman-halaman ini biasanya digunakan untuk menampilkan informasi tentang diri Anda, dimana Anda berada, untuk komunikasi intrapersonal dan untuk membuat halaman tes dan konsep.

source: This is a great place for us to start, and learn the basics of editing a wiki page.
id: Ini adalah halaman yang tepat untuk kita memulai dan mempelajari dasar-dasar dari mengedit halaman di wiki.

source: Go to your user page by clicking on your username in the upper right corner. My username is “MapJeff”, so I will click on this.
id: Pergi ke halaman user Anda dengan meng-klik username Anda pada sudut kanan atas. Username saya adalah “MapJeff” jadi saya akan klik itu.

source: Right now the page is empty. Click on :guilabel:`edit this page` to add something to it.
id: Untuk sekarang halaman tersebut masih kosong. Klik :guilabel:`edit this page` untuk menambahkan sesuatu di dalamnya.

source: We can type anything into the editor to add information to the page. For example, let’s add some basic information and a description. You can add your own information, but here is an example.
id: Kita dapat mengetik apapun ke dalam editor untuk menambahkan informasi ke dalam halaman. Sebagai contoh, kita akan menambahkan beberapa informasi dasar dan deskripsi. Anda dapat menambahkan informasi mengenai diri Anda. Berikut adalah contohnya.

source: When you have added some text, enter a summary of your changes in the box next to :guilabel:`Summary` and click :guilabel:`Save Page`. The page will look something like this:
id: Ketika Anda menambahkan beberapa tulisan, memasukkan ringkasan perubahannya ke dalam kotak :guilabel:`Summary` dan klik :guilabel:`Save Page`. Maka halaman tersebut akan terlihat seperti berikut:

source: This is great because I have successfully saved my text to the page, but it is no good because it not formatted in a good way. In order to make it look nice, we need to learn some of the basic wiki formatting techniques. Click :guilabel:`Edit` at the top of the page, and let’s make some more changes to our page.
id: Ketika sudah terlihat seperti ini maka ini pertanda yang bagus karena Anda telah berhasil memasukkan tulisan ke dalam halaman saya akan tetapi belum cukup bagus karena format dan bentuknya belum tersusun dengan rapi. Untuk membuat ini terlihat lebih baik kita harus mempelajari beberapa teknik dasar dalam format wiki. Klik :guilabel:`Edit` yang terdapat di sebelah atas halaman dan buat beberapa perubahan dalam halaman Anda.

source: If you understood the previous chapter on XML, you will remember that we used **elements** which have opening tags and closing tags. We will do something similar on the wiki, using special characters to surround the text we want to appear a certain way.
id: Jika anda telah mengerti modul sebelumnya tentang XML, maka Anda akan mengingat kita menggunakan **element-elemen** yang dimana memakai pembuka dan penutup tags. Kita akan melakukan hal yang sama di wiki menggunakan karakter khusus di sekitar teks yang akan kita tampilkan.

source: The wiki does not automatically put new lines in unless we ask it to, so we need to put the tag <br> at the end of each of our lines in the first section. This will cause a line break to occur.
id: Wiki tidak akan otomatis menuju ke paragraf yang baru kecuali kita menginginkannya dengan memasukkan tag <br> di setiap akhir dari kalimat di paragraf sebelumnya. Ini akan membuat pemisah antar paragraf/bagian.

source: Then, we want the words “About Me” to appear highlighted since it is the heading of a section. To do this we can surround it like this:
id: Setelah itu, kita mau tulisan “About Me” tampil dengan disorot sebagai judul dari bagian ini. Untuk melakukan hal tersebut kita dapat mengetik seperti ini :

source: Now our code looks like this:
id: Sekarang, kode kita akan terlihat seperti ini :

source: And after we save it the page will look nicely formatted:
id: Dan setelah kita simpan maka halaman kita akan terlihat lebih bagus seperti ini:

source: Practice formatting your text in different ways. A small hint: the buttons above the text box will automatically insert different types of formatting code into your text!
id: Cobalah berlatih mengedit format teks Anda dengan cara yang berbeda. Petunjuk: tombol-tombol di atas kotak teks Anda akan otomatis membuat kode format Anda ke dalam bentuk yang berbeda pada teks Anda!

source: Once you have saved your page, it will be viewable by anyone on the internet. The following link goes to my page, but if you replace my username with yours, it will go to your user page.
id: Ketika Anda telah selesai menyimpan halaman Anda, halaman ini dapat dilihat oleh semua orang dengan mengakses Internet. Link berikut ini akan menuju ke halaman saya, tetapi jika Anda mengganti username saya dengan milik Anda maka link tersebut akan menuju ke halaman Anda.

source: **4. The Format of Writing Wiki**
id: **4. Format Penulisan Wiki**

source: In this section we will discuss many of the different ways you can format your information on a wiki page and the appropriate codes to use to create different elements.
id: Pada bagian ini kita akan mendiskusikan berbagai cara untuk memformat informasi Anda di halaman wiki dan meyesuaikan kode yang Anda gunakan untuk membuat berbagai elemen yang berbeda.

source: It’s a good idea to practice before trying to create an official wiki page that you want others to see, so first let’s create a sub-page under your user page where you can play around and practice editing.
id: Hal yang baik dilakukan adalah Anda sebaiknya berlatih membuat halaman terlebih dahulu sebelum membuat halaman wiki resmi yang dapat dilihat orang lain, mari kita membuat sub halaman di halaman user Anda dimana Anda dapat berlatih dan belajar mengedit wiki.

source: You can create any new wiki page by typing in the link to the page that you want and then creating a new page. For now, let’s create a new subpage that we can use to practice our wiki editing. Open your web browser to the following address, replacing “MapJeff” with your own username. https://wiki.openstreetmap.org/wiki/User:MapJeff/testpage
id: Anda dapat membuat sebuah halaman wiki baru dengan mengetik link ke halaman yang Anda inginkan, lalu kemudian membuat sebuah halaman baru. Sekarang, kita akan membuat sub halaman baru yang dapat kita gunakan dalam melakukan perubahan wiki. Buka browser dan masuki ke alamat dibawah ini dengan mengganti “MapJeff” dengan Username Anda sendiri. https://wiki.openstreetmap.org/wiki/User:MapJeff/testpage

source: This will take us to an empty page that we can edit.
id: Ini akan membawa kita ke dalam sebuah halaman kosong yang dapat kita edit.

source: Now let’s look at how to format our text. Feel free to use your test page to try things out.
id: Sekarang mari kita lihat bagaimana cara memformat teks. Silahkan gunakan halaman percobaan Anda untuk mencoba beberapa hal dibawah ini :

source: Description
id: Deskripsi

source: Example
id: Contoh

source: Result
id: Hasil

source: Surrounding text with two apostrophes (') will display this text in *italic*
id: Di sekitar teks berikan dua tanda kutip (') yang akan menampilkan teks dalam bentuk *italic*.

source: Surrounding text with three apostrophes (') will display this text in **bold**
id: Disekitar teks berikan tiga kutip (') yang akan menampilkan teks dalam bentuk **bold**.

source: Surrounding text with five apostrophes (') will this text in *****bold italic*****
id: Disekitar teks berikan lima kutip (') yang akan menampilkan teks dalam bentuk ****bold italic****.

source: Four dashes in a row will create a horizontal line. This should be used sparingly.
id: Empat garis lurus berturut turut akan menghasilkan garis horizontal. Ini jarang digunakan.

source: **Special Formatting**
id: **Pengaturan Khusus**

source: A pair of '<nowiki>' and '</nowiki>' disables the wiki-syntax in the enclosed text.
id: Pasangan kata '<nowiki>' and '</nowiki>' di sekitar teks tidak akan menampilkan teks yang ada.

source: Surround your text with '<!-- ', '-->' and the enclosed text will not display on the wiki-page (a comment).
id: Ketik '<!-- ', ' -->' di antara teks anda dan teks tersebut tidak akan tampil di wiki (a comment).

source: Comment! <!--this is a comment which will not be shown-->
id: Comment! <!—komen ini tidak akan muncul-->

source: **Headings and Subheadings**
id: **Judul dan Sub Judul**

source: A section starts with a header consisting of a line beginning and ending with two or more consecutive equal signs (=). The number of equal signs indicates the nesting level of sections.
id: Suatu sesi dimulai dengan judul yang dibuat dengan kalimat dimulai dan diakhiri dengan dua atau lebih tanda sama dengan (=). Jumlah dari tanda menunjukkan tingkat besar dari judul.

source: When you create sections and subsection headings in your wiki page, the page will automatically have a table of contents section created at the top of the page.
id: Ketika Anda membuat suatu sesi dan sub sesi judul di halaman wiki Anda, maka halaman wiki Anda akan otomatis memiliki bagian daftar isi yang dibuat di atas halaman Anda.

source: Example wiki source
id: Contoh sumber wiki

source: **Lists**
id: **Daftar**

source: It’s easy to create a bullet list. In order to make an item in a list, you simply need to use a star (*) as the first character on one or more consecutive lines.
id: Sangat mudah untuk membuat sebuah urutan. Dalam membuat sebuah item dari urutan Anda hanya perlu untuk menaruh tanda bintang (*) di awal karakter kalimat Anda.

source: To create an ordered list, you simply use number signs (#) instead of stars (*). You can create nested lists by using a combination of stars and number signs. Nested lists display as lists with different levels of indentation. When nesting lists you may mix bullet lists and numbered lists on each level.
id: Untuk membuat urutan berdasarkan angka Anda dapat menggunakan tanda pagar (#) bukan bintang (*). Anda juga dapat membuat urutan berdasarkan tingkatan menggunakan kombinasi bintang dan pagar. Urutan akan tampil dengan tingkatan yang berbeda.

source: This list has
id: Daftar ini memiliki

source: **Links**
id: **Tautan**

source: Links within the OpenStreetMap wiki are quite simple. Simply surround the name of the wiki page you want to link to with double brackets [[wiki-link]]. You could add different text for the link by adding a pipe symbol (|) and the text will appear as the link text. If you want a special language version of a wiki page, you should prefix the page name with the two-letter language code and a colon (:). For example, to link to the German version of a page, you would use [[de:wiki-link]].
id: Link dalam OpenStreetMap wiki cukup sederhana. Cukup tulis disekitar halaman wiki yang Anda ingin berikan link dengan dua tanda kurung [[wiki-link]]. Anda dapat menambahkan teks yang berbeda untuk link tersebut dengan menambahkan simbol pipa (|) dan teks akan tampil dengan link yang sama. Jika Anda ingin bahasa khusus untuk halaman wiki Anda harus menambahkan nama halaman dengan kode bahasa dan titik dua (:) Sebagai contoh, link untuk versi Jerman, Anda bisa menggunakan [[de:wiki-link]]

source: If you want to link to an article on Wikipedia, prefix the name of the article with “wikipedia:”. For example, [[wikipedia:article-name]]. If you want to link to a wikipedia article in another language, you can add the language code like this: [[wikipedia:de:article-name]].
id: Jika Anda ingin link yang ada di Wikipedia, tambahkan nama artikel dengan “wikipedia” sebagai contoh [[wikipedia:article-name]]. Jika Anda ingin link wikipedia di dalam bahasa yang berbeda Anda dapat menambahkan kode bahasa seperti ini : [[wikipedia:de:article-name]].

source: Finally, if you want to create an external link, simply type the URL and it will display as a link. If you want to change the link text, you can use one set of brackets to change the text which links to your URL [external-link link-text].
id: Terakhir, jika Anda ingin membuat link eksternal cukup dengan mengetik URL dan akan tampil sebagai link. Jika Anda ingin mengubah teks dengan kalimat yang lain Anda dapat menambahkan pemisah untuk mengubah teks dari link Anda URL [external-link link-text].

source: [[Map Features | different text but links to same]]
id: [[Map Features | teks berbeda tetapi menghubungkan halaman web yang sama]]

source: [[wikipedia:OpenStreetMap | different text]]
id: [[wikipedia:OpenStreetMap | teks berbeda]]

source: [http://walking-papers.org | different text]
id: [http://walking-papers.org | teks berbeda]

source: **Tables**
id: **Tabel**

source: Tables are probably the trickiest thing to create in a wiki, but easy once you understand how it works. First, you need to understand that a table is really a grid that has some number of rows and some number of columns, and one type of information is contained horizontally in rows and another type vertically in columns.
id: Tabel biasanya suatu yang agak sulit dibuat di wiki akan tetapi akan mudah jika Anda sudah mengerti dan memahami caranya. Pertama Anda harus mengerti bahwa tabel terdiri dari sejumlah kolom dan baris dan informasi yang disampaikan horizontal di dalam baris dan kolom.

source: A basic table needs the following parts:
id: Dalam membuat tabel dasar-dasar yang dibutuhkan yaitu:

source: A line with the first two characters '{\|' indicating the begin of a table.
id: Sebuah baris dengan dua karakter pertama yaitu '{\|' yang berarti akan memulai tabel

source: An optional line with the first two characters '\|+' for the caption of the table.
id: Baris pilihan dengan 2 karakter pertama yaitu '\|+' untuk judul dari tabel.

source: One or more table rows, beginning with '\|-' and usually no other content.
id: Satu atau lebih baris tabel dimulai dengan '\|-' dan tidak memiliki konten

source: After each table row one or more lines with table cells and their text/content. A table cell has as first character a pipe symbol (\|) and the second character cannot be either plus (+) or minus (-) because these two are reserved for caption and table row respectively.
id: Setelah setiap baris terisi dari sel dan kontennya. Sel tabel tersusun dari karakter pertama yaitu simbol pipa (\|) dan karakter kedua tidak dapat ditambahkan (+) atau (-) karena diganti dengan keterangan dan baris dari masing-masing kolom

source: A line with the first two characters '\|}' indicating the end of a table.
id: Baris dengan dua karakter pertama '\|}' menunjukkan akhir dari tabel.

source: It is good practise and increases readability to use a space as second/third character, thus avoiding any ambiguity.
id: Hal yang bagus untuk dipraktekan dan meningkatkan kemampuan untuk menggunakan sebuah jarak untuk karakter kedua/ketiga sehingga akan menghindari kebingungan.

source: **Example wiki source** ::
id: **Contoh wiki** ::

source: **Result**
id: **Hasil**

source: Play around with all these different techniques for formatting your wiki. If you want an example of all of these things, try viewing the test page I created here: https://wiki.openstreetmap.org/wiki/User:MapJeff/testpage
id: Mempelajari berbagai teknik yang berbeda untuk memformat wiki Anda. Jika Anda ingin sebuah contoh dari semua contoh yang ada di atas Anda dapat melihat halaman tes yang saya buat disini : https://wiki.openstreetmap.org/wiki/User:MapJeff/testpage
