Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/intermediate/osm/306-editing-wiki-osm.po
Languages: id

source: Compare the wiki text to the way it is formatted when you are viewing it. You can find more information on editing at http://wiki.openstreetmap.org/wiki/Help:Wiki-Editing.
id: Bandingkan teks wiki format Anda dengan teks yang ada di halaman saya. Anda dapat mencari informasi lainnya dalam meng-edit di http://wiki.openstreetmap.org/wiki/Help:Wiki-Editing.

source: **5. Creating A New Page in Wiki**
id: **5. Pembuatan Halaman Baru di Wiki**

source: You can create any wiki page the same way that you have created your user page. However, before you run off creating pages to your heart’s content, it is important to understand some guidelines for how to best contribute. Some key things to keep in mind are:
id: Anda dapat membuat halaman wiki apapun seperti yang telah Anda lakukan di halaman user Anda. Akan tetapi sebelum Anda mencoba membuat halaman Anda penting buat Anda untuk mengetahui dan memahami beberapa pedoman untuk berkontribusi di wiki ini. Hal-hal yang perlu diingat yaitu:

source: **Before Creating a Page**
id: **Sebelum membuat halaman**

source: Don’t Duplicate. When you want to create a new wiki page, do a comprehensive search of the wiki to ensure that someone else hasn’t already created a page about the same topic. You can search for existing pages using the search box in the upper right.
id: Jangan meniru. Ketika Anda ingin membuat sebuah halaman lakukan peninjauan dan pencarian di wiki untuk memastikan bahwa topik yang Anda ingin tulis belum dibuat oleh siapapun. Anda dapat mencari halaman yang sudah ada di kotak pencarian di sebelah kanan atas.

source: If a page that you want to create already exists, but you think it could be better, you should improve it, instead of creating an entirely new page.
id: Jika halaman yang Anda ingin buat telah ada, tapi Anda ingin memperbaikinya Anda lebih baik mengedit halaman tersebut daripada membuat halaman yang baru.

source: Choose a descriptive name, capitalize new words, and don’t use spaces or dashes. The Map Features page for example, is named Map_Features, making the link: http://wiki.openstreetmap.org/wiki/Map_Features
id: Pilihlah nama yang dapat mendeskripsikan, gunakan huruf besar di setiap kata. Fitur peta sebgai contoh diberi nama Map_Features, buat link: http://wiki.openstreetmap.org/wiki/Map_Features

source: When Structuring a Page
id: Ketika membuat/menyusun halaman

source: Divide your page into sections and subsections.
id: Bagi halaman Anda ke dalam sesi dan sub sesi

source: Create an “Introduction” section at the top of the page to give a brief explanation of the page.
id: Buat pendahuluan di tiap bagian atas halaman untuk memberikan penjelasan dari halaman tersebut.

source: Format different parts of your pages as tables or lists, when appropriate. (We will discuss formatting more in the next section)
id: Buat bagian-bagian berbeda dari halaman Anda seperti tabel atau daftar jika dibutuhkan. (Kita akan mendiskusikan format lebih lanjut pada sesi selanjutnya)

source: When in doubt, look at other pages on the wiki for inspiration about how to format things. Remember that you can look at the code for any page by clicking on the edit tab and seeing how other users format their text.
id: Jika Anda ragu, lihat ke halaman wiki yang lain untuk mendapatkan inspirasi bagaimana untuk membuat format sebuah halaman. Ingat, Anda dapat melihat kode dari halaman manapun dengan meng-klik pada tab edit dan liat bagaimana penulis memberikan format pada tulisan mereka.

source: **6. Upload File and Photo/Image**
id: **6. Upload File dan Foto/Gambar**

source: To add or insert files or images on Wikimedia pages, first we have to upload a file or image to the Wikipedia website. Here are the steps:
id: Untuk menambahkan atau memasukkan file atau gambar pada halaman Wikimedia, terlebih dahulu kita harus meng-upload file atau gambar tersebut ke situs Wikipedia. Berikut adalah tahapannya:

source: Uploading files or images to the Wikipedia website.
id: Meng-upload file atau gambar ke situs Wikipedia.

source: Open https://wiki.openstreetmap.org website.
id: Buka situs https://wiki.openstreetmap.org.

source: Make sure you are logged in.
id: Pastikan Anda log-in terlebih dahulu

source: Then click :guilabel:`Upload file` which is in the left side of the screen, under the Tools menu.
id: Kemudian Klik :guilabel:`Unggah berkas` yang berada di sisi kiri layar, dibawah menu Peralatan.

source: After Upload file page opened, click :guilabel:`Choose File` at Source file name. Find the file that will be uploaded from your computer.
id: Setelah terbuka halaman Unggah Berkas, klik :guilabel:`Choose File` pada Nama berkas sumber. Cari file yang akan di-upload pada komputer Anda.

source: Terms file to upload:
id: Ketentuan file atau gambar yang dapat di-upload diantaranya:

source: Maximum file/image size: 70 MB
id: Ukuran file/gambar maksimum 70 MB

source: Permitted file/image type: doc, pdf, odt, odp (for file) dan png, gif, jpg, jpeg, svg (for image).
id: Format file/gambar dapat berupa: doc, pdf, odt, odp (untuk file) dan png, gif, jpg, jpeg, svg (untuk gambar).

source: After choosing the file, click “Upload file” at the bottom of the page.
id: Setelah memilih file, klik “Muatkan berkas” di bagian bawah halaman.

source: Then it will show a page like this:
id: Kemudian akan tampil halaman seperti ini:

source: *Example of file upload*
id: *Contoh hasil upload file*

source: *Example of image upload*
id: *Contoh hasil upload gambar*

source: Your file/image uploaded successfully! However, this file/image has not been on your page.
id: File dan gambar Anda berhasil ter-upload! Namun foto ini belum berada pada halaman Anda.

source: Insert file / image on the Wikipedia page.
id: Memasukkan file/gambar pada halaman Wikipedia.

source: Look the file/image name that you uploaded before, example: File:Mapping jakarta.JPG and File:Pemetaan dengan OSM.pdf.
id: Perhatikan nama file dan gambar yang sudah Anda upload tadi. Contoh: File:Mapping jakarta.JPG dan File:Pemetaan dengan OSM.pdf.

source: To insert a file / image on your page, you have to go to the page that you want to modify and then click :guilabel:`Edit`
id: Untuk memasukkan file/gambar pada halaman Anda, yang harus Anda lakukan adalah masuk ke halaman yang akan Anda ubah kemudian klik :guilabel:`Sunting`.

source: Copy the name of file/image you have uploaded into the editing box, as shown below:
id: Copy nama file/gambar yang sudah Anda upload ke dalam kotak editing, seperti gambar di bawah ini:

source: Then click :guilabel:`Save page` under the editing box.
id: Setelah itu klik :guilabel:`Simpan Halaman` yang berada di bawah kotak.

source: The result will look like this:
id: Hasilnya akan tampak seperti ini:

source: **7. Translating Pages**
id: **7. Penerjemahan Halaman**

source: One very useful thing that can be done on the wiki is to translate important pages into your language. As you’ve already seen, many wiki pages have links at the top where you can switch languages. However, this is only available for pages that have been translated, and that include a special tag at the top - {{Languages|page_name}}
id: Salah satu hal yang paling berguna yang bisa dilakukan dalam wiki ini adalah kita dapat menerjemahkan halaman-halaman yang kita anggap penting ke dalam bahasa kita. Seperti yang telah Anda lihat, banyak halaman yang ada di wiki memiliki link yang berada pada atas halaman yang dapat diubah ke dalam berbagai bahasa. Akan tetapi hal ini hanya dapat dilakukan pada halaman yang sudah diterjemahkan sebelumnya dan juga termasuk tag khusus yang ada di atas halaman. {{Languages|page_name}}

source: When developing the OpenStreetMap community in your country, it is very useful for key wiki pages to be translated into your language. Adding translated pages is easy, as we will see here.
id: Ketika mengembangkan komunitas OpenStreetMap di negara Anda, akan sangat bermanfaat apabila halaman-halaman yang ada di wiki diterjemahkan ke dalam bahasa Anda. Menerjemahkan halaman yang ada di wiki sangatlah mudah, seperti yang akan kita pelajari di sinii.

source: The names of pages are always created in English, but different versions of the same page can be created by adding a language code into the URL. For example, the Map Features page is at http://wiki.openstreetmap.org/wiki/Map_Features
id: Nama-nama dari halaman yang ada biasanya dibuat dalam bahasa inggris tapi versi yang berbeda pada halaman yang sama dapat dibuat dengan menambahkan kode bahasa ke dalam URL. Contohnya halaman Map Features ada di http://wiki.openstreetmap.org/wiki/Map_Features

source: If you want the Spanish version of this page, it is available at http://wiki.openstreetmap.org/wiki/ES:Map_Features
id: Jika Anda menginginkan versi dalam bahasa Spanyol, tersedia di http://wiki.openstreetmap.org/wiki/ES:Map_Features

source: If a page exists that you want to translate, you simply visit the URL with your language code and a colon (:) preceding the page name. For example, if we wanted to translate this page into Indonesian, we would visit http://wiki.openstreetmap.org/wiki/ID:Map_Features
id: Jika Anda ingin menerjemahkan sebuah halaman, Anda dapat mengunjungi URL dengan menggunakan kode bahasa dan menggunakan tanda titik dua (:) sebelum nama halaman. Contoh jika Anda ingin menerjemahkan halaman Map Feature ke dalam bahasa Indonesia Anda dapat mengunjungi http://wiki.openstreetmap.org/wiki/ID:Map_Features

source: Then we click :guilabel:`Edit` to create this page.
id: Lalu kita klik :guilabel:`Edit` untuk menerjemahkan halaman ini.

source: The easiest way to add a translation is to go to a page in English, click :guilabel:`Edit`, and copy all of the wiki text to your Clipboard. Then edit the page in your own language, pasting in the original English text and translating it into your language. This will allow you to keep all of the original formatting and links correctly, but translate the English text into your own language.
id: Cara paling mudah untuk menambahkan terjemahan adalah lihat halaman di dalam bahasa inggris, klik :guilabel:`Edit` dan copy semua teks wiki yang ada ke dalam Clipboard Anda lalu edit halaman ini ke dalam bahasa Anda, paste teks asli yang dalam bahasa Inggris dan terjemahkan ke dalam bahasa Anda. Ini akan membuat Anda akan tetap menyimpan format asli dan link halaman tersebut tetapi teks dalam bahasa Inggris telah diterjemahkan ke dalam bahasa Anda.

source: **6. Watching Pages**
id: **6. Cara Melihat Daftar Perubahan**

source: You may want keep an eye on pages that you have edited yourself, or that you have an interest in. To do this, you can add specific pages to your :guilabel:`Watchlist` which keeps a record of recent changes to pages, so that you will know when others have edited them.
id: Anda dapat menyimpan halaman yang telah Anda edit ataupun halaman yang menurut Anda menarik. Untuk melakukan ini Anda dapat menambahkan halaman tertentu ke dalam :guilabel:`Watchlist` Anda. Ini akan menyimpan perubahan yang Anda lakukan pada halaman tersebut jadi Anda akan mengetahui ketika ada orang lain yang mengeditnya kemudian.

source: To add a page to your watchlist, click on the star at the top of the page section:
id: Untuk menambahkan halaman ke dalam WatchList Anda, klik tanda bintang di bagian atas halaman:

source: Then, you can view your watchlist by clicking on “My Watchlist” at the top of the page:
id: Lalu Anda dapat melihat WatchList Anda dengan klik pada “My Watchlist” yang ada pada bagian atas halaman.

source: On the :guilabel:`My Watchlist` page you choose to show changes to your watched pages within the past hours, or days, or since you started watching the page.
id: Pada :guilabel:`My Watchlist` akan menunjukkan perubahan yang Anda lakukan dalam beberapa jam yang lalu, hari atau dari sejak Anda melihat halaman tersebut.
