Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/tot/501_adult_learning.po
Languages: id

source: Principle of benefit: This principle guarantees that what is learned in adult education is compatible with the needs felt by participants. Adults are prepared to learn when they realize there are needs to be addressed. This awareness will stimulate the emergence of motivation to learn among adults and a sense of preparedness will emerge as they feel they are responsible for this as an adult.
id: Prinsip manfaat: Prinsip manfaat menjamin bahwa apa yang dipelajari dalam pendidikan orang dewasa adalah sesuai dengan kebutuhan yang dirasakan oleh peserta. Orang dewasa akan siap untuk belajar manakala dia menyadari adanya kebutuhan yang harus dipenuhi. Kesadaran terhadap kebutuhan ini mendorong timbulnya minat untuk belajar, dan karena rasa tanggung jawabnya sebagai orang dewasa maka timbul kesiapan untuk belajar.

source: Principle of preparedness: This principle guarantees participants’ mental and physical preparedness to be able to take part in learning activities. Adults will never be able to participate in learning process if they are not yet prepared (either physically and metally) to do it.
id: Prinsip kesiapan: Prinsip kesiapan menjamin kesiapan mental maupun kesiapan fisik dari peserta untuk dapat melakukan kegiatan pembelajaran. Orang dewasa tidak akan dapat melakukan kegiatan pembelajaran manakala dirinya belum siap untuk melakukannya, apakah itu karena belum siap (fisiknya atau belum siap mentalnya).

source: Principle of locality: This principle guarantees the learned material is locally specific. Generalisation of learning outcome in adult learning will be dificult to do. The outcome in adult learning generally comprises specific abilities to solve participants’ current problem in their respective locality. Such skill can not be generalized as a theory or principle that can be applied anywhere, anytime. The present learning outcome might not be useful to solve similar problems in two or three years’ time. This outcome will also not be applicable anywhere and is only suitable for participants respective locality as it is processed from participants experience.
id: Prinsip lokalitas: Prinsip lokalitas menjamin adanya materi yang dipelajari bersifat spesifik local. Generalisasi dari hasil pembelajaran dalam pendidikan orang dewasa akan sulit dilakukan. Hasil pendidikan orang dewasa pada umumnya merupakan kemampuan yang spesifik yang akan dipergunakan untuk memecahkan masalah peserta pada tempat mereka masing-masing, pada saat sekarang juga. Kemampuan tersebut tidak dapat diberlakukan secara umum menjadi suatu teori, dalil, atau prinsip yang dapat diterapkan dimana saja, dan kapan saja. Hasil pembelajaran sakarang mungkin sudah tidak dapat lagi dipergunakan untuk memecahkan masalah yang sama dua atau tiga tahun mendatang. Demikian pula hasil pembelajaran tersebut tidak dapat diaplikasikan dimana saja, tetapi harus diaplikasikan di tempat peserta sendiri karena hasil pembelajaran tersebut diproses dari pengalaman-pengalaman yang dimiliki oleh peserta.

source: Principle of integration: This principle guarantees integration of adult learning material. Learning plan in adult education must cover materials that are non-partial and integrated in nature, forming a unity.
id: Prinsip keterpaduan: Prinsip keterpaduan menjamin adanya integrasi atau keterpaduan materi pendidikan orang dewasa. Rencana pembelajaran dalam pendidikan orang dewasa harus meng-cover materi-materi yang sifatnya terintegrasi menjadi suatu kesatuan materi yang utuh, tidak partial atau terpisah-pisah.

source: Identification of learning strategies is based on the objective to achieve. Based on this, there are two types of learning strategies i.e. : (a) the strategy that is designed to assist people in addressing their past experience in a new way, and (b) the strategy that is designed to bring about new knowledge and skills (enrichment of experience).
id: Pemilihan strategi pembelajaran ditentukan berdasarkan tujuan yang akan dicapai. Berdasarkan tujuan yang akan dicapai ada dua strategi belajar, yaitu: (a) Strategi belajar yang dirancang untuk membantu orang membantu menata pengalaman masa lampau yang dimilikinya dengan cara baru proses penataan pengalaman/penataan kembali, dan (b) strategi belajar yang dirancang untuk memberikan pengetahuan dan keterampilan baru (proses perluasan pengalaman).

source: The process of addressing past experience: This strategy is employed for training participants who already possess the knowledge and skills relating to training material to be conveyed. The role of facilitators here is to assist participants in making generalization by exploring participants experience and giving feedbacks. Participants are expected to have a big role in terms of expressing their experience and opinion, analyzing their experience, exploring alternatives and benefits. The goals will be reached when the atmosphere is free of threats and when participants feel the need to find new approaches in addressing their past problems.
id: Proses penataan pengalaman/penataan kembali: Strategi ini diperuntukkan bagi peserta pelatihan yang sudah memiliki pengetahuan dan keterampilan tentang apa yang akan dilatihkan. Untuk itu peran fasilitator disini membantu peserta untuk membuat generalisasi dengan memancing pegalaman yang sudah dimiliki dan memberi umpan balik. Sedangkan peserta harus berperan banyak untuk mengungkapkan data mengenai pengalaan dan pendapatnya, menganalisa pengalamannya, menggali alternatif dan manfaatnya. Hal ini akan terjadi apabila ada suasana yang bebas dari ancaman, rasa kebutuhan dari peserta untuk menemukan pendekatan baru dalam mengatasi masalah lamanya.

source: The process of enriching experience: This strategy is employed for participants who have yet the knowledge and skills that are presented in the training. Here, facilitators role is to provide new data and concept for the participants to absorb and practice. In this case, it is necessary to have clarity in terms of how to best present the training and motivate participants to identify the relevance of the new material in their life.
id: Proses perluasan pengalaman: Strategi ini diperuntukkan bagi peserta pelatihan yang belum memiliki pengetahuan atau keterampilan tentang apa yang akan dilatihkan. Peran fasilitator disini adalah memberikan data dan konsep yang baru, sedangkan peran peserta pelatihan adalah memperoleh data dan konsep baru, mempraktikkannya. Dalam hal ini diperlukan kejelasan penyajian baru dan memotivasi peserta untuk mengetahui relevansi bahan baru tersebut dalam kehidupan.

source: Based on the aims elaborated above, we now know that there are two types of adults in adult learning i.e. adults with prior knowledge and adults without prior knowledge. But it is necessary to remember that adults already possess several characteristics that play a role in determining the best strategies for them. In general, adult learning is expected to involve participatory method i.e. active participation of training participants as well as other arrangements such as training material, date and time of training, etc. Principally, in participatory method facilitators don’t act as teacher and lecture all the time, and involve participants in every activity. This strategy can be further explained as follows:
id: Berdasarkan tujuan di atas diketahui bahwa dalam pembelajaran orang dewasa ada dua tujuan dalam pembelajaran, yaitu bagi yang sudah mempunyai pengetahuan dan belum. Tetapi perlu diingat orang dewasa telah memiliki bebrapa karakteristik yang perlu diperhatikan dalam menetapkan strategi pembelajarannya. Berdasarkan karakteristik orang dewasa, maka strategi yang efektif untuk pembelajaran orang dewasa. Secara umum pembelajaran orang dewasa diharapkan menggunakan pembelajaran partisipatif, yaitu keterlibatan atau peran serta peserta pelatihan dan pengaturan lainnya yang menyangkut materi pelatihan, waktu penyelenggaraan, dan lain sebagainya. Pada prinsipnya pada pembelajaran partisipatif fasilitator tidak menggurui dan selalu berceramah, tetapi selalu melibatkan peserta dalam kegiatan. Strategi yang dimaksud antara lain sebagai berikut.

source: **a. Practical, problem-centered learning**
id: **a. Pembelajaran yang praktis dan berpusat pada masalah**

source: One of the characteristics of adults is that they learn through problem solving and are not lesson-oriented. They learn well when they find what they learn during a training can be used to solve their problems. To this end, strategies to be used are as follows: before the start of the learning process, facilitators must identify trainees’ needs and problems. It is better to start with identifying authentic problems of training participants in their daily life. Should the facilitators feel the need to introduce new theories or information, they need to ensure that these theories and information are related to problems faced by trainees and real life examples. In problem solving oriented training, methods that can be employed are e.g. Q&A session and discussion. The latter can be divided into several steps:
id: Salah satu karakteristik orang dewasa adalah orang dewasa belajar dengan memecahkan masalah tidak berorientasi pada bahan pelajaran. Jika hal yang dipelajari dalam pelatihan dapat memecahkan masalah yang dialami, maka mereka akan belajar dengan baik. Untuk itu, strategi yang digunakan dalam pembelajaran adalah sebagai berikut: Sebelum pembelajaran dimulai, fasilitator harus mengidentifikasi kebutuhan-kebutuhan dan masalah mereka. Selanjutnya pembelajaran sebaiknya dimulai dengan mengidentifikasi masalah-masalah otentik yang mereka hadapi dalam kehidupan sehari-hari. Jika kita perlu memperkenalkan teori atau informasi baru, yakinkan bahwa semuanya dikaitkan dengan masalah yang dihadapi dan contoh-contoh nyata. Dalam pemecahan masalah ini metode yang bisa digunakan antara lain tanyajawab, diskusi. Diskusi dalam rangka memecahkan masalah terdiri dari beberapa tahap, yaitu:

source: Group members are aware of the existence of problems
id: Anggota kelompok sadar akan adanya masalah

source: Individually, members find ideas on how best to solve the problems
id: Anggota secara individu mencari dugaan untuk memecahkan masalah sementara

source: Group members search for facts or reflect on their experience to support their ideas.
id: Anggota kelompok mencari fakta atau pengalamannya untuk mendukung dugaannya.

source: Discussion among group members on how to solve the problems
id: Mendiskusikan dengan anggota kelompok atas pemecahan masalah

source: Group members conclude their discussion.
id: Membuat kesimpulan diskusi dalam memecahkan masalah.

source: With regards to practical learning, adults also need practical activities. Material presented must be practiced to be instilled properly, the appropriate methods being inter alia demonstration, simulation and practicing. For example, to reach competency in how to use GPS and input additional data in OSM, it would render a training meaningless when participants only know and understand how to use GPS and add OSM data without demonstration by facilitators, simulation by some of participants and practical session involving all participants. What is necessary with regards to this competency is how to turn on GPS and the initial GPS setting.
id: Berkaitan dengan sesuatu yang praktis, dalam pembelajaran orang dewasa diperlukan praktik lapang. Materi harus dipraktikkan untuk kepentingan praktis yang akan diterapkan. Rangkaian metode yang cocok digunakan antara lain demonstrasi, simulasi dan praktik. Misalnya untuk mencapai kompetensi Menggunakan GPS untuk menambah data di OSM, tidak ada artinya kalau peserta hanya mengetahui dan paham tentang penggunaan GPS untuk menambahkan data OSM, tetapi perlu didemonstasikan oleh fasilitator dan disimulasikan oleh sebagai peserta dan dipraktikkan oleh semua peserta. Yang perlu dipraktikkan dalam kompetensi tersebut antara lain menyalakan GPS dan melakukan pengaturan GPS saat pertama kali.

source: **b. Adults prefer a learning process that integrates new information into** **their experience**
id: **b. Orang dewasa menyukai pembelajaran yang mengintegrasikan informasi baru dengan pengalaman-pengalaman mereka:**

source: There are two aspects of adult learning i.e. the process of addressing their past experience and the process of enriching experience. Therefore, learning process for adults must assist them in exploring their experience in order to learn new things. A cooperative group learning can also help them to share opinion with others. Furthermore, we need to help them understand new information, the proper methods of which would be inter alia Q&A session and discussion. For example, in presenting the lesson on “How to Operate OSM”, it is better for the facilitators to not lecture on:
id: Dalam pembelajaran orang dewasa ada dua hal, yaitu proses penataan pengalaman/penataan kembali dan proses perluasan pengalaman, untuk itu pembelajaran orang dewasa haruslah membantu mereka mengungkapkan pengalaman-pengalaman mereka untuk mempelajari hal-hal yang baru. Pembelajaran kelompok kooperatif juga dapat membantu mereka untuk berbagi pendapat dengan peserta yang lain. Selanjutnya kita perlu membantu mereka dalam memahami informasi yang baru. Metode yang sesuai diantaranya dengan tanyajawab dan diskusi. Misalnya dalam mengajarkan materi “Pengoperasian OSM”, sebaiknya fasilitator tidak memberi ceramah tentang:

source: How to visit OpenStreetMap site,
id: Cara mengunjungi situs OpenStreetMap

source: How to navigate maps,
id: Cara menavigasi Peta,

source: How to save Images from OSMan map,
id: Cara menyimpan Gambar dari Peta OSM

source: How to create OpenStreetMap account,
id: Cara membuat Akun OpenStreetMap

source: OSM Map Editing.
id: Editing Peta OSM

source: Rather, the facilitators need to explore the degree of participants experience or knowledge on the subject through Q&A session, after which a discussion follows focusing on difficulties encountered on the subject. The facilitators then can provide additional material that they feel needed by the participants taking into account their prior experience and knowledge.
id: tetapi fasilitator perlu menggali seberapa jauh pengalaman mereka atau pengetahuan mereka tentang materi tersebut dengan tanyajawab. Setelah itu bisa didiskusikan untuk memecahkan masalah kesulitan peserta terhadap materi tersebut, selanjutnya fasilitator dapat memberikan tambahan materi yang dirasa belum diketahui oleh peserta dengan selalu menghubungkan dengan pengetahuan dan pengalaman yang mereka miliki sebelumnya.

source: **c. Adults prefer a learning process that enhances their self-esteem**
id: **c. Orang dewasa menyukai pembelajaran yang meningkatkan harga diri mereka**

source: In order to make adults confident, we can start with simple things with low possibility of failure. The degree of difficulty of material presented may escalate as their confidence rises. For example, when conducting training on how to operate JOSM, in the event some participants are not yet familiar with internet, facilitators can start with light skills such as how to download JOSM. The method employed for this task may be in dividing participants in groups of two. Participants who are already capable of doing the task show their partner how to do it, after which the faciliators may proceed to individual task. This method is meant to not encumber participants at the beginning of training. Other aspects on how to operate JOSM may follow the same template. The point is that participants must not be humiliated for their lack of internet skills.
id: Agar orang dewasa percaya diri, kita dapat memulai dengan hal-hal yang sederhana dengan tingkat kegagalan yang kecil. Selanjutnya pembelajaran semakin meningkat seiring dengan kepercayaan diri mereka. Misalnya, ketika mengajarkan pengoperasian JOSM, diketahui peserta belum begitu lancar dengan internet, maka dapat memulai dengan praktek-praktek keterampilan yang ringan misalnya melakukan download JOSM dengan cara berpasangan, yang sudah bisa mengajarkan kepada yang belum bisa dan dilanjutkan dengan mengerjakan secara individu. Hal ini dimaksudkan agar tidak memberikan beban yang berat di awal pelatihan. Begitu selanjutnya untuk belajar langkah lain dari pengoperasian JOSM. Yang penting disini, peserta tidak boleh dipermalukan karena kekurangan mereka terhadap pengoperasian internet.

source: **d. Adults prefer individual attention when learning**
id: **d. Orang dewasa menyukai pembelajaran yang menunjukkan perhatian secara individual**

source: Know their needs, fulfill their individual needs such as break, food, drink etc. Engage them in discussion about planning targets, and assist them in achieving them. Never hesitate to ask for their opinion in writing, during sessions or informally outside training sessions. They appreciate having their personal interests listened to.
id: Ketahuilah kebutuhan-kebutuhan mereka, penuhi kebutuhan individual seperti rehat, makan, minum dan sebagainya. Ajak mereka merencanakan target-target dan bantulah mencapai target tersebut. Jangan segan pula untuk meminta masukan-masukan dari mereka baik secara tertulis, dalam sesi-sesi maupun secara informal di luar sesi pelatihan. Mereka suka jika minat-minat pribadi mereka diperhatikan.

source: The success of adult learning strategies also hinges on an agreeable learning atmosphere conducive to learning. A conducive atmosphere to learning according to Suprijanto (2007) constitutes the following:
id: Keberhasilan strategi belajar orang dewasa perlu didukung dengan suasan belajar yang kondusif. Suasana belajar yang kondusif bagi orang dewasa menurut Suprijanto (2007) adalah

source: An atmosphere that encourages participants to be active and develop their skills
id: Mendorong peserta didik untuk aktif dan mengembangkan bakat

source: An atmosphere of mutual respect and appreciation
id: Suasana saling menghormati dan saling menghargai

source: An atmosphere of mutual trust and openness
id: Suasana saling percaya dan terbuka

source: An atmosphere of self-discovery
id: Suasana penemuan diri

source: An atmosphere that is non-threatening
id: Suasana tidak mengancam

source: An atmosphere of acknowledging self-distinctness
id: Suasana mengakui kekhasan pribadi

source: An atmosphere that allows room for difference, mistakes and doubts
id: Suasana memperbolehkan perbedaan, berbuat salah, dan keraguan

source: An atmosphere that enables participants to learn according to their interest, attention, and resources in their locality
id: Memungkinkan peserta belajar sesuai dengan minat, perhatian, dan sumber daya lingkungannya

source: An atmosphere that enables participants to acknowledge and explore weaknesses and strengths of themselves as individuals, their groups and society
id: Memungkinkan peserta mengakui dan mengkaji kelemahan dan kekuatan pribadi, kelompok, dan masyarakatnya

source: An atmosphere that enables participants to grow with values and norms in their community
id: Memungkinkannya peserta tumbuh sesuai dengan nilai dan norma yang ada di masyarakat

source: Evaluation is an activity to determine how far a learning program is implemented according to expectations. Therefore, evaluation is focused on activities to determine how far a program is successful (micro: facilitator, macro: institution). According to Fajar, A., (2002), evaluation can be defined as an effort to gain various kinds of information periodically, continuously and comprehensively about learning process and outcome, as well as the growth and development of participants’ attitudes and behaviors. The above definition shows that evaluation is also carried out during training program and not only at the end of training. Evaluation constitutes a process to paint a picture of changes among participants after training. The word process means that evaluation is a continuous endeavor, using certain methods to reach expected outcome. This process also sees that evaluation is conducted by gathering facts in a systematic way. This definition shows that an evaluation requires data gathering or measurement.
id: Evaluasi atau penilaian adalah suatu kegiatan untuk menetapkan seberapa jauh program pembelajaran dapat diimplementasikan sesuai harapan. Dengan demikian penilaian atau evaluasi difokuskan pada kegiatan untuk menentukan seberapa jauh keberhasilan program (mikro: fasilitator, makro: lembaga). Menurut Fajar, A., (2002), penilaian dapat diartikan sebagai suatu usaha untuk memperoleh berbagai informasi secara berkala, berkesinambungan, dan menyeluruh tentang proses dan hasil belajar, pertumbuhan serta perkembangan sikap dan perilaku yang dicapai peserta. Pengetian di atas menunjukkan bahwa evaluasi dilakukan selama program pelatihan, tidak dilakukan di akhir pelatihan saja. Evaluasi merupakan suatu proses untuk menggambarkan perubahan dari diri peserta setelah pelatihan. Proses memberi arti bahwa evaluasi dilakukan secara terus menerus dan berkesinambungan, dengan cara tertentu sehingga mendapat hasil sesuai yang diharapkan. Di sana juga digambarkan bahwa dalam penilaian dilakukan dengan mengumpulkan kenyataan secara sistematis. Hal ini memperlihatkan bahwa di dalam evaluasi diperlukan pengambilan data atau disebut pengukuran.

source: The techniques, methods or tools of evaluation comprise all methods or procedures taken to gather information or data needed as material to evaluate. The techniques used in evaluation play an important role in the outcome. Basically, evaluation techniques or methods can be divided into two types i.e . test technique or method and non-test technique or method. In cognitive aspects, a test in the form of questions (both in writing or verbally) can be used. It is expected that this aspect can enhance the affective aspect of training participants. Affective aspect can be identified through observation and questionnaire, while psycho-motor aspect can be evaluated through activities conducted and results achieved.
id: Teknik, metode atau alat evaluasi adalah segala macam cara atau prosedur yang ditempuh untuk memperoleh keterangan-keterangan atau data-data yang dipergunakan sebagai bahan untuk mengadakan penilaian. Dengan demikian teknik ini sangat mempengaruhi hasil yang akan diperoleh. Pada dasarnya teknik atau metode penilaian dapat dibedakan menjadi dua, yaitu teknik atau metode tes dan teknik atau metode non tes. Pada aspek kognitif dapat digunakan soal-soal tes, (baik lisan ataupun tertulis). Diharapkan aspek ini dapat meningkatkan aspek afektif peserta pelatihan. Aspek afektif dapat dilakukan melalui observasi dan kuesioner, dan aspek psikomotorik dapat dinilai melalui kegiatan dan hasil yang dicapai.

source: The theory of evaluation above is actually similar in both pedagogy and andragogy, with the difference being only in ways of evaluating. In adult learning, the evaluation method must reflect freedom in that the evaluation must come from the person learning, not forced from outside. This implies that adults must be able to evaluate themselves. Therefore, the term ‘test’ for adults should be referred to more appropriately as self-examination. An example of evaluation method suitable for adults is as follows:
id: Teori evaluasi di atas sebenarnya sama antara pedagogi dan andragogi, hanya saja cara mengevaluasinya yang berbeda. Dalam pendidikan orang dewasa metode evaluasinya harus mencerminkan kebebasan, artinya evaluasinya harus datang dari yang belajar dan bukan dipaksakan dari luar. Pengertian di atas menunjukkan bahwa orang dewasa harus dapat menilai dirinya sendiri. Sehingga istilah “ujian” atau tes bagi orang dewasa lebih tepat digunakan istilah uji diri. Contoh metode evaluasi yang cocok untuk orang dewasa adalah sebagai berikut.
