Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/tot/501_adult_learning.po
Languages: id

source: Analyzing the characteristics of adult learning
id: Menganalisis karakteristik pembelajaran orang dewasa

source: Determining strategies, teaching methods or techniques that apply adult learning
id: Mengidentifikasi strategi, metode pembelajaran atau teknik yang digunakan dalam pembelajaran orang dewasa

source: Evaluating adult learning
id: Mengevaluasi pembelajaran orang dewasa

source: **Adult Learning**
id: **Pembelajaran Orang Dewasa**

source: Principles of adult learning
id: Prinsip pembelajaran orang dewasa

source: Characteristics of adult learning
id: Karakteristik pembelajaran orang dewasa

source: Adult learning evaluation
id: Evaluasi pembelajaran orang dewasa

source: **1. Opening and workshop information**
id: **1. Pembukaan dan informasi lokakarya**

source: Time: 10 minutes Material: Slide PPT Activity:
id: Waktu: 10 menit Material: Slide PPT Aktivitas:

source: Facilitator welcomes participants to the training; opening invocation
id: Fasilitator mengucapkan selamat datang di pelatihan dan doa pembukaan

source: Information on code of conduct during training
id: Informasi tata tertib pelatihan

source: Facilitator explains the topics and goals of session one
id: Fasilitator menjelaskan topik dan tujuan sesi satu

source: **2. QA Session about Adult Learning Characteristic**
id: **2. Sesi Tanya Jawab tentang Karakteristik Pembelajaran Orang Dewasa**

source: Time: 25 minutes Material: Slide PPT Activity:
id: Waktu: 25 menit Material: Slide PPT Aktivitas:

source: Facilitator puts a question about the definition and characteristics of an adult
id: Fasilitator mengajukan pertanyaan tentang pengertian ciri orang dewasa

source: Facilitator explains the definition of adult learning
id: Fasilitator menjelaskan pengertian pembelajaran orang dewasa

source: Facilitator puts a question about adult learning characteristics and principles.
id: Fasilitator mengajukan pertanyaan karakteristik dan prinsip pembelajaran orang dewasa.

source: **3. Group Discussion: Adult Learning Strategy**
id: ** 3. Diskusi Kelompok: Strategi Pembelajaran Orang Dewasa**

source: Time: 25 minutes Material: Plano Paper Activity:
id: Waktu: 25 menit Material: Kertas Plano Aktivitas:

source: Facilitator asks participants to each count 1 to 4 one after another and divides them into 4 groups. Those mentioning same number form one group.
id: Fasilitator mengajak peserta untuk berhitung 1 sampai 4 satu demi satu dan membaginya menjadi 4 kelompok. Mereka menyebutkan bentuk nomor yang sama satu kelompok.

source: Each group elects its chief and secretary
id: Setiap kelompok memilih ketua kelompok dan sekretaris

source: The chief presides at discussion on adult learning strategies, the outcome of which is written down on flipchart paper by the secretary.
id: Ketua kelompok memimpin diskusi strategi pembelajaran orang dewasa dan hasil diskusinya dituliskan pada kertas plano oleh sekretaris.

source: **4. Group Presentation**
id: **4. Presentasi Kelompok**

source: Time: 20 minutes Material: Slide PPT/Plano Paper Activity:
id: Waktu: 20 menit Material: Slide PPT/Kertas Plano Aktivitas:

source: Facilitator asks the chief of each group to move forward and take part in a draw to decide which group is responsible as presenter.
id: Fasilitator meminta seluruh ketua kelompok maju ke depan dan melakukan undian. Kelompok yang paling kalah menjadi presenter.

source: Facilitator asks other groups to put questions or give comments to the presenter group; Facilitator leads the Q&A session
id: Fasilitator meminta kelompok lain untuk mengajukan pertanyaan atau komentar kepada kelompok presenter; Fasilitator memfasilitasi tanya-jawab

source: Facilitator mentions adult learning strategies not yet mentioned.
id: Fasilitator melengkapi strategi pembelajaran orang dewasa yang belum disebutkan.

source: **5. Pair Discussion**
id: **5. Diskusi Berpasangan**

source: Time: 20 minutes Material: HVS Paper Activity:
id: Waktu: 20 menit Material: Kertas HVS Aktivitas:

source: Facilitator asks participants to find a partner
id: Fasilitator meminta peserta untuk berpasangan

source: Each group of two is asked to discuss how to evaluate adults (adult earning evaluation)
id: Setiap pasangan diminta mendiskusikan bagaimana sebaiknya mengevaluasi orang dewasa (evaluasi pembelajaran orang dewasa)

source: Result of discussion is displayed before the class
id: Hasil diskusi pasangan dipajang di depan kelas

source: With the sound of music as the background, facilitator randomly throws a small ball at a participant who will then throw it to another group. The group who is in possession of the ball when the music stops will become presenter.
id: Dengan menggunakan musik sebagai latar belakang, fasilitator memilih acak dengan melempar bola kecil ke peserta, peserta yang menerima bola diminta melemparkan ke kelompok lain. Ketika musik berhenti, kelompok dari peserta yang menerima bola menjadi presenter

source: Facilitator asks other groups to put questions or give comments to the presenter. Facilitator leads the Q&A session.
id: Fasilitator meminta kelompok lain untuk mengajukan pertanyaan atau komentar kepada kelompok presenter. Fasilitator memfasilitasi tanya-jawab

source: Facilitator further explains adult learning evaluation
id: Fasilitator melengkapi penjelasan tentang evaluasi pembelajaran orang dewasa

source: **6. Reflection and Closing**
id: **6. Refleksi dan Penutupan**

source: Time: 5 minutes Material: - Activity:
id: Waktu: 5 menit Material: - Aktivitas:

source: Reading Material
id: Bahan Bacaan

source: Adult Learning or Education is known as Andragogy, the antonym of Pedagogy (children education). The term andragogy is derived from latin words Andro (Adult) and agogos which means to lead or guide, hence the term andragogy can be defined as the science of how to lead or guide adults, in other words: the science of teaching adults.
id: Pembelajaran atau Pendidikan Orang Dewasa dikenal dengan istilah Andragogi, sebagai lawan dari pedagogi (pendidikan anak-anak). Andragogi berasal dari bahasa latin Andro yang berarti orang dewasa (Adult) dan agogos yang berarti memimpin atau membimbing. Jadi andragogi adalah ilmu bagaimana memimpin atau membimbing orang dewasa atau ilmu mengajar orang dewasa.

source: Basically education is a process of facilitating a person to search and find the knowledge needed in life through learning, rendering all human activities potential to be used as part of learning process. Andragogy strategy stimulates adults to engage in the process of searching and finding the knowledge they need in life. Adults learn in a continuous way from their experience.
id: Pada dasarnya, pendidikan adalah proses memfasilitasi seseorang untuk mencari dan menemukan ilmu pengetahuan yang dibutuhkan dalam kehidupan melalui proses belajar, sehingga semua kegiatan manusia memiliki potensi yang dipergunakan untuk belajar. Andragogi menstimulasi orang dewasa agar mampu melakukan proses pencarian dan penemuan ilmu pengetahuan yang mereka butuhkan dalam kehidupan. Belajar orang dewasa dilakukan secara berlanjut dari pengalaman kehidupan.

source: Adult education is an endeavor aimed at self development made by individuals without legal forces, without making this endeavor their main activity (Reeves, Fansler, and Houle in Supriyanto, 2007). According to UNESCO (Townsend Coles 1977 in Lanundi (1982), adult education is defined as the entire body of organized educational processes, whatever the content, level and method, whether formal or otherwise, whether they prolong or replace initial education in schools, colleges and universities as well as in apprenticeship, whereby persons regarded as adult by the society to which they belong develop their abilities, enrich their knowledge, improve their technical or professional qualifications and bring about changes in their attitudes or behavior in the twofold perspective of full personal development and participation in balanced and independent social, economic and cultural development. Meanwhile, according to Bryson in Supriyanto (2007) Adult education comprises all educational activities in which adults engage in their daily life using only a part of their time and energy in order to gain additional intellectual knowledge.
id: Pendidikan orang dewasa adalah suatu usaha yang ditujukan untuk pengembangan diri yang dilakukan oleh individu tanpa paksaan legal, tanpa usaha menjadikan bidang utama kegiatannya (Reeves, Fansler, dan Houle dalam Supriyanto, 2007). Menurut UNESCO (Townsend Coles 1977 dalam Lanundi (1982), Pendidikan orang dewasa adalah keseluruhan proses pendidikan yang diorganisasikan apa pun isi, tingkatan, metodenya, baik formal atau tidak, yang melanjutkan maupun menggantikan pendidikan semula di sekolah, akademi dan universitas serta latihan kerja, yang membuat orang yang dianggap dewasa oleh masyarakat mengembangkan kemampuannya, memperkarya pengetahuannya, meningkatkan kualifikasi teknis atau profesuonalnya, dan mengakibatkan perubahan pada sikap dan perilakunya dalam perspektif rangkap perkembangan pribadi secara utuh dan partisipasi dalam pengembangan sosial, ekonomi, dan budaya yang seimbang dan bebas. Sedangkan menurut Bryson dalam Supriyanto (2007) Pendidikan orang dewasa adalah semua aktivitas pendidikan yang dilakukan oleh orang dewasa dalam kehidupan sehari-hari yang hanya menggunakan sebagian waktu dan tenaganya untuk mendapatkan tambahan itelektual.

source: The definition above shows that:
id: Definisi di atas menunjukkan bahwa:

source: Adults are normally capable of self-directing,
id: Orang dewasa memiliki kemampuan mengarahkan diri sendiri.

source: Adults have varied experiences,
id: Orang dewasa memiliki beragam pengalaman,

source: Adults are prepared to learn as a consequence of their position in transition of development,
id: Orang dewasa dipersiapkan untuk belajar sebagai konsekuensi dari posisi mereka dalam transisi pembangunan,

source: Adults prefer problem-centerd or performance-centered learning.
id: Orang dewasa lebih menyenangi belajar yang bersifat *problem-centered* atau *performance-centered*.

source: The following are complete characteristics of adults:
id: Karakteristik belajar orang dewasa dapat dirumuskan sebagai berikut:

source: Adults have the ability to self-direct.
id: Orang dewasa memiliki kemampuan mengarahkan diri sendiri.

source: Adults have a lot of experience which functions as learning process for them.
id: Orang dewasa mepunyai pengalaman yang banyak dan fungsi pengalaman bagi orang dewasa sebagai sumber belajar.

source: Adults are prepared to learn everything they need to learn; their experience is built from problem solving or finding solutions to daily tasks.
id: Orang dewasa siap mempelajari sesuatu yang ia perlukan dan pengalaman terbangun dari pemecahan masalah atau menyelesaikan tugas sehari-hari.

source: Orientation of learning: Education is a development process of self ability; knowledge and skills are applied for a better life. Learning orientation is focused on activities.
id: Orientasi belajar: Pendidikan merupakan suatu proses pengembangan kemampuan diri, ilmu dan keterampilan akan diterapkan untuk mencapai kehidupan yang lebih baik, orientasi belajar terpusat pada kegiatan

source: The characteristics of adult learning according to Soedomo (1989) in Supriyadi (2007):
id: Ciri-ciri belajar orang dewasa menurut Soedomo (1989) dalam Supriyadi (2007) adalah:

source: Adult learning facilitates exchanges of opinions, demands and values
id: Memungkinkan timbulnya pertukaran pendapat, tuntutan, dan nilai-nilai

source: It facilitates a two-way communication
id: Memungkinkan terjadinya komunikasi timbal balik

source: Learning atmosphere expected is one that is fun and challenging
id: Suasana belajar yang diharapkan adalah suasana yang menyenangkan dan menantang

source: It prioritizes the roles of learning participants
id: Mengutamakan peran peserta didik

source: Adults learn when their opinion is respected
id: Orang dewasa akan belajar jika pendapatnya dihormati

source: Adults learn in a unique way
id: Belajar orang dewasa bersifat unik

source: There needs to be a trust between mentor and learners
id: Perlu adanya saling percaya antara pembimbing dan peserta didik

source: Opinions are generally varied among adults
id: Orang dewasa umumnya mempunyai pendapat yang berbeda

source: Adults have varied intelligence
id: Orang dewasa memiliki kecerdasan yang beragam

source: Various learning methods may emerge
id: Kemungkinan terjadinya berbagai cara belajar

source: Adults learn to know their strong points and shortcomings
id: Orang dewasa belajar ingin mengetahui kelebihan dan kekurangannya

source: Learning orientation for adults is focused on real life
id: Orientasi belakar orang dewasa terpusat pada kehidupan nyata

source: Adults self--motivate
id: Motivasi dari dirinya sendiri

source: The characteristics of adult learning can be elaborated as follows:
id: Karakteristik belajar orang dewasa dapat dirumuskan sebagai berikut:

source: Adults learn because of demands in their work, for self-development or the desire to enhance their role. In contrast with children who tend to receive learning material conveyed by their teacher, adults learn something when it meets their work demands, is crucial for self-development and their role enhancement. To this end, in adult learning, it is important to explain to adults taking part in learning process the relations between material presented and the demands in their work, roles and their needs of self development.
id: Orang dewasa belajar karena adanya tuntutan tugas, tuntutan perkembangan atau keinginan peningkatan peran. Berbeda dengan anak-anak yang cenderung menerima materi pelajaran yang disampaikan oleh guru, orang dewasa akan belajar manakala pembelajaran ini dapat memenuhi tuntutan tugas, tuntutan perkembangan, dan tuntutan akibat peningkatan peran. Karenanya dalam pembelajaran orang dewasa perlu dijelaskan kaitan antara materi dengan tuntutan tugas, peran, dan tuntutan perkembangan mereka.

source: Adults prefer to learn things that are practical, can immediately be applied and bring benefits in their life. Adults generally have rich theoretical knowledge, hence the needs to have learning materials for adults that are practical and applicable.
id: Orang dewasa suka mempelajari sesuatu yang praktis, dapat langsung diterapkan, dan bermanfaat dalam kehidupannya. Orang dewasa kebanyakan telah kaya dengan pengetahuan-pengetahuan teoritis. Karenanya materi pelatihan orang dewasa sebaiknya dipilih yang praktis dan dapat diterapkan dalam kehidupannya.

source: In the process of learning, adults want to be treated as a mature person/ to be respected.
id: Orang dewasa dalam proses belajar ingin diperlakukan sebagai orang dewasa/dihargai

source: Adults have rich experience and insight and learn new things based on their experience. Every adult person generally has a lot of experience especially in the field s/he has been focusing on. When engaging adults in learning new things, it is better to build on their experience.
id: Orang dewasa kaya pengalaman dan berwawasan luas, mempelajari sesuatu yang baru berdasar pengalamannya. Setiap orang dewasa umumnya memiliki pengalaman yang sangat luas utamanya dalam bidang yang ditekuninya. Sebaiknya cara mempelajari sesuatu yang baru dimulai dari pengalaman-pengalaman mereka.

source: Adults learn by sharing their opinion with others. As they are rich in experience, sharing opinion is one of effective ways for them to learn.
id: Orang dewasa belajar dengan cara berbagi pendapat bersama orang lain. Karena mereka kaya pengalaman, berbagi pendapat merupakan salah satu cara efektif mereka dalam belajar.

source: Adults question why they have to learn something before they start to learn it. If children tend to receive certain topics without questioning, adults need to know whether something they are about to learn will bring them direct benefits.
id: Orang dewasa mempertanyakan mengapa harus mempelajari sesuatu sebelum mereka mempelajari sesuatu. Jika anak-anak cenderung menerima topik pembelajaran, orang dewasa perlu mengetahui bahwa hal-hal yang mereka pelajari merupakan hal yang bermanfaat langsung bagi mereka.

source: Adults focus on problem solving when learning; their orientation is not in the learning material. When they find what they learn suitable for solving problems they face, they learn well.
id: Orang dewasa belajar dengan memecahkan masalah tidak berorientasi pada bahan pelajaran Jika hal yang dipelajari dalam pelatihan dapat memecahkan masalah yang dialami, maka mereka akan belajar dengan baik.

source: Adults like an atmosphere of learning that promotes self-confidence. This is related to their desire to be respected. Start with simple things to increase their confidence.
id: Orang dewasa menyukai suasana pembelajaran yang membangkitkan kepercayaan diri. Hal ini berkaitan dengan keinginan untuk dihargai. Mulailah pembelajaran dengan hal-hal yang mudah sehingga kepercayaan diri mereka meningkat.

source: Adults need longer time to learn as they need to validate new information. When they receive information, they will validate it based on their experience.
id: Orang dewasa memerlukan waktu yang lebih panjang dalam belajar karena perlu memvalidasi informasi baru. Orang dewasa tidak sekedar menerima informasi melainkan memvalidasi informasi berdasarkan pengalaman-pengalaman mereka.

source: Adults will continue learning process when their learning experience is satisfactory.
id: Orang dewasa akan melanjutkan proses belajar jika pengalaman belajar yang dilaluinya memuaskan.

source: *The difference between Pedagogy and Andragogy*
id: *Perbedaan Pedagogi dan andragog*

source: Aspect
id: Aspek

source: Pedagogy
id: Pedagogi

source: Andragogy
id: Andragogi

source: Trainee’s self concept
id: Konsep tentang diri peserta didik

source: Dependent
id: Bersifat tergantung

source: Ability in self-directing
id: Memiliki kemampuan mengarahkan diri sendiri

source: Function of trainee's experience
id: Fungsi pengalaman peserta didik

source: Little experience
id: Pengalaman sedikit

source: Experience as point of departure in building experience
id: Pengalaman sebagai titik awal untuk membangun pengalaman

source: A lot of experience
id: Pengalaman banyak

source: Experience as learning source
id: Pengalaman sebagai sumber belajar

source: Learning preparedness
id: Kesiapan Belajar

source: Uniformity based on age
id: Diseragamkan berdasarkan usia

source: Organized in a curriculum
id: Diorganisasi dalam suatu kurikulum

source: Prepared to learn what is needed
id: Siap mempelajari sesuatu yang ia perlukan

source: Based on problem solving or finding solution to daily task
id: Berdasarkan dari pemecahan masalah atau menyelesaikan tugas sehari-hari

source: Learning orientation
id: Orientasi belajar

source: Education as a process of conveying knowledge
id: Pendidikan merupakan suatu proses penyampaian ilmu pengetahuan.

source: The knowledge will bring benefit in the future
id: Ilmu tersebut baru bermanfaat di kemudian hari

source: Orientation to learning subjects
id: Orientasi belajar ke arah mata pelajaran

source: Education as a process to develop selfability
id: Pendidikan merupakan suatu proses pengembangan kemampuan diri

source: Knowledge and skills are applied for a better life
id: Ilmu dan keterampilan akan diterapkan untuk mencapai kehidupan yang lebih baik

source: Orientation is focused on activities
id: Orientasi belajar terpusat pada kegiatan

source: In adult learning, there are principles that differentiate it from other types of education. These principles can create an effective and efficient learning atmosphere. The principles can be explained as follows:
id: Pendidikan orang dewasa memiliki prinsip yang membedakannya dengan jenis pendidikan yang lain. Prinsip pendidikan orang dewasa tersebut, dapat menciptakan suasana pembelajaran yang efektif dan efisien. Prinsip tersebut dapat dijelaskan sebagai berikut.

source: Principle of partnership: The principle of partnership guarantees a forged partnership between facilitator and participants. The participants are not treated as students but as learning partners. The relationship created is not one of giving orders but of assistance in that trainers will put their best effort to assist training participants.
id: Prinsip kemitraan: Prinsip kemitraan menjamin terjalinnya kemitraan di antara fasilitator dan peserta. Dengan demikian peserta tidak diperlakuan sebagai siswa tetapi sebagai mitra belajar sehingga hubungan yang mereka bangun bukanlah hubungan yang bersifat memerintah, tetapi hubungan yang bersifat membantu, yaitu pengajar akan berusaha semaksimal mungkin untuk membantu proses belajar peserta pelatihan.

source: Principle of real experience: This principle guarantees that adult learning and education is conducted in real life situation. Adult learning and education activities are not conducted in a class or simulated situation, but in a real situation.
id: Prinsip pengalaman nyata: Prinsip pengalaman nyata menjamin berlangsungnya kegiatan pembelajaran pendidikan orang dewasa terjadi dalam situasi kehidupan yang nyata. Kegiatan pembelajaran pendidikan orang dewasa tidak berlangsung di kelas atau situasi yang simulatif, tetapi pada situasi yang sebenarnya.

source: Principle of togetherness: This principle requires the use of group activities in adult learning and education to guarantee maximum interaction between participants facilitated by the facilitator.
id: Prinsip kebersamaan: Prinsip kebersamaan menuntut digunakannya kelompok dalam kegiatan pembelajaran pendidikan orang dewasa untuk menjamin adanya interaksi yang maksimal di antara peserta dengan difasilitasi fasilitator.

source: Principle of participation: This principle seeks to encourage maximum participants’ involvement in learning process, facilitated by the participants themselves. In adult learning and education activities all participants are to take active part in the whole process of learning from planning, implementation and evaluation of learning activities.
id: Prinsip partisipasi: Prinsip partisipasi adalah untuk mendorong keterlibatan peserta secara maksimal dalam kegiatan pembelajaran orang dewasa, dengan fasilitas dari peserta. Dalam kegiatan pembelajaran pendidikan orang dewasa semua peserta harus terlibat atau mengambil bagian secara aktif dari seluruh proses pembelajaran mulai dari perencanaan, pelaksanaan, dan evaluasi pembelajaran.

source: Principle of self-reliance: This principle encourages participants independence in seeking learning goals. Adult learning seeks to produce independent human being able to play the role of subject or actor, hence the need for self-reliance principle.
id: Prinsip kemandirian: Prinsip ini mendorong peserta untuk memiliki kebebasan dalam mencari tujuan pembelajaran. Pembelajaran orang dewasa berusaha untuk menghasilkan manusia independen mampu memainkan peran subjek atau aktor, kebutuhan untuk prinsip kemandirian.

source: Principle of sustainability: This principle guarantees continuity between the material that is being learned at present, that has been learned and that will be learned in the future. With this principle, the concept of life long education in adult learning will materialize.
id: Prinsip kesinambungan: Prinsip yang menjamin adanya kesinambungan dari materi yang dipelajari sekarang dengan materi yang telah dipelajari di masa yang lalu dan dengan materi yang akan dipelajari di waktu yang akan datang. Dengan prinsip ini maka akan terwujud konsep pendidikan seumur hidup dalam pendidikan orang dewasa.
