Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/tot/501_adult_learning.po
Languages: id

source: Feedback: each participant is given an opportunity to express their thoughts and feeling regarding the lesson presented.
id: Umpan balik: Setiap peserta diberi kesempatan untuk mengemukakan pikiran dan perasaan mengenai pelajaran yang baru berlangsung.

source: Reflection: participants are given the opportunity to reflect. Reflection is subjective and personal so facilitators need not to respond.
id: Refleksi: Peserta diberi kesempatan untuk mengungkapkan refleksinya. Refleksi bersifat subjektif yang khas pribadi, sehingga tidak perlu ditanggapi oleh fasilitator.

source: Group discussion: participants are given the opportunity to discuss their respective evaluation result and put it in a report.
id: Diskusi kelompok: Peserta diberi kesempatan untuk mendiskusikan hasil evaluasi masing-masing dan menuangkannya dalam sebuah laporan.

source: Questionnaire: a form with list of questions prepared for participants to answer.
id: Questionnaire: Penilaian dengan disiapkan formulir pertanyaan yang telah disiapkan dan diisi oleh peserta pelatihan.

source: Management team: a team is formed consisting a number of participants as moderator, note taker and evaluator. This team is in charge of writing a brief and concise report and writing evaluation for the day’s activities.
id: Tim pengelola: Diantara peserta dibentuk sebuah tim yang terdiri dari moderator, pencatat, dan evaluator. Tim ini bertugas untuk membuat laporan singkat padat dan menyusun evaluasi dari acara seharian.

source: The above methods can be completed with Performance Evaluation, an assessment which constitutes a non-test evaluation conducted by observing participants’ activities. This evaluation is suitable to evaluate how far participants achieve certain competencies in carrying out certain tasks: practice and simulation. In performance evaluation, the following points need consideration:
id: Cara di atas dapat dibantu degan Penilaian Unjuk Kerja/Performance. Penilaian Unjuk Kerja mengamati kegiatan peserta dalam melakukan sesuatu. Penilaian ini cocok digunakan untuk menilai ketercapaian kompetensi yang menuntut peserta melakukan tugas tertentu seperti: praktek dan simulasi. Penilaian unjuk kerja perlu mempertimbangkan hal-hal berikut:

source: Performance steps expected from participants to be carried out to show their level of competency.
id: Langkah-langkah kinerja yang diharapkan dilakukan peserta untuk menunjukkan kinerja dari suatu kompetensi.

source: The completeness and precision of aspects to be evaluated in the performance.
id: Kelengkapan dan ketepatan aspek yang akan dinilai dalam kinerja tersebut.

source: Specific abilities needed to carry out tasks.
id: Kemampuan-kemampuan khusus yang diperlukan untuk menyelesaikan tugas.

source: When possible, skills to be evaluated are not too many to provide enough time for a thorough observation.
id: Upayakan kemampuan yang akan dinilai tidak terlalu banyak, sehingga semua dapat diamati.

source: Skills to be evaluated is listed based on the first to the last aspects observed.
id: Kemampuan yang akan dinilai diurutkan berdasarkan urutan pengamatan.

source: *Performance Evaluation Techniques*
id: **Teknik Penilaian Unjuk Kerja**

source: Performance observation needs to be carried out in various contexts to determine the level of competence of certain skills. The following tools or instruments may be used to observe participants performance:
id: Pengamatan unjuk kerja perlu dilakukan dalam berbagai konteks untuk menetapkan tingkat pencapaian kemampuan tertentu. Untuk mengamati unjuk kerja peserta dapat menggunakan alat atau instrumen berikut:

source: Check list
id: Daftar Cek / *Check-list*

source: Performance evaluation can be conducted using a check list (yes-no questions). With this check list, participants will get points when certain criteria of mastering certain competency are observed by evaluators. In the event no competency is observed, participants will not get any point. The weakness of this method is that evaluators only have two absolute options, right or wrong; observed and not observed. There is no middle ground. Nevertheless, check list is more practical to be used to observe subjects in great number. The following is an example of a check list.
id: Penilaian unjuk kerja dapat dilakukan dengan menggunakan daftar cek (ya-tidak). Penilaian unjuk kerja yang menggunakan daftar cek, peserta mendapat nilai bila kriteria penguasaan kompetensi tertentu dapat diamati oleh penilai. Jika tidak dapat diamati, peserta tidak memperoleh nilai. Kelemahan cara ini adalah penilai hanya mempunyai dua pilihan mutlak, misalnya benar-salah, dapat diamati-tidak dapat diamati. Dengan demikian tidak terdapat nilai tengah, namun daftar cek lebih praktis digunakan mengamati subjek dalam jumlah besar. Berikut contoh daftar cek.

source: **Example of checklist**
id: **Contoh checklists**

source: Scoring Aspect
id: Aspek yang dinilai

source: Good
id: Baik

source: Not Good
id: Tidak baik

source: Total Score
id: Skor yang dicapai

source: Maximum Score
id: Skor Maksimum

source: Rating scale
id: Skala Penilaian / *Rating Scale*

source: Performance evaluation using rating scale enables evaluators to give median scores for mastery of certain competencies, as scores are given in a continuum where there are more than two options of scoring category. Evaluation scale is spread from not perfect to very perfect. For example, 1 = not competent, 2 = sufficiently competent, 3 = competent and 4 = very competent. The following is an example of rating scale.
id: Penilaian unjuk kerja yang menggunakan skala penilaian memungkinkan penilai memberi nilai tengah terhadap penguasaan kompetensi tertentu, karena pemberian nilai secara kontinum di mana pilihan kategori nilai lebih dari dua. Skala penilaian terentang dari tidak sempurna sampai sangat sempurna. Misalnya: 1 = tidak kompeten, 2 = cukup kompeten, 3 = kompeten dan 4 = sangat kompeten. Berikut contoh skala penilaian.

source: **Example of rating scale**
id: **Skala Penilaian**

source: Score
id: Nilai

source: Remarks:
id: Keterangan penilaian:

source: 1 = Not competent 2 = Sufficiently Competent 3 = Competent 4 = Very competent
id: 1 = Tidak kompeten 2 = Cukup kompeten 3 = Kompeten 4 = Sangat kompeten

source: In the event a participant gains a score of 16, s/he can be qualified as "very competent". Other qualification is also determined according to scores obtained. In school settings, this performance evaluation can be carried out by teachers. For adults, it is the responsibility of facilitators together with training participants. The forms that have been filled out can serve as a matter of discussion or records for management team.
id: Jika seorang peserta memperoleh skor 16 dapat ditetapkan ”sangat kompeten”. Dan seterusnya sesuai dengan jumlah skor perolehan. Penilaian unjuk kerja ini apabila dilakukan di persekolahan bisa diisi oleh guru, tetapi untuk pembelajaran orang dewasa dapat diisi fasilitator bersama-sama dengan peserta. Dan isian tersebut sebagai bahan untuk didiskusikan atau pencatatan oleh tim pengelola.

source: **Bibliography**
id: **Daftar Bacaan**
