Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/tot/502_communication_skills.po
Languages: id

source: To find out to which extent the participants’ skill in regards to the answer, the tracing skill that needs to be mastered by the trainer. Tracing can be done by asking participants to give explanation on the answer, giving a reason, providing relevant examples, etc.
id: Untuk mengetahui sejauh mana kemampuan peserta yang berkaitan dengan jawaban yang dikemukakan, keterampilan melacak perlu dipunyai oleh pelatih. Melacak dapat dikerjakan dengan meminta peserta untuk memberikan penjelasan tentang jawabannya, memberikan alasan, memberikan contoh yang relevan, dan sebagainya.

source: The skill to encourage interaction between participants
id: Keterampilan mendorong terjadinya interaksi antar peserta.

source: **d. Skills to provide reinforcement**
id: **d. Keterampilan Dasar Memberi Penguatan**

source: There are two kinds of reinforcements, positive and negative reinforcement. Positive reinforcement is the trainer’s behavior in responding positively to a particular behavior of participants that allows such behavior to reoccur. While negative reinforcement is the removal or a reduction of unpleasant stimuli to encourage the reoccurrence of the behavior that arises as the result of the reduction or removal.
id: Penguatan ada dua macam, yaitu penguatan positif dan penguatan negatif. Penguatan positif adalah tingkah laku pelatih dalam merespons secara positif suatu tingkah laku tertentu dari peserta yang memungkinkan tingkah laku tersebut timbul kembali. Sedangkan penguatan negatif adalah pengurangan hingga penghilangan suatu stimulus yang tidak menyenangkan untuk mendorong terulang kembali suatu tingkah laku yang timbul yang sebagai akibat dari pengurangan atau penghilangan tersebut.

source: The purpose of reinforcement is to:
id: Tujuan penguatan adalah:

source: increase the participants’ attention
id: Meningkatkan perhatian peserta.

source: Smoothen/ facilitate the learning process
id: Melancarkan/memudahkan proses pembelajaran.

source: Generating and maintaining motivation
id: Membangkitkan dan mempertahankan motivasi.

source: Controlling or changing disturbing attitudes and behavior
id: Mengontrol atau mengubah sikap dan tingkah laku yang mengganggu.

source: Developing and organizing themselves in learning
id: Mengembangkan dan mengatur diri sendiri dalam belajar.

source: Driving the way of thinking that is good / divergent and personal initiative
id: Mengarahkan kepada cara berfikir yang baik/divergen dan inisiatif pribadi.

source: Reinforcement is given during:
id: Pemberian penguatan diberikan pada saat:

source: Attention to the coach, friend, or the object of discussion
id: Perhatian pada pelatih, kawan, atau objek diskusi.

source: The study, reading, working on the board behavior
id: Tingkah laku belajar, membaca, pekerjaan di papan tulis.

source: The completion of work
id: Penyelesaian hasil pekerjaan

source: The quality of work/ tasks (grooming, beauty)
id: Kualitas pekerjaan/tugas (kerapian, keindahan)

source: Repair/ improvement tasks
id: Perbaikan/penyempurnaan tugas.

source: Independent tasks
id: Tugas-tugas mandiri

source: **Components of Reinforcement Basic Skills**
id: **Komponen Keterampilan Dasar Penguatan**

source: The use of in-class skill components should be carefully selected, tailored to the participants' ages, capability level, needs and background, the purpose and nature of the task. Reinforcement must be meaningful from the participants.
id: Penggunaan komponen keterampilan dalam kelas harus bersifat selektif berhati-hati, disesuaikan dengan usia peserta, tingkat kemampuan, kebutuhan serta latar belakang, tujuan dan sifat tugas. Pemberian penguatan harus bermakna dari peserta.

source: Some components of providing reinforcement are:
id: Beberapa komponen keterampilan memberi penguatan adalah:

source: Positive reinforcement
id: Penguatan Positif

source: Verbal reinforcement
id: Penguatan verbal

source: Reinforcement can be verbal words that are spoken by the teacher. Examples of it are good, well, precise, I appreciate the income, very intelligent mind, etc.
id: Penguatan verbal dapat berupa kata-kata kalimat yang diucapkan guru. Contoh, “baik”, “bagus”, “tepat”, “saya sangat menghargai pendapatan”, “pikiranmu sangat cerdas”, dan lain-lain.

source: Gestural reinforcement
id: Penguatan gestural

source: This reinforcement is given in the form of gestures, facial or limb movements that can give the impression to the students. For example: Lifting an eyebrow, smiling, leering eyes, applause, nodding in agreement, raising the thumb sign, etc.
id: Penguatan ini diberikan dalam bentuk mimik, gerakan wajah atau anggota badan yang dapat memberikan kesan kepada siswa. Misal : Mengangkat alis, tersenyum, kerlingan mata, tepuk tangan, anggukan tanda setuju, menaikkan ibu jari tanda “jempolan”, dan lain-lain.

source: Approaching reinforcement
id: Penguatan dengan cara mendekati

source: This reinforcement is done by approaching students to express the trainer’s concern for the work, behavior or appearance of the participants. For example: the trainer sits in a group, stands next to a participant. Often the trainer approaches participants to give them verbal reinforcement.
id: Penguatan ini dikerjakan dengan cara mendekati siswa untuk menyatakan perhatian pelatih terhadap pekerjaan, tingkah laku atau penampilan peserta. Misalnya: pelatih duduk dalam kelompok, berdiri disamping peserta. Seringkali pelatih mendekati peserta diberikan untuk memperkuat pengetahuan yang bersifat verbal.

source: Reinforcement through touches
id: Penguatan dengan sentuhan

source: A trainer can express appreciation to the participants by patting them, shaking their hands or raising their hands.
id: Pelatih dapat menyatakan penghargaan kepada peserta dengan menepuk pundak peserta, menjabat tangan peserta atau mengangkat tangan peserta.

source: Reinforcement by providing fun activities
id: Penguatan dengan memberikan kegiatan yang menyenangkan

source: This reinforcement may be in the form of asking participants to help his friends when he has finished his work properly, participants are asked to lead activities, etc.
id: Penguatan ini dapat berupa meminta peserta membantu temannya bila dia selesai mengerjakan pekerjaan terlebih dahulu dengan tepat, peserta diminta memimpin kegiatan dan lain-lain.

source: Symbolic reinforcement or with objects
id: Penguatan berupa tanda atau benda

source: This form of reinforcement is the trainer’s effort in using a variety of symbols to support the reinforcement of positive behavior of participants. This form of reinforcement include commentary written in the work book, giving stamps, money data collection, star, percentage and so on.
id: Penguatan bentuk ini merupakan usaha pelatih dalam menggunakan bermacam-macam simbol penguatan untuk menunjang tingkah laku peserta yang positif. Bentuk penguatan ini antara lain: komentar tertulis dalam buku pekerjaan, pemberian prangko, data uang koleksi, bintang, persen dan sebagainya.

source: Negative reinforcement
id: Penguatan negatif

source: The way this is done is the same with positive reinforcement, except that it is not pleasant for the participants in order to reduce or remove their actions.
id: Cara yang dilakukan dalam penguatan negatif sama dengan pemberian penguatan positif, hanya saja yang dilakukan yang tidak menyenangkan bagi peserta supaya dapat mengurangi atau menghilangkan tindakan peserta.

source: How to use the components:
id: Cara menggunakan komponen:

source: Varies
id: Bervariasi

source: Provide better reinforcement directly and immediately
id: Pemberian penguatan lebih baik diberikan secara langsung dan segera.

source: For certain purposes the use of reinforcement can never be given. For example, for participants who answered incorrectly, reinforcement is given to participants in the effort of answering but not on the quality of the answer. The trainer acts should be followed by asking the first participant to imitate the answer or giving consideration to his answer
id: Untuk keperluan tertentu penggunaan penguatan tidak pernah dapat diberikan. Misalnya kepada peserta yang menjawab salah, penguatan diberikan pada usaha peserta dalam menjawab dan bukan pada kualitas jawaban. Perbuatan pelatih ini segera dilanjutkan dengan meminta peserta pertama untuk menirukan jawaban atau memberikan pertimbangan kepada jawaban temannya.

source: Providing reinforcement is a behavior that is easier said than done. Therefore intensive exercises are done by the trainer candidates.
id: Memberikan penguatan merupakan tingkah laku yang mudah untuk diucapkan dan sukar dilakukan. Oleh karena itu, latihan-latihan yang intensif dikerjakan oleh calon pelatih.

source: **e. Basic skills in Using Variations**
id: **e. Keterampilan Dasar Menggunakan Variasi**

source: Using variations is defined as the trainer’s effort in in the context of the training process that aims to overcome the participants’ boredom in following the training, so that participants always show perseverance, as well as enthusiasm and active participation.
id: Menggunakan variasi diartikan sebagai perbuatan pelatih dalam konteks proses pelatihan yang bertujuan mengatasi kebosanan peserta, dalam mengikuti pelatihan, sehingga dalam proses belajarnya peserta senantiasa menunjukan ketekunan, keantusiaan serta berperan secara aktif.

source: Use in class is for:
id: Kegunaan dalam kelas untuk:

source: Maintaining and improving the participants in issues related to the learning aspects
id: Memelihara dan meningkatkan peserta terhadap hal-hal yang berkaitan dengan aspek belajar.

source: Improving the possibility of motivation and curiosity through investigation and exploration
id: Meningkatkan kemungkinan berfungsinya motivasi rasa ingin tahu melalui kegiatan investigasi dan eksplorasi.

source: Establishing a positive attitude towards the trainer
id: Membentuk sikap positif terhadap pelatih.

source: The possibility of individual participants to be served so that it gives the ease in learning
id: Kemungkinan dilayaninya peserta secara individual sehingga memberi kemudahann belajar.

source: Encouraging learning activities that engage participants in a variety of activities. Learning, interesting and useful in a variety of cognitive levels
id: Mendorong aktivitas belajar yang melibatkan peserta dalam berbagai kegiatan. Belajar, menarik dan berguna dalam berbagai tingkat kognitif.

source: **Components of Making Variations Skill**
id: **Komponen keterampilan mengadakan variasi**

source: Variation in training style
id: Variasi dalam gaya mengajar pelatih.

source: Variety of trainer’s teaching styles include these components:
id: Variasi gaya mengajar pelatih meliputi komponen-komponen:

source: Voice variation: loud weak, fast slow, high low, great and small
id: Variasi suara: keras lemah, cepat lambat, tinggi rendah, besar kecil.

source: Concentration of attention. Focusing attention can be done verbally, or by using capital symbols
id: Pemusatan perhatian. Pemusatan perhatian dapat dikerjakan secara verbal, isyarat atau dengan menggunakan modal.

source: Silence. By the time the trainer has finished explaining, activities are often observed to pause abruptly in a short moment
id: Kesenyapan. Pada saat pelatih menerangkan seringkali diperhatikan kegiatan berhenti sejenak secara tiba-tiba.

source: There is a time of silence when the trainer is moving from one teaching segment to the other
id: Ada kalanya diam sejenak diperlukan apabila pelatih akan berpindah dari segman mengajar ke segman mengajar yang lain.

source: Eye contact. To improve the relationship with the students and avoid impersonal things, then eye contact is required during teaching process
id: Kontak Pandang. Untuk meningkatkan hubungan dengan siswa dan menghindari hal-hal yang bersifat impersonal, maka kontak pandang perlu dikerjakan selama proses pengajaran

source: Gestures and lyrics: the change in face expression, head movement, body movement is very important in communication process
id: Gerakan badan dan lirik: Perubahan ekspersi wajah, gerakan kepala, badan, sangat penting dalam proses komunikasi

source: The change in trainer’s position. The participants’ attention can be improved by the change in trainer’s position in the communication interaction process
id: Perubahan posisi pelatih. Perhatian peserta dapat ditingkatkan melalui perubahan posisi pelatih dalam proses interaksi komunikasi.

source: Variations in the use of media and teaching materials
id: Variasi penggunaan media dan bahan pengajaran.

source: Variations in any type of media or variations between media type need to be considered in the learning process
id: Variasi di dalam setiap jenis media atau variasi antara jenis media perlu diperhatikan dalam proses belajar mengajar.

source: Variations of interaction pattern and participant’s activity
id: Variasi pola interaksi dan kegiatan peserta.

source: The range of interaction can move between the two extreme poles, the trainer as the center of activities and participants as the center of activities. Changes in the interaction between the two poles will result in an activity pattern that is experienced by the participants. From the description above, it is clear that the skills in using variations are wider compared with the skill of providing reinforcement and inquiry skills.
id: Rentangan interaksi dapat bergerak diantara dua kutup yang ekstrim yakni pelatih sebagai pusat kegiatan dan peserta sebagai pusat kegiatan. Perubahan interaksi diantara kedua kutup tadi akan berakibat pada pola kegiatan yang dialami peserta. Dari uraian tersebut di atas, jelas bahwa keterampilan menggunakan variasi bersifat lebih luas jika dibandingkan dengan keterampilan memberi penguatan dan keterampilan bertanya.

source: **The principles that need to be understood**
id: **Prinsip-prinsip yang perlu dipahami**

source: The principles which will need the use of natural variation among others are:
id: Prinsip-prinsip yang perlu alami penggunaan variasi antara lain:

source: Changes have to be smooth and accurate
id: Perubahan yang digunakan harus lancar dan tepat.

source: The use of variation technique should be smooth and accurate
id: Pengguanaan teknik variasi harus lancar dan tepat.

source: The use of the variation components must be completely structured and planned in advance
id: Penggunaan komponen-komponen variasi harus benar-benar terstuktur dan direncanakan sebelumnya.

source: The use of variation components to be flexible and spontaneous based on participant feedback
id: Penggunaan komponen variasi harus fleksibel dan spontan berdasarkan feedback peserta

source: **f. Classroom Management Skills**
id: **f. Keterampilan Mengelola Kelas**

source: Classroom management is the creation of conditions that enable the training management to take place optimally. This is in contrast to the management of learning, i.e. the teaching itself involving the material components, methods, and training aids in achieving the learning objectives.
id: Pengelolaan kelas adalah penciptaan kondisi yang memungkinkan pengelolaan pelatihan dapat berlangsung secara optimal. Hal ini berbeda dengan pengelolaan pembelajaran, yaitu kegiatan mengajar itu sendiri yang melibatkan secara lansung komponen materi, metode, dan alat bantu mengajar dalam rangka pencapaian tujuan pembelajaran.

source: Examples of learning management problems are unclear learning objectives, the subject matter is too easy or too hard, medium or inappropriate learning methods, the materials are not in systematic order, etc. While examples of classroom management problems are sleepy participants, crowded classroom, participants not doing the tasks, participants teasing others, broken seats, dirty classroom, etc.
id: Contoh masalah pengelolaan pembelajaran misalnya tujuan pembelajaran tidak jelas, materi pelajaran terlalu mudah atau terlalu sulit, media atau metode pembelajaran tidak sesuai, urutan materi tidak sistematis, penilaian tidak jelas, dan lain sebagainya. Sedangkan contoh masalah pengelolaan kelas adalah peserta mengantuk, peserta ramai, peserta tidak mengerjakan tugas, peserta senang mengganggu teman, kursi banyak yang rusak, ruang kelas kotor, dan masih banyak contoh lain.

source: Managing a class is a function of the trainer as a manager. Management means the organization or management in order for things to run smoothly, effectively, and efficiently. So in this case the function of a trainer is as a manager or an organizer. While the purpose of managing the class is: (1) to create and maintain an optimal learning condition, (2) to restore in the event of disruption to the learning process
id: Mengelole kelas merupakan fungsi pelatih sebagai manajer. Manajemen artinya sebagai penyelenggaraan atau pengurusan supaya yang dikelola dapat berjalan dengan lancar, efektif, dan efesien. Sehingga dalam hal ini fungsi pelatih sebagai manajer adalah sebagai pengorganisasi atau pengelola. Sedangkan tujuan mengelola kelas adalah: (1) ntuk menciptakan dan memelihara kondisi belajar yang optimal, (2) mengembalikan bila terjadi gangguan dalam proses belajar mengajar.

source: **Classroom Management Approaches**
id: **Pendekatan dalam Pengelolaan Kelas**

source: Various classroom management approaches are:
id: Macam-macam pendekatan pengelolaan kelas adalah :

source: Behavior Modification approach
id: Pendekatan perubahan tingkah laku.

source: Social climate approach
id: Pendekatan iklim sosial.

source: Group process approach
id: Pendekatan kelompok.

source: **Behavior Modification Approach**
id: **Pendekatan Pengubahan Tingkah Laku**

source: Behavior modification approach departs from behavior psychology with the basic assumption that human behavior either good or bad, to a certain extent, is the result of learning process. Thus, human behavior can be modified.
id: Pendekatan pengubahan perilaku bertolak dari psikologi tingkah laku dengan anggapan dasar bahwa tingkah laku manusia yang baik maupun yang buruk, dalam batas tertentu merupakan hasil belajar. Dengan demikian maka tingkah laku manusia tersebut dapat dimodifikasi.

source: Modifications include using positive reinforcement techniques, negative reinforcement, deletion, and punishment. Positive reinforcement is a response to a behavior, which can increase the likelihood of reoccurrence of such behavior. Negative reinforcement is a reduction to the removal of an unpleasant stimulus to encourage the recurrence of a behavior that arises as a result of the reduction or removal.
id: Modifikasi tersebut antara lain menggunakan teknik penguatan positif, penguatan negatif, penghapusan, dan hukuman. Penguatan positif adalah respons terhadap suatu tingkah laku, yang dapat meningkatkan kemungkinan terulangnya kembali tingkah laku tersebut. Penguatan negatif adalah pengurangan hingga penghilangan stimulus yang tidak menyenangkan untuk mendorong terulang kembali suatu tingkah laku yang timbul sebagai akibat dari pengurangan atau penghilangan tersebut.

source: Principle of use:
id: Prinsip penggunaan:

source: Avoidance of painful stimulus
id: Menghindari pemberian stimulus yang menyakitkan.

source: Clear target
id: Sasaran jelas

source: Provision of immediate reinforcement
id: Pemberian penguatan dengan segera.

source: Presenting various stimulus
id: Menyajikan stimulus dengan bervariasi.

source: Enthusiasm
id: Rasa antusias

source: Combined with other techniques
id: Dikombinasikan dengan teknik lain.

source: **Social Climate Approach (Social-Emotional Climate)**
id: **Pendekatan Iklim Sosial (Iklim Sosial-Emosional)**

source: Social-emotional climate approach departs from clinical psychology and counseling, with the basic assumption that the teaching and learning activities are effective and efficient when there are social-emotional relationships between participants and trainers and between participants. This can be pursued by means of:
id: Pendekatan iklim sosial-emosional bertolak dari psikologi klinis dan konseling, dengan anggapan dasar bahwa kegiatan belajar mengajar yang efektif dan efisien apabila ada hubungan sosial-emosional yang baik antara pelatih dengan peserta dan peserta dengan peserta. Hal tersebut dapat diupayakan pelatih dengan cara:

source: Open attitude
id: Sikap terbuka.

source: Acceptance and respect of participants
id: Sikap menerima dan menghargai peserta

source: Empathy
id: Sikap empati

source: Attitude to discuss the situation violations and violators
id: Sikap membicarakan situasi pelanggaran dan pelaku pelanggaran.

source: Democratic attitudes
id: Sikap demokratis

source: **Group Process Approach**
id: **Pendekatan Proses Kelompok**

source: Group process approach departs from social psychology and group dynamics, with the basic assumption that the effective and efficient teaching and learning activities take place in the context of a group, i.e. the class. For that task the trainer has to create a class that has strong ties and can work effectively and efficiently.
id: Pendekatan proses kelompok bertolak dari psikologi sosial dan dinamika kelompok, dengan anggapan dasar bahwa kegiatan belajar mengajar yang efektif dan efisien berlangsung dalam konteks kelompok, yaitu kelompok kelas. Untuk itu tugas pelatih disini adalah menciptakan kelompok kelas yang mempunyai ikatan yang kuat serta dapat bekerja secara efektif dan efisien.

source: To create a good group bonding atmosphere we need the establishment of common goals in the group, clear rules to bind the participants into groups, and leadership within the group. And to maintain a healthy working environment, the trainer needs to do for example:
id: Untuk menciptakan suasana ikatan kelompok yang baik perlu adanya pembentukan tujuan yang sama dalam kelompok, aturan yang jelas untuk mengikat peserta menjadi kelompok, dan kepemimpinan pelatih dalam kelompok. Dan untuk memelihara suasana kerja kelompok yang sehat pelatih perlu melakukan misalnya:

source: Encourage and equalize participation
id: Mendorong dan memeratakan partisipasi

source: Work out a compromise
id: Mengusahakan kompromi.

source: Reduce tension
id: Mengurangi ketegangan.

source: Clarify communications
id: Memperjelas komunikasi.

source: Addressing conflicts between individuals or groups
id: Mengatasi pertentangan antar pribadi atau kelompok.

source: Showed that the presence of the participants are physically and psychologically
id: Menunjukkan bahwa kehadiran peserta adalah fisik dan psikis.

source: Describe sanctions
id: Menerangkan sangsi.

source: Bibliography
id: Daftar Bacaan
