Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/tot/502_communication_skills.po
Languages: id

source: Communication model training is one component in the training process because it is actually a method implementation in training. To maximize output in the training, a trainer has to select a training method in accordance with the other components, such as the objectives, materials, trainees, facilities and assessment. So to be able to achieve the objectives set in the training, methods of training and communication should receive special attention in any training process.
id: Model komunikasi pelatihan merupakan salah satu komponen proses dalam pelatihan karena model komunikasi pelatihan sebenarnya merupakan penggunaan metode dalam pelatihan. Untuk memaksimalkan output dalam pelatihan diharapkan metode yang dipilih dalam pelatihanpun sesuai dengan komponen yang lain, yaitu tujuan, bahan, peserta pelatihan, fasilitas dan penilaian. Jadi untuk dapat mencapai tujuan yang telah ditetapkan pada suatu pelatihan, metode pelatihan dan komunikasi harus mendapat perhatian khusus dalam setiap proses pelatihan.

source: A good trainer should understand the characteristics of participants in order for him to succeed in carrying out his teaching role. A trainer is expected to plan the learning process according to the circumstances and the personality of the trainees. A method is a way to achieve the objectives well. The methods can be classified into 5, i.e. direct learning, indirect learning, interactive learning, experiential learning, and independent learning.
id: Pelatih yang baik seharusnya memahami karakteristik peserta pelatihan agar ia sukses dalam melaksanakan peran mengajarnya. Pelatih diharapkan dapat merencanakan proses belajar mengajar yang sesuai dengan keadaan dan kepribadian peserta pelatihan. Metode adalah cara untuk mencapai tujuan sebaik-baiknya. Metode dapat diklasifikasikan menjadi 5, yaitu metode pembelajaran langsung, pembelajaran tidak langsung, pembelajaran interaktif, belajar melalui pengalaman, dan pembelajaran mandiri.

source: **Direct learning**: Direct learning is the kind of learning that is directed by the trainer. This strategy is effective to determine the information or skills to build incrementally. Direct learning is usually deductive. Examples of the direct learning methods are: lecture, discussion, demonstration and drill exercises.
id: **Pembelajaran langsung**: pembelajaran langsung merupakan pembelajaran yang banyak diarahkan oleh pelatih. Strategi ini efektif untuk menentukan informasi atau membangun keterampilan tahap demi tahap. Pembelajaran langsung biasanya bersifat deduktif. Contoh metode dalam pembelajaran langsung adalah: ceramah, tanya jawab, demonstrasi latihan dan drill.

source: **Indirect learning**: Generally centered on the trainees. The role of the trainer shifted from a lecturer to a facilitator. The trainer manages the learning environment and gives the trainees the opportunity to get involved. Examples of indirect methods of learning are inquiry, case studies, problem solving, concept mapping.
id: **Pembelajaran tidak langsung**: Umumnya berpusat pada peserta pelatihan. Peranan pelatih bergeser dari seorang penceramah menjadi fasilitator. Pelatih mengelola lingkungan belajar dan memberikan kesempatan peserta pelatihan untuk terlibat. Contoh metode pembelajaran tidak langsung adalah: inkuiri, studi kasus, pemecahan masalah, peta konsep.

source: **Interactive learning**: Interactive learning emphasizes on discussion and sharing among participants. Discussion and sharing give trainees the opportunity to react to ideas, the trainer’s or his partner’s experience and approach and to build an alternative way to think and feel. Examples of this method are class discussions, small group discussions or projects, work in pairs.
id: **Pembelajaran interaktif**: Pembelajaran interaktif menekankan pada diskusi dan sharing di antara peserta pelatihan. Diskusi dan sharing memberi kesempatan peserta pelatihan untuk bereaksi terhadap gagasan, pengalaman, pendekatan dan pengetahuan pelatih atau temannya dan untuk membangun cara alternatif untuk berfikir dan merasakan. Contoh merode dalam pembelajaran interaktif adalah: diskusi kelas, diskusi kelompok kecil atau projek, kerja berpasangan.

source: **Experiential learning**: Empirical learning is oriented on inductive activities, centered on the trainees, and is activity based. Personal reflection on the experience and planning formulation towards implementation in other contexts is a critical factor in an effective empirical learning. Examples of empirical learning method are role playing, observation / survey, and simulation.
id: **Belajar melalui pengalaman**: Pembelajaran empirik berorientasi pada kegiatan induktif, berpusat pada peserta pelatihan, dan berbasis aktivitas. Refleksi pribadi tentang pengalaman dan formulasi perencanaan menuju penerapan pada konteks yang lain merupakan faktor kritis dalam pembelajaran empirik yang efektif. Contoh metode dalam pembelajaran empirik adalah: bermain peran, observasi/survey, simulasi.

source: **Independent learning**: Independent learning is a teaching strategy that aims to develop individual initiative, self-reliance, and self improvement. The focus is on the trainees’ planning with the help from the trainer. Self-learning can also be done with a friend or in a small group. Examples of Independent learning methods are research projects and computer-based learning.
id: **Pembelajaran mandiri**: Belajar mandiri merupakan strategi pembelajaran yang bertujuan untuk membangun inisiatif individu, kemandirian, dan peningkatan diri. Fokusnya adalah pada perencanaan belajar mandiri oleh peserta pelatihan dengan bantuan pelatih. Belajar mandiri juga bisa dilakukan dengan teman atau sebagai bagian dari kelompok kecil. Contoh metode dalam pembelajaran mandiri adalah: projek penelitian, belajar berbasis komputer.

source: **a. Methods in direct learning**
id: **a. Metode dalam pembelajaran langsung**

source: Direct learning is usually identified with the lecture method, where learning is presumably making the participants less active. However, direct learning can still be used together with question and answer, demonstrations, and exercises. Furthermore, a few ways can be used to make more this method more effective, for example:
id: Pembelajaran langsung biasanya diidentikkan dengan metode ceramah, dimana pembelajaran ini disinyalir kurang mengaktifkan peserta. Namun demikian pembelajaran langsung masih dapat digunakan dengan menggunakan metode tanyajawab, demonstrasi, dan latihan. Selanjutnya dapat digunakan beberapa cara untuk lebih mengefektifkan pembelajaran langsung, misalnya:

source: Participants review the training materials that have been studied and the new materials recently presented:
id: Peserta mereview materi pelatihan yang telah dipelajari dan materi baru disajikan kepada peserta:

source: materials well managed part by part
id: materi pelatihan telah diatur per bagian

source: use visual media (important to read)
id: menggunakan media visual (penting untuk dibaca)

source: Participants exercise with the trainer’s guidance.
id: Para peserta berlatih dengan didampingi pelatih.

source: Participants exercise independently
id: Para peserta berlatih sendiri-sendiri

source: Participants’ improvement of skills/ knowledge are monitored periodically
id: Peserta dimonitor perolehan keterampilan/pengetahuannya secara periodik.

source: **Various methods can be developed when students receive an explanation from the teacher, among others:**
id: **Berbagai macam metode yang dapat dikembangkan ketika siswa menerima penjelasan dari guru antara lain:**

source: **Example and analogy**: A trainer provides examples and illustrations associated with the materials. He can also make comparisons between participants' experiences with the training materials.
id: **Contoh dan analogi**: Pelatih menyediakan contoh dan ilustarsi yang terkait dengan materi. Pelatih juga dapat membuat perbandingan antara materi pelatihan dengan pengalaman peserta.

source: **Games**: A trainer uses games in learning. The games are expected to be in accordance with the training topic. Examples of them would be guessing pictures, mystery in a box, or various types of quizzes from TV can be implemented in a training class with some modifications (e.g. who wants to millionaires, GameZone, word games, etc.).
id: **Permainan**: Pelatih menggunakan permainan dalam pembelajaran. Permainan diharapkan sesuai dengan topik pelatihan. Contoh permainan misalnya tebak gambar, tebak mesteri dalam kotak, atau berbagai jenis kuis di TV dapat diterapkan di kelas pelatihan dengan beberapa modifikasi (misalnya who wants to millioner, gamezone, permainan kata, dll).

source: **Response card**: Trainer asks participants to answer questions on a card or piece of paper anonymously. Question cards or answer cards can be developed. On the cards participants get different questions and they would be asked to answer by raising hands; use open-ended, productive or imaginative questions. On the answer cards the participants get answer cards, he would rasie his hand when the card matches the trainer’s questions; use open-ended, productive or imaginative questions.
id: **Kartu respon**: Pelatih meminta peserta untuk menjawab pertanyaan pada kartu atau potongan kertas dengan tidak menuliskan nama atau identitas lain. Dapat dikembangkan dengan kartu soal ataupun kartu jawab. Pada kartu soal peserta mendapatkan kartu pertanyaan yang berbeda dan menjawab dengan angkat tangan; gunakan pertanyaan terbuka, produktif atau imajinatif. Pada kartu jawab peserta mendapatkan kartu jawab, ia angkat tangan saat kartunya cocok dengan pertanyaan pelatih; gunakan pertanyaan terbuka, produktif atau imajinatif.

source: **Polls**: A trainer can conduct a short survey to obtain data quickly. This can be done with a verbal survey, for example by asking participants to raise their hands or lift the answer cards
id: **Poling**: Pelatih melakukan survey yang singkat untuk memperoleh data secara cepat. Hal ini dapat dilakukan dengan survey verbal misalnya dengan meminta peserta mengangkat tangan atau mengangkat kartu jawaban

source: **Problems**: Trainer asks problems related with training topic.
id: **Permasalahan**: Pelatih mengajukan permasalahan yang terkait dengan topik pelatihan.

source: **Demonstrations**: Trainer or participants can demonstrate something according to the topic by using gestures or properties.
id: **Demonstrasi**: Pelatih ataupun peserta dapat mendemonstrasikan sesuatu sesuai topik dengan menggunakan gerak tubuh ataupun alat peraga.

source: **Review newspaper or news**: Participants are asked to review newspaper or news from other readings.
id: **Reviu koran atau berita**: peserta diminta mereview koran atau berita pada bacaan lain.

source: **Brainstorm**: Participants are asked to argue about something related with the training topics. Opinions will be accommodated for with conclusions drawn on the subject matter discussed.
id: **Curah pendapat**: peserta diminta untuk berpendapat tentang sesuatu sesuai topik pelatihan. Pendapat-pendapat itu ditampung untuk diambil kesimpulan bersama tentang permasalahan yang dibahas.

source: **The method can be developed after the participants received proper explanation from the trainer, among others:**
id: **Metode yang dapat dikembangkan setelah peserta menerima penjelasan dari pelatih antara lain:**

source: **Sharing notes**: after a series of events trainee compare their notes with other colleagues’
id: **Berbagi catatan:** setelah serangkaian kegiatan peserta pelatihan membandingkan hasil catatannya dengan catatan rekannya yang lain

source: **Q&A**: participants are given the opportunity to ask questions related to the concept and its application. If there are no questions from the participants, the trainer can ask them first.
id: **Tanya jawab**: peserta diberikan kesempatan untuk bertanya terkait dengan konsep dan aplikasinya. Jika tidak ada pertanyaan dari peserta, pelatih dapat memancing dengan bertanya pada peserta.

source: **Headline**: trainer summarizes lessons with key words to be easily remembered.
id: **Headline**: pelatih meringkas pelajaran dengan kata-kata kunci agar mudah diingat.

source: **Methods to determine participants’ mastery of the concepts that have been studied**
id: **Metode untuk mengetahui penguasaan peserta terhadap konsep yang telah dipelajari**

source: **One minute paper**: This activity can be done at the end of training. Ask the participants to take out a piece of paper. Ask an open-ended or closed question related with the concepts that have been studied. Give one or two minutes for participants to answer.
id: **One minute paper**: kegiatan ini dapat dilakukan di akhir pelatihan. Mintalah peserta mengeluarkan secarik kertas. Ajukan sebuah pertanyaan terbuka atau tertutup terkait konsep yang telah dipelajari. Berikan waktu satu atau dua menit bagi peserta untuk menjawabnya.

source: **Reflection**: ask one or two participants to come forward and express their impressions towards the learning. Reflection can also provoke feelings and difficulty in following the study.
id: **Refleksi**: mintalah satu atau dua peserta maju di depan kelas dan menceriterakan kesan terhadap pembelajaran. Refleksi juga dapat memancing perasaan dan kesulitan peserta dalam mengikuti pembelajaran.

source: **Quiz**: participants raise several issues or questions related with the concept and ask other participants to answer. Quiz can be done by including the name of the participants or anonymously. Quiz can also be used with competition, puzzles, or the like. Quiz can be done verbally; using open-ended, productive, or imaginative questions.
id: **Quis**: peserta mengajukan beberapa masalah atau soal terkait konsep dan meminta peserta menjawabnya. Quis dapat dilakukan dengan menyertakan nama peserta maupun tidak mencantumkan nama. Quis juga bisa digunakan dengan adu cepat, teka-teki atau sejenisnya. Quis dapat dilakukan secara lisan; gunakan pertanyaan terbuka, produktif, imajinatif.

source: **Tournament**: participants compete in groups to solve problems related to the concepts that have been studied. The winning group will get a certain reward.
id: **Turnamen**: secara berkelompok peserta berkompetisi untuk menyelesaikan masalah yang terkait dengan konsep yang telah dipelajari. Kelompok peserta yang memenangkan turnamen mendapatkan reward tertentu.

source: **Review**: Ask participants to review the lessons with others or give them a review test scores.
id: **Review**: Minta peserta untuk mereview isi pelajaran dengan yang lain atau memberi mereka tes skor review.

source: **b. Indirect learning method**
id: **b. Pembelajaran tidak langsung**

source: **Inquiry**: participants conduct observation. Based on the result, they may ask questions. Furthermore, participants formulate allegations, and collect data. Based on the data, participants are asked to conclude.
id: **Metode Inkuiri**: peserta melakukan pengamatan. Berdasarkan hasil pengamatan, mengajukan mengajukan pertanyaan. Selanjutnya peserta merumuskan dugaan, dan mengumpulkan data. Berdasarkan data yang diperoleh, peserta diminta untuk menyimpulkan.

source: **Problem solving**: Each participant is asked to formulate a problem clearly and concisely, identifying factors that cause the problem, collect required information (facts and knowledge), determine various solutions and choose the most appropriate one, test the chosen solution, and review the result.
id: **Metode memecahkan masalah**: Setiap peserta diminta untuk merumuskan masalah dengan jelas dan ringkas. Mengidentifikasi faktor-faktor yang menyebabkan masalah. Mengumpulkan informasi yang dibutuhkan (fakta dan pengetahuan). Menentukan berbagai pemecahan masalah. Memilih pemecahan yang paling sesuai. Menguji pemecahan masalah yang dipilih. Menilai hasil pemecahan masalah.

source: **Trading**: Each participant writes down one thing (e.g. experience, creative ideas, questions, opinion, etc.) on a piece of paper, then stick it up on his shirt. Walk around to sell and buy (read) the results of others. Set a rule that every work has to be sold and bought. Classically, present the result in turn. Trainer will provide reinforcement.
id: **Metode berdagang**: Setiap peserta menuliskan satu hal (misal, pengalaman, ide kreatif, pertanyaan, pendapat atau yang lain) pada sepotong kertas. Setiap peserta menempelkan hasil tulisan pada bajunya. Berkeliling untuk menjual dan membeli (membaca) hasil teman lain. Tetapkan aturan bahwa setiap hasil kerja harus dijual dan dibeli. Secara klasikal, secara bergiliran peserta menyampaikan hasil perdagangannya. Penguatan oleh pelatih.

source: **Case study analysis**: participants are given a case to be solved either individually or in groups based on data, facts or concepts they have learned in class.
id: **Analisa studi kasus**: kepada peserta diberikan kasus yang harus dipecahkan baik secara individual maupun secara berkelompok berdasarkan data, fakta atau konsep yang telah dipelajari di kelas.

source: **Evaluating a friend’s work**: it can be done after developing a product. Participants generally use a rubric to evaluate the results of his friend’s work
id: **Mengevaluasi hasil kerja teman**: dapat dilakukan setelah mengembangkan suatu produk. Umumnya peserta menggunakan rubrik untuk mengevaluasi hasil kerja temannya

source: **c. Interactive learning method**
id: **c. Metode dalam pembelajaran interaktif**

source: **Group discussion**: Trainer asks participants to form groups of three or more to share information.
id: **Diskusi kelompok**: Pelatih meminta peserta berkelompok dengan anggota tiga atau lebih untuk berbagi informasi.

source: **Think, pair and share**: propose a problem to the participants. Give participants 2-5 minutes chance to think. When finished, ask them to discuss the same issue with the person next to them for 3-5 minutes (pair). Finally, select a pair to express their opinions in front of the class (share).
id: **Think, pair and share**: ajukan permasalahan pada peserta. Berikan kesempatan 2-5 menit untuk berfikir sendiri think. Setelah selesai mintalah mereka mendiskusikan masalah yangsama dengan peserta di sebelahnya selama 3-5 menit (pair). Akhirnya pilihlah satu pasangan untuk mengemukakan pendapat mereka di depan kelas (share).

source: **Group investigation**: Participants form groups. Trainer calls the leader of the groups and gives different materials/ task. Each group will discuss the task cooperatively and will perform investigations. Upon completion, a representative will present the results of the discussion. Trainer will provide reinforcement.
id: **Metode Investigasi Kelompok**: peserta membentuk kelompok. Pelatih memanggil ketua-ketua kelompok untuk diberi materi/tugas yang berbeda.Setiap kelompok membahas tugas yang diberikan secara kooperatif dan melakukan investigasi. Setelah selesai diskusi, lewat juru bicaranya kelompok menyampaikan hasil pembahasan. Pelatih memberikan penguatan.

source: **TGT (Team Game Tournament) method**: Trainer presents new material. Participants form study groups heterogeneously. Each group will participate in academic tournament. Each will represent the group in the tournament. Give reward to the winning team.
id: **Metode TGT (Team Game Tournament)**: Pelatih menyajikan materi baru. Peserta membentuk kelompok belajar secara heterogen. Setiap kelompok mengikuti turnamen akademik. Setiap peserta mewakili kelompoknya pada kegiatan turnamen. Beri penghargaan terhadap kelompok yang menang.

source: **Jigsaw**: Trainer prepares a number of tasks matching the number of groups. Participants will form groups with the number of members equal to the number of groups (participants have to memorize the group members). Each group member will be given different part of the materials. Participants from different groups will form new groups and discuss their parts. Upon completion of discussions with a group of experts, each group member will go back to the original group and, in turn, teach/ report the discussion result to other group members. Participants randomly present all the tasks given by the trainer. Reinforcement.
id: **Metode Jigsaw**: Pelatih menyiapkan tugas sebanyak jumlah kelompok. Peserta berkelompok dengan jumlah anggota sama dengan jumlah kelompok (peserta harus hafal anggotanya). Setiap peserta dalam kelompok diberi bagian materi yang berbeda. Peserta dari berbagai kelompok yang memperoleh tugas yang sama membentuk kelompok baru dan mendiskusikan bagiannya. Setelah selesai diskusi dengan kelompok ahli, tiap anggota kembali ke kelompok asal dan bergantian mengajar/melaporkan hasil diskusi kepada anggota kelompok yang lain. Secara acak peserta menyampaikan seluruh tugas yang diberikan pelatih. Penguatan

source: **Debate**: The trainer divides the participants into two debate groups of pros and cons. Each group will read the materials that will be debated. Appoint one member of the pros group to speak and rebutted by a member of the cons, and so on. Trainer writes down ideas from the debate on a board the number of ideas the trainer expected has been met. The trainer adds more unrevealed ideas. From the ideas on the board, the trainer asks participants to draw conclusion/ summary by referring to the competency desired.
id: **Metode Debat**: Guru membagi dua kelompok peserta debat yang satu pro dan yang lain kontra. Setiap kelompok membaca materi yang akan didebatkan. Pelatih menunjuk satu anggota pro untuk berbicara dan ditanggapi oleh anggota kelompok kontra, demikian seterusnya. Pelatih menuliskan ide/gagasan dari setiap pembicaraan di papan tulis sampai sejumlah ide yang diharapkan guru terpenuhi. Pelatih menambahkan ide yang belum terungkap. Dari data-data di papan tulis, pelatih mengajak peserta membuat kesimpulan/rangkuman yang mengacu pada kompetensi yang ingin dicapai.

source: **STAD (Student Team Achievement Division)**: Learning from trainer. Participants form groups. Each group discusses issues given (each participant should understand the group’s answer). One person from each group will work on the questions (quiz). Scores of each member will determine the score of the group. Reinforcement.
id: **Metode STAD (Student Team Achievement Division)**: Pembelajaran oleh pelatih. Peserta membentuk kelompok. Tiap kelompok mendiskusikan permasalahan yang diterima (tiap peserta harus memahami jawaban kelompoknya). Salah seorang dari setiap kelompok mengerjakan soal-soal (kuis). Nilai setiap anggota menentukan nilai kelompok. Penguatan.

source: **Collaborative learning group**: participants form heterogeneous groups of 3-6 people. Ask one of the participants to become the leader and another to take note. Give participants the opportunity to learn collaboratively. The result will be submitted in the form of a written report.
id: **Kelompok belajar kolaboratif**: peserta dibentuk dalam kelompok heterogen 3-6 orang. Mintalah salah satu peserta menjadi pemimpinnya dan satu yang lain menjadi pencatat. Berikan kesempatan pada peserta untuk belajar secara berkolaborasi. Hasil kelompok berupa laporan tertulis.

source: **Learn in pairs**: Trainer asks participants to perform tasks or discussions with friends nearby in pairs. Pairs are suitable for learning complicated tasks.
id: **Belajar berpasangan**: Pelatih meminta peserta untuk mengerjakan tugas atau berdiskusi dengan teman di dekatnya secara berpasangan. Belajar berpasangan cocok untuk mengerjakan tugas yang rumit.

source: **d. Experiential learning method**
id: **d. Metode belajar melalui pengalaman**
