Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/tot/502_communication_skills.po
Languages: id

source: **Role play**: each group is asked to design a role play based on the concept being studied. Groups will respond to other groups’ role play result.
id: **Bermain peran**: masing-masing kelompok diminta merancang permainan peran berdasarkan konsep yang sedang dipelajari. Kelompok yang satu menanggapi hasil permainan peran kelompok yang lain.

source: **Simulation/ exercise**: after participants learnt about certain motoric skills, they will randomly be asked to exercise the skills they have learnt in class.
id: **Simulasi/latihan praktek**: setelah peserta belajar tentang keterampilan motorik tertentu, secara acak peserta diminta untuk mempraktikkan keterampilan yang telah dipelajari di depan kelas.

source: **e. Independent learning**
id: **e. Metode pembelajaran mandiri**

source: **Project:** Project method is a way of presenting the lessons, starting from a problem where the solution requires a review of various point of views. The rationale for the use of this method is that the problem can only be solved by different school of thoughts or knowledge. Only problems that need unit problem solving can be solved with project method.
id: **Metode Projek:** Metode projek adalah suatu cara penyajian pelajaran yang bertitik tolak dari masalah dimana pemecahannya memerlukan tinjauan dari berbagai segi. Dasar pemikiran penggunaan metode ini adalah masalah hanya bisa diselesaikan dengan berbagai segi atau ilmu. Untuk itu hanya pada masalah-masalah yang memerlukan pemecahan unit yang dapat digunakan metode projek.

source: 3. Components of basic skills in teaching / training
id: 3. Komponen keterampilan dasar mengajar/melatih

source: In interaction or face-to-face meeting with the trainees, trainer requires some basic teaching skills. It is absolutely necessary to help the trainer in playing the role in educational interaction. The trainer’s teaching basic skills are not different than the teachers who teach in the classroom. Those basic skills are:
id: Pelatih dalam interaksi atau dalam tatap muka dengan peserta pelatihan memerlukan sejumlah keterampilan dasar mengajar. Hal ini mutlak perlu untuk membantu pelatih dalam menjalankan tugas pelatih dalam interaksi edukatif. Keterampilan dasar mengajar pelatih tidak bedanya dengan guru yang mengajar di kelas. Keterampilan dasar yang harus dimiliki, yaitu:

source: Skill to open and close the session
id: Keterampilan dasar membuka dan menutup pelajaran.

source: Explanation skill
id: Keterampilan dasar menjelaskan

source: Inquiry basic skill
id: Keterampilan dasar bertanya.

source: Skill to make variations
id: Keterampilan dasar membuat variasi.

source: Skills to provide reinforcement
id: Keterampilan dasar memberi penguatan.

source: Skills to manage the class
id: Keterampilan dasar mengelola kelas.

source: Skills to guide a small group discussion
id: Keterampilan dasar membimbing diskusi kelompok kecil.

source: Individual teaching skill
id: Keterampilan dasar mengajar secara perorangan.

source: Skill of small groups
id: Keterampilan dasar kelompok kecil

source: **a. Skill to open and close the session**
id: **a. Keterampilan Dasar Membuka dan Menutup Pelajaran**

source: **Definition and Purpose**
id: **Pengertian dan Tujuan**

source: Opening a session is associated with the trainer creating conducive mental atmosphere and attracting participants’ attention to focus on what will be studied. While closing the session is when the trainer ending the core of the activities, which is giving an overall picture of what has been studied, knowing the participants, and the trainer’s rate of success in the training process. Opening and closing of the session have are meant to:
id: Membuka pelajaran diartikan dengan perbuatan pelatih untuk menciptakan suasana siap mental dan menimbulkan perhatian peserta agar terpusat kepada apa yang akan dipelajari. Sedangkan menutup pelajaran adalah kegiatan pelatih dalam mengakhiri inti pelajaran, yaitu memberikan gambaran menyeluruh tentang apa yang telah dipelajari peserta, mengetahui peserta, dan tingkat keberhasilan pelatih dalam proses pelatihan. Kegiatan membuka dan menutup pelajaran mempunyai tujuan:

source: attract interests and motivate participants on the task at hand
id: Menarik perhatian dan memotivasi dalam pengerjaan tugas yang dihadapi.

source: enable participants to know the limits of the task at hand
id: Memungkinkan peserta mengetahui batas tugas yang akan dikerjakan.

source: enable participants to find out the approach that is going to be used
id: Peserta dapat mengetahui pendekatan yang akan digunakan.

source: enable participants to determine the relationship between mastered experiences with new things to be learned
id: Memungkinkan peserta mengetahui hubungan antara pengalaman-pengalaman yang dikuasai dengan hal-hal baru yang akan dipelajari.

source: give the participants the possibility to combine facts, skills, and concepts covered in an event
id: Memberi kemungkinan peserta untuk menggabungkan fakta, keterampilan, dan konsep-konsep yang tercakup dalam suatu peristiwa.

source: enable participants to determine the level of success
id: Memungkinkan peserta mengetahui tingkat keberhasilannya.

source: **Components of Opening the Session Skill**
id: **Komponen Keterampilan Dasar Membuka Pelajaran**

source: Opening a session can be done by:
id: Membuka pelajaran dapat dilakukan dengan:

source: Attracting participants’ interest
id: Menarik perhatian peserta.

source: A few ways can be done by the trainer to attract the participants’ interest, among others:
id: Beberapa cara yang dapat digunakan pelatih untuk menarik perhatian peserta, antara lain:

source: Variation of training style and patterns of interaction
id: Menggunakan variasi gaya melatih dan pola interaksi.

source: The use of training aids
id: Penggunaan alat-alat bantu melatih.

source: Motivating
id: Memotivasi.

source: Creating motivation can be done by:
id: Menimbulkan motivasi dapat dikerjakan dengan cara antara lain:

source: Showing warmth and enthusiasm
id: Menunjukkan kehangatan dan keantusiasan.

source: Creating curiosity
id: Menimbulkan rasa ingin tahu.

source: Expressing opposite ideas
id: Mengemukakan ide-ide yang bertentangan.

source: Paying attention to the participants’ interests
id: Memperhatikan minat peserta.

source: Giving references
id: Memberikan acuan

source: Giving references is an effort to give clear picture of the things that will be studied by means of inserting a short series of specific and relevant alternatives, by:
id: Memberikan acuan merupakan usaha memberikan gambaran yang jelas mengenai hal yang akan dipelajari dengan cara memasukkan secara spesifik dan singkat serangkaian alternatif yang relevan, dengan cara:

source: Expressing the objectives and limitation of task
id: Mengemukakan tujuan dan batas-batas tugas.

source: Advising steps to be taken, reminding the subject matter to be discussed
id: Menyarangkan langkah-langkah yang akan dilakukan, mengingatkan masalah pokok yang akan dibahas.

source: Asking questions
id: Mengajukan pertanyaan-pertanyaan.

source: Making connections
id: Membuat kaitan.

source: Some of the trainer’s efforts in making connections:
id: Beberapa usaha pelatih dalam membuat kaitan antara lain:

source: Making links between relevant aspects of training with the materials known to participants
id: Membuat kaitan antara aspek-aspek yang relevan dari materi pelatihan yang dikenal peserta.

source: Comparing or contrasting the new knowledge and the ones known to them
id: Pelatih membandingkan atau mempertentangkan pengetahuan baru dengan pengetahuan yang telah diketahui.

source: Explaining the concept first and then the detailed description
id: Menjelaskan konsepnya terlebih dahulu baru kemudian uraian secara rinci.

source: **Basic Skills Components of Closing the Session**
id: **Komponen Keterampilan Dasar Menutup Pelajaran**

source: Closing the session is intended to obtain a complete picture at the end of the activity, and to determine the participants’ level of achievement or the participants' success rate. There are a few ways to that can be done in closing the session, among others:
id: Menutup pelajaran dimaksudkan untuk memperoleh gambaran utuh pada akhir kegiatan, dan untuk mengetahui tingkat pencapaian peserta atau tingkat keberhasilan peserta. Ada beberapa cara yang dapat dilakukan pelatih dalam menutup pelajaran, antara lain:

source: Review the core content of the session and making a summary
id: Meninjau kembali penguasan inti pelajaran dengan merangkum inti pelajaran dan membuat ringkasan.

source: Evaluate the various forms of evaluation, for example:
id: Mengevaluasi dengan berbagai bentuk evaluasi, misalnya:

source: Demonstrate skills
id: Mendemontrasikan keterampilan.

source: Ask participants to apply new ideas in other situations
id: Meminta peserta mengaplikasikan ide baru dalam situasi lain.

source: Explore the participants’ opinions
id: Mengeksplorasikan pendapat peserta sendiri.

source: Provide written questions
id: Memberikan soal-soal tertulis.

source: **Use Principles**
id: **Prinsip-prinsip Penggunaannya**

source: A few principles that need to be considered by a trainer when opening and closing the session are:
id: Berapa prinsip yang perlu dipertimbangkan oleh pelatih dalam membuka dan menutup pelajaran adalah:

source: Significance
id: Kebermaknaan

source: To draw participants’ attention or motivation, a trainer has to select a way relevant with the content and the objective of the teaching
id: Untuk menarik perhatian atau motivasi peserta, pelatih harus memilih cara yang relevan dengan isi dan tujuan pelajaran.

source: Sequential and continuous
id: Berurutan dan berkesinambungan.

source: Activities taken by trainer in introducing and summarizing the main points of the lessons should be an integral part, the link between one part and another or with the participants’ experience should be clear
id: Aktivitas yang ditempuh pelatih dalam mengenalkan dan merangkum pokok-pokok pelajaran hendaknya merupakan bagian yang utuh, kaitan antara bagian yang satu dengan bagian yang lain atau dengan pengalaman peserta harus jelas.

source: **b. Explanation skill**
id: **b. Keterampilan Dasar Menjelaskan**

source: **Definition**
id: **Pengertian**

source: Explaining/ describing something is presenting verbal information that is organized systematically to show an association with one another. The emphasis of explaining is the participants’ reasoning process and not indoctrination. Examples: providing an overview of a situation, revealing causes of an event, etc. The success of explaining is marked by the participants’ understanding of something. The structure of teaching materials in explaining is usually planned in a way that can be controlled. Logical description, the skill to reveal the materials and the strategy to organize the materials are the main procedure to explain.
id: Menjelaskan/menerangkan adalah menyajikan informasi lisan yang diorganisasikan secara sismatik untuk menunjukan adanya hubungan yang satu dengan yang lainnya. Penekanan memberikan penjelasan ialah proses penalaran peserta dan bukan indoktrinasi. Contohnya: memberikan gambaran tentang suatu keadaan, mengungkapkan sebab-sebab suatu kejadian dan sebagainya. Keberhasilan menerangkan ditandai oleh terbentuknya pengertian peserta terhadap suatu hal. Struktur bahan pengajaran dalam rangka menerangkan biasanya direncanakan sedemikian rupa agar dapat dikendalikan. Keterangan logika, keterampilan mengungkapkan bahan dan strategi penyusunan bahan merupakan prosedur utama untuk menerangkan.

source: Explaining is linked with the effort to create linkages between the known and the unknown. A full explanation is always accompanied by evidence and the cause and effect is based on the logical relationships between generalization, provisions, and realities according to the participants’ perception system.
id: Menjelaskan tidak terlupa dari usaha mengadakan hubungan antara hal yang sudah diketahui dan yang belum diketahui. Penjelasan yang lengkap selalu disertai bukti dan sebab akibatnya yang didasarkan pada hubungan logis antara generalisasi, ketentuan-ketentuan, kenyataan-kenyataan sesuai dengan sistem persepsi peserta. Tujuan keterampilan menjelaskan adalah:

source: The objective of explanation skills are to:
id: Tujuan keterampilan menjelaskan adalah:

source: Provide understanding to others
id: Memberikan pengertian kepada orang lain.

source: Make participants think logically and systematically
id: Membuat peserta berfikir secara logis dan sistematis.

source: Train participants to think based on the causes and reasons
id: Melatih peserta berfikir berdasarkan sebab-sebab dan alasan-alasan.

source: Train participants in making decisions independently
id: Melatih peserta mandiri di dalam mengambil keputusan.

source: Instill the right way of thinking attitude
id: Menanamkan sikap yakni bahwa cara berfikir benar.

source: Guide participants to a clear understanding in solving the question: What, Why and How
id: Menuntun peserta kepada pengertian yang jelas dalam memecahkan pertanyaan: “Apa” “Mengapa” dan “Bagaimana”.

source: Engage participants in thinking to solve problems
id: Melibatkan peserta dalam berfikir memecahkan masalah.

source: Obtain feedback from participants based on levels of understanding
id: Untuk memperoleh umpan balik dari peserta berdasarkan tingkat pengertiannya.

source: Assist participants to use the process of transmission and evidences in solving problems
id: Membantu peserta menggunakan proses penularan dan bukti-bukti dalam memecahkan masalah.

source: **Components of Explanation Skills**
id: **Komponen keterampilan dasar menjelaskan**

source: In the planning process, the components of explanation skills include:
id: Dalam merencanakan komponen keterampilan menjelaskan meliputi :

source: Planning explanation
id: Merencanakan penjelasan

source: In planning explanation, we need to pay attention to the contents of the message that will be conveyed and the readiness of the recipient. Things related to the content of the message (the material) including:
id: Merencanakan penjelasan perlu diperhatikan isi pesan yang akan disampaikan dan kesiapan penerima pesan. Yang berhubungan dengan isi pesan (materi), mencakup :

source: Analyzing problems holistically
id: Menganalisis masalah secara keseluruhan.

source: Determining the type of existing relationship between the linked elements
id: Menentukan jenis hubungan yang ada antara unsur-unsur yang dikaitkan.

source: Using the law, formulation, or generalization that is suitable with the determined relationship
id: Menggunakan hukum, rumus, atau generalisasi yang sesuai dengan hubungan yang telah ditentukan.

source: What we need to pay attention when associated with the message recipient (participant) is to whom the explanation will be presented to, such as age, gender, ability, social background, and participants’ learning environment. Thus what needs to be considered in connection with the recipient of this message is:
id: Yang berhubungan dengan penerima pesan (peserta), perlu diperhatikan adalah kepada siapa penjelasan itu akan disajikan, misalnya usia, jenis kelamin, kemampuan, latar belakang sosial, dan lingkungan belajar peserta. Sehingga yang perlu dipertimbangkan sehubungan dengan penerima pesan ini adalah :

source: The explanation must be relevant to the participants’ problems
id: Penjelasan harus cukup relevan dengan permasalahan peserta

source: The explanation has to be easily accepted by the participants
id: Penjelasan harus mudah diterima oleh peserta.

source: The explanation has to match the participants’ wealth of knowledge at the time
id: Penjelasan harus cocok dengan khazanah pengetahuan peserta pada saatnya.

source: Presenting explanation
id: Menyajikan penjelasan.

source: A few things to notice in presenting an explanation are:
id: Beberapa hal yang perlu diperhatikan dalam menyajikan suatu penjelasan adalah:

source: Clarity, can be achieved by:
id: Kejelasan, yang dapat dicapai dengan :

source: The articulation has to be clear, the words, the idioms and the voice
id: Bahasa yang diucapkan harus jelas kata-katanya, ungkapannya, maupun suaranya.

source: Conversation has to go smooth by avoiding unnecessary words, e.g. ee, aa, etc.
id: Pembicaraan harus lancar dengan menghindari kata-kata yang tidak perlu, misalnya “ee”, “aa”, dan lain sebagainya.

source: Sentences have to be arranged with good grammar by avoiding incomplete sentences
id: Kalimat disusun dengan tata bahasa yang baik dengan menghindari kalimat yang tidak lengkap.

source: Technical or new terms should be defined clearly
id: Istilah-istilah teknis atau istilah baru harus didefinisikan dengan jelas.

source: Using pause time (silent) to see whether the explanation has been understood by the participants
id: Menggunakan waktu diam sejenak (senyap) untuk melihat apakah yang dijelaskan itu telah dimengerti oleh siswa.

source: Usage of examples and illustrations, including
id: Menggunakan contoh dan ilustrasi, meliputi penggunaan

source: Inductive: Example/ illustration concept/ generalization
id: Induktif : Contoh/ilustrasi konsep/generalisasi.

source: Deductive: Concept/ generalization examples/ illustrations
id: Deduktif: Konsep/generalisasi contoh/ilustrasi

source: Provision of emphasis, including the use of voice variation, mimic, gestures, summary, repetition, giving symbols, etc.
id: Memberikan penekanan, meliputi penggunaan variasi suara, mimik, gerak, ikhtisar, pengulangan, memberi tanda dan sebagainya.

source: It is important to show important parts that need attention from others
id: Hal tersebut untuk menunjukan bagian yang penting yang perlu mendapat perhatian dari pada orang lain.

source: Organization, including creating relationship between examples, clear generalization and summarizing during or at the end of the presentation
id: Pengorganisasian, meliputi membuat hubungan antara contoh dan generalisasi yang jelas serta memberikan ikhtisar selama atau pada akhir sajian.

source: Feedback, including a behavioral change from the participants and providing the opportunity for participants to answer questions as well as expressing opinions on whether the explanation given by the trainer is useful
id: Umpan balik, meliputinya adanya perubahan tingkah laku peserta dan memberikan kesempatan kepada peserta untuk menjawab pertanyaan pelatih serta mengajukan pendapat apakah penjelasan yang diberikan oleh pelatih memberikan manfaat bagi peserta.

source: **c. Inquiry basic skill**
id: **Keterampilan Dasar Bertanya**

source: Asking a question can be interpreted as a greeting delivered with the intention of requesting a response from others. In the teaching process, the given response reflects the extent to which level of knowledge the participants have. So asking questions in the session is important because the trainer’s skill in asking effective questions will be the stimulus that will stimulate thinking skills and will encourage participants.
id: Bertanya dapat diartikan sebagai ucapan yang disampaikan dengan maksud meminta respon dari orang lain. Dalam proses pengajaran respon yang diberikan mencerminkan sampai dimana tingkat pengetahuan peserta. Jadi bertanya dalam pembelajaran penting karena tingkat kemampuan pelatih dalam mengajukan pertanyaan yang efektif akan merupakan stimulus yang akan merangsang dan akan mendorong kemampuan berpikir peserta.

source: The purpose of asking includes:
id: Tujuan bertanya antara lain :

source: Stimulate participants’ thinking skills
id: Merangsang kemampuan berpikir peserta.

source: Assist participants in learning
id: Membantu peserta dalam belajar.

source: Direct the participants independent interaction level on level of self-learning interaction.
id: Mengarahkan peserta pada tingkat interaksi belajar yang mandiri.

source: Increase participants’ thinking component of low-level components to a higher level
id: Meningkatkan komponen berfikir peserta dari komponen berfikir tingkat rendah ke tingkat yang lebih tinggi.

source: Assist participants in achieving the learning objectives
id: Membantu peserta dalam mencapai tujuan pelajaran yang disampaikan.

source: **Components of Inquiry Basic Skill**
id: **Komponen Keterampilan Dasar Bertanya**

source: Basic skills
id: Keterampilan tingkat dasar

source: Components included in the inquiry basic skill are:
id: Komponen yang termasuk dalam keterampilan dasar bertanya meliputi:

source: Disclosure of questions clearly and concisely
id: Pengungkapan pertanyaan secara jelas dan singkat.

source: Details in asking questions so that participants can answer correctly, the trainer needs to provide information that will help make examples of the question
id: Perincian dalam, supaya peserta dapat menjawab dengan tepat, dalam mengajukan pertanyaan pelatih perlu memberikan informasi-informasi yang menjadikan contoh pertanyaan.

source: Convergence towards the accepted answer
id: Pemusatan ke arah jawaban yang diterima

source: Convergence can be done by means of: providing a broad question (open-ended) which will convert into a narrow question
id: Pemusatan dapat dikerjakan dengan cara: memberikan pertanyaan yang luas (terbuka) yang kemudian mengubahnya menjadi pertanyaan yang sempit.

source: Transfer of turns to answer
id: Pemindahan giliran menjawab.

source: Transfer of turns can be done by asking different participants to answer the same question
id: Pemindahan giliran menjawab dapat dikerjakan dengan cara meminta peserta yang berbeda untuk menjawab yang sama.

source: The spread of questions
id: Penyebaran pertanyaan

source: For certain purposes the coach can throw the question to the whole class, to a participant or spread from one participant to the others.
id: Untuk maksud tertentu pelatih dapat melemparkan pertanyaan ke seluruh kelas, ke peserta tertentu atau menyebarkan peserta ke peserta yang lain.

source: Provision of time to think
id: Pemberian waktu berfikir

source: In asking question, a trainer has to stay silent a moment before appointing a participant to answer the questions
id: Dalam mengajukan pertanyaan pelatih harus berdiam diri sesaat sebelum menunjukkan peserta merespon pertanyaannya.

source: Provision of guidance
id: Pemberian tuntunan

source: For participants having difficulty in answering the question, a strategy to provide guidance needs to be given. The strategy includes the disclosure of the question with other form or manner, asking other simpler questions, and repeats the previous explanations.
id: Bagi peserta yang mengalami kesukaran dalam menjawab pertanyaan strategi pemberian tuntunan perlu dikerjakan. Strategi itu meliputi pengungkapan pertanyaan dengan bentuk atau cara yang lain, mengajukan pertanyaan lain yang lebih sederhana, dan mengulangi penjelasan-penjelasan sebelumnya.

source: Advance level skills, components added:
id: Keterampilan Tingkat Lanjutan, ditambahkan komponen:

source: The conversion of rate of cognitive guidance in answering the question
id: Pengubahan tuntunan tingkat kognitif dalam menjawab pertanyaan.

source: To develop the participants’ way of think we need cognitive level of guidance questions (recall, comprehension, application, systematic analysis, and evaluation)
id: Untuk mengembangkan kemampuan berfikir peserta diperlukan pengubahan tuntunan tingkat kognitif pertanyaan (ingat, pemahaman, penerapan, analisis sistetis, dan evaluasi)

source: Setting the order of questions
id: Pengaturan urutan pertanyaan.

source: The questions asked have to have a logical sequence
id: Pertanyaan yang diajukan haruslah mempunyai urutan yang logis.

source: The use of tracing questions
id: Penggunaan pertanyaan pelacak.
