Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/tot/502_communication_skills.po
Languages: id

source: Module 2
id: Modul 2

source: Communication Skills
id: Keterampilan Komunikasi

source: Basic Competency
id: Kompetensi Dasar

source: Demonstrate communication skills in training
id: Mendemonstrasikan keterampilan berkomunikasi dalam pelatihan

source: Indicator
id: Indikator

source: Describe the principles of effective communication
id: Mendeskripsikan prinsip-prinsip dari komunikasi efektif

source: Describe the communication models in training
id: Mendeskripsikan model-model komunikasi dalam pelatihan

source: Demonstrate 9 basic skills components in teaching/ training
id: Mendemonstrasikan 9 komponen keterampilan dasar dalam mengajar/melatih

source: Material
id: Materi

source: **Communication Skills** 1. The principles of effective communication 2. Communication models in training 3. Components of teaching / training basic skills
id: **Keterampilan Komunikasi** 1. Prinsip dari komunikasi yang efektif 2. Model-model komunikasi dalam pelatihan 3. Komponen keterampilan dasar megajar/melatih.

source: Activity Steps
id: Langkah kegiatan

source: **TIME**
id: **WAKTU**

source: **ACTIVITY**
id: **KEGIATAN**

source: **SUMMARY**
id: **IKHTISAR**

source: 5 mins
id: 5 menit

source: The facilitator welcomes the participants and opens the training with prayer
id: Fasilitator mengucapkan selamat datang di pelatihan dan membuka pelatihan dengan doa pembukaan.

source: Informs the rules of training
id: Menginformasikan tata tertib pelatihan

source: The facilitator explains the topic and the purpose of the first session
id: Fasilitator menjelaskan tentang topik dan tujuan dari sesi pertama

source: Opening Information
id: Informasi pembukaan

source: 20 mins
id: 20 menit

source: The facilitator asks two participants to come forward to communicate without being given any topic
id: Fasilitator meminta dua orang peserta untuk berpartisipasi dalam diskusi singkat tanpa memberitahu terlebih dahulu mengenai topik yang dibahas dalam pelatihan

source: Afterwards, ask 2 other participants to communicate with a topic and give them time to have a small talk first
id: Setelah itu, mintalah 2 peserta untuk berdiskusi mengenai topik dan berikan mereka waktu untuk berdiskusi ringan terlebih dahulu

source: Participants are asked to analyze the difference of the two communications demonstrated, to look for the the answer of what makes effective communication
id: Para peserta diminta untuk menganalisis perbedaan dari kedua demonstrasi teknik berkomunikasi, untuk mendapatkan jawaban manakah yang mampu menciptakan komunikasi yang efektif

source: Trainer reinforces with the principles of effective communication
id: Pelatih menegaskan prinsip-prinsip dari komunikasi efektif

source: Demonstration Question & Answers
id: Demontrasi Pertanyaan & Jawaban

source: 30 mins
id: 30 menit

source: Facilitator raises an issue of communication model in training to the participants
id: Fasilitator memberikan masalah dari model komunikasi dalam pelatihan untuk para peserta

source: Give participants 2-5 minutes the chance to **think** independently
id: Secara mandiri peserta diberi kesempatan 2-5 menit untuk **berfikir**.

source: When finished, ask them to discuss the same issue with the person next to them for 3-5 minutes (**pair**)
id: Ketika sudah selesai, mintalah mereka untuk berdiskusi tentang masalah yang sama dengan rekan di sebelahnya selama 3-5 menit (**berpasangan**)

source: Finally, select a pair to express their opinions in front of the class (**share**)
id: Akhirnya pilihlah satu pasangan untuk mengemukakan pendapat mereka di depan kelas (**share**).

source: Facilitator reinforces with communication models in training
id: Fasilitator menjelaskan tentang model-model berkomunikasi dalam pelatihan

source: Think, pair and share
id: Berpikir, berdiskusi, dan berbagi

source: Trainer delivers the materials of 9 basic skills in teaching
id: Pelatih menjelaskan materi tentang 9 keahlian dasar dalam mengajar

source: Participants are asked to create training materials as a group to practice the 9 basic skills in teaching
id: Peserta diminta berkelompok untuk membuat materi pelatihan untuk mempraktikkan 9 keterampilan dasar dalam mengajar

source: 2 groups are selected to simulate the basic skills in teaching
id: Dua kelompok dipilih untuk mensimulasikan keterampilan dasar mengajar

source: Other participants will act as observers
id: Peserta yang lain akan bertindak sebagai pengamat

source: Discuss the result of the observations
id: Diskusikan hasil dari pengamatan

source: Facilitator reinforces with the 9 basic skill in teaching
id: Fasilitator memberi penguatan tentang 9 keterampilan dasar mengajar

source: Simulation
id: Simulasi

source: The facilitator asks one of the participants to reflect the implementation of the first session
id: Fasilitator meminta salah seorang peserta untuk merefleksikan implementasi dari sesi pertama

source: First session reflection and closing
id: Refleksi sesi pertama dan penutupan

source: Reading Material
id: Bahan Bacaan

source: Foreword
id: Pendahuluan

source: Communication is the main skill for someone to become a trainer. There are several things that need to be understood including the meaning and purpose of communication and Principles of Proper or Effective Communication. So is the case for the trainer of Contingency Plan Development Scenarios using OpenStreetMap (OSM) and QGIS / InaSAFE.
id: Komunikasi adalah keterampilan utama yang harus dimiliki seorang pelatih. Ada beberapa hal yang harus dipahami termasuk maksud dan tujuan dari komunikasi dan prinsip-prinsip yang tepat atau komunikasi yang efektif. Hal yang sama juga diperlukan oleh pelatih Skenario Pembangunan Rencana Kontinjensi menggunakan OpenStreetMap (OSM) dan QGIS / InaSAFE.

source: Communication in everyday life plays a very important part, this is because communication has the function to connect a person’s wishes to others. Specifically, communication runs four functions, i.e. the function of control, motivation, emotional expression and information.
id: Komunikasi dalam kehidupan sehari-hari memegang peranan yang sangat penting, hal ini dikarenakan komunikasi memiliki fungsi untuk menghubungkan keinginan seseorang kepada orang lain. Secara spesifik komunikasi menjalankan empat fungsi, yaitu: fungsi kendali, motivasi, pengungkapan emosional dan informasi.

source: Communication is generally defined as the process of creating the meaning of ideas or ideas presented. The trainer’s interests in training will naturally require effective communication, used as a mean to convey ideas and motivate someone to do something in accordance with the purpose of the training. The ideas will be presented in this training are all about disaster, in particular the Contingency Plan Development Scenarios using OpenStreetMap (OSM) and QGIS / InaSAFE. Related to this, the trainer has to have the basic skills in teaching or training because training is basically teaching the participants to be able to do something.
id: Komunikasi secara umum diartikan sebagai proses penciptaan arti terhadap gagasan atau ide yang disampaikan. Kepentingan pelatih dalam melatih tentu saja diperlukan komunikasi efektif yang digunakan sebagai sarana untuk menyampaikan gagasan dan memotivasi seseorang untuk melakukan sesuatu sesuai dengan tujuan pelatihan. Gagasan yang akan disampaikan dalam pelatihan ini adalah tentang kebencanaan khususnya pada Pengembangan Skenario untuk Rencana Kontijensi dengan menggunakan OpenStreetMap (OSM) dan QGIS/InaSafe. Berkaitan dengan hal tersebut yang harus dimiliki pelatih adalah keterampilan dasar mengajar atau melatih karena pada prinsipnya melatih adalah mengajar kepada peserta untuk dapat melakukan sesuatu.

source: 1. The principles of effective communication
id: 1. Prinsip-prinsip dari komunikasi efektif

source: Communication is generally defined as the process of creating the meaning of ideas or ideas presented. In this case communication requires at least 4 components or elements, i.e. (1) The sender or messenger/ communicator, (2) the message, (3) the recipient of the message/ communicant, (4) Media/ channel. In effective communication process, communicator and communicant not only performed linear communication, but also expected to performed circular communication.
id: Komunikasi secara umum diartikan sebagai proses penciptaan arti terhadap gagasan atau ide yang disampaikan. Dalam hal ini komunikasi diperlukan sekurang-kurangnya 4 komponen atau unsur, yaitu: (1) Pengirim atau pembawa pesan/ komunikator, (2) Isi Pesan , (3) Penerima pesan/komunikan, (4) Media/saluran . Pada proses komunikasi yang efektif, komunikator dan komunikan tidak hanya berkomunikasi yang bersifat linier, tetapi diharapkan juga bersifat sirkuler.

source: Linear communication model is a process that consists of two straight lines, where the communication process starts from the communicator and ends at the communicant. The circular model of communication, on the other hand, is a communication process that not only starts from the communicator and ends at the communicant, but also pays attention to the feedback from the communicant, making the model a full circle process. This means that the trainer can be the source of information at one time and the recipient at another time, vice versa. Participants can be the recipient of information but also the source of information. So communication is a simultaneous notice or exchange. The communication process as mentioned above can be seen below.
id: Model komunikasi linier adalah proses yang hanya terdiri dari dua garis lurus, dimana proses komunikasi berawal dari komunikator dan berakhir pada komunikan. Sedangkan komunikasi model sirkuler adalah proses komunikasi yang tidak hanya berawal dari komunikator dan berakhir pada komunikan, tetapi memperhatikan adanya feedback dari komunikan, sehingga komunikasi sirkuler merupakan proses satu lingkaran penuh. Artinya suatu saat pelatih berkedudukan sebagai sumber informasi tetapi pada saat yang lain sebagai penerima informasi, begitu sebaliknya. Peserta bisa sebagai penerima informasi tetapi bisa juga sebagai sumber informasi. Jadi komunikasi adalah pemberitahuan atau pertukaran secara simultan. Gambar proses komunikasi seperti dimaksud di atas dapat dilihat pada bagan proses komunikasi di bawah ini.

source: Communication process above indicates that the trainee can act both as the recipient of information/ message and the source of information/ message. But the trainer as the actor in the process of communication still has to control the training process. Therefore the trainer remains as the communicator, as communicator plays a very important part especially in controlling the course of communication, so that the message is well received by the recipient (communicant) or the participants. This is in accordance with the function of communication.
id: Proses komunikasi di atas menunjukkan bahwa peserta pelatihan bisa berperan sebagai penerima informasi/pesan dan bisa sebagai sumber informasi/pesan. Tetapi pelatih sebagai pelaku dalam proses komunikasi, tetap harus mengendalikan proses pelatihan. Untuk itu pelatih tetap harus memposisikan sebagai komunikator, karena komunikator memegang peranan yang sangat penting terutama dalam mengendalikan jalannya komunikasi, sehingga pesan tersebut diterima oleh penerima (komunikan) atau peserta pelatihan secara baik. Hal tersebut sesuai dengan fungsi komunikasi.

source: The function of communication according to Gordon I Zinmmerman in Thomas M. Scheidel (1976) is a function of the content, which involves the exchange of information we need to complete our task, and the function of relationship, which involves the exchange of information about how our relationship is with others. While the function of communication according to Thomas M. Scheidel (1976) is: "We communicate primarily to represent and support self-identity, to establish social contact, to influence others to feel, think and act as we want.
id: Fungsi komunikasi menurut Gordon I Zinmmerman dalam Thomas M. Scheidel (1976) adalah fungsi isi, yg melibatkan pertukaran informasi yang kita perlukan untuk menyelesaikan tugas kita, dan fungsi hubungan, yg melibatkan pertukaran informasi mengenai bagaimana hubungan kita dengan orang lain. Sedangkan fungsi komunikasi menurut Thomas M. Scheidel (1976) adalah: “Kita berkomunikasi terutama untuk menyatakan dan mendukung identitas diri, untuk membangun kontak sosial, mempengaruhi orang lain untuk merasa, berfikir dan bertindak seperti yg kita inginkan.

source: The two opinions above indicate that the purpose of communication is for the recipient to understand and comprehend the message conveyed by the messenger. Trainers are expected to explain the wish or the idea according to the purpose of the training to the participants with a simple but precise or accurate way. Here communication process is expected to pay attention to the feedback from the participants, which can be described as follows.
id: Dua pendapat di atas menunjukkan bahwa tujuan komunikasi adalah penerima pesan dapat mengerti dan memahami pesan yang disampaikan pemberi pesan. Pelatih diharapkan mampu menjelaskan keinginan atau ide sesuai tujuan pelatihan kepada peserta dengan sederhana namun tepat atau akurat. Dalam kepentingan ini diharapkan proses komunikasi memperhatikan masukan dari peserta pelatihan, yang dapat digambarkan sebagai berikut.

source: The communication process above shows that communication is the message conveyed to the communicant (recipient) by the communicator (source) through certain channels either directly/ indirectly for the purpose of giving impact/ effect to the communicant as desired by the communicator. It goes through 5 stages, i.e. (1) Interpretation, (2) Encryption, (3) Delivery, (4) Acceptance, and (5) Feedback. To achieve the objective of communication, the principles of effective communication are also required. To have a smooth communication, it is necessary to use the principle of effective communication. Principles include Respect, Empathy, Audible, Clarity, and Humble.
id: Proses komunikasi di atas menunjukkan bahwa komunikasi merupakan pesan yang disampaikan kepada komunikan (penerima) dari komunikator (sumber) melalui saluran-saluran tertentu baik secara langsung/tidak langsung dengan maksud memberikan dampak/effect kepada komunikan sesuai dengan yang diingikan komunikator. Proses komunikasi tersebut melalui 5 tahap, yaitu: (1) Tahap pertama “Penginterpretasian”, (2) Tahap kedua “Penyandian” , (3) Tahap ketiga “Pengiriman” , (4) Tahap keempat “Penerimaan” , dan (5) Tahap kelima “Feedback/Umpan balik” . Untuk mencapai tujuan komunikasi diperlukan juga penggunaan prinsip-prinsip komunikasi efektif. Supaya komunikasi berjalan dengan baik, maka diperlukan penggunaan prinsip komunikasi efektif. Prinsip itu antara lain: *Respect, Empathy, Audible, Clarity, Humble*.

source: **Respect**.
id: **Respek**.

source: Respect is the positive feeling or respect for the listener. Everyone wants to be appreciated and respected and it has become the need of each individual. For that reason, the trainer is expected to respect the other person, or in this case the trainees.
id: Respect adalah perasaan positif atau penghormatan diri kepada lawan bicara. Semua orang ingin dihargai dan dihormati dan menjadi kebutuhan setiap individu. Untuk itu pelatih diharapkan menghargai lawan bicara atau dalam hal ini adalah peserta pelatihan.

source: **Empathy**.
id: **Empati**.

source: Empathy is the ability to put yourself in situations or conditions faced by others. Communication will be well established in accordance with good psychological condition of our counterpart. To empathize means that the trainer has to put himself as a good listener, even before anyone else listens to him. And he must be able to feel what is perceived by the trainees.
id: Empati adalah kemampuan untuk menempatkan diri pada situasi atau kondisi yang tengah dihadapi orang lain. Komunikasi akan terjalin dengan baik sesuai kondisi psikologis lawan bicara. Ber-Empati artinya pelatih harus menempatkan diri sebagai pendengar yang baik, bahkan sebelum orang lain mendengarkan kita. Dan pelatih harus mampu merasakan apa yang dirasakan oleh orang lain dalam hal ini peserta pelatihan.

source: **Audible**.
id: **Audible/Dapat Didengar**

source: Audible implies that the message must be able to be heard and understood. In this matter what has to be done by the trainer are
id: Audible mengandung makna bahwa pesan harus dapat didengarkan dan dimengerti. Dalam kepentingan ini yang harus dilakukan pelatih adalah:

source: The message must be easily understood, using proper and correct grammar. Avoid languages unfamiliar to others.
id: Pesan harus mudah dipahami, menggunakan bahasa yang baik dan benar. Hindari bahasa yang tidak dipahami oleh lawan bicara.

source: Convey the important part of the message by simplifying the message, straight to the point because most people don’t like listening to long-winded things.
id: Pesan disampaikan yang penting, dengan cara menyederhanakan pesan, langsung saja pada inti persoalan karena sebagian besar orang tidak suka mendengar yang bertele-tele.

source: Use body language. Facial expressions, eye contact, hand gestures and body positions can be easily read by the interlocutor.
id: Menggunakan bahasa tubuh. Mimik wajah, kontak mata, gerakan tangan dan posisi badan bisa dengan mudah terbaca oleh lawan bicara.

source: Use illustrations or examples. Analogy really helps in conveying the message. You could use real life examples and illustrations.
id: Menggunakan ilustrasi atau contoh. Analogi sangat membantu dalam penyampaian pesan. Dapat digunakan Ilustrasi dan contoh nyata.

source: **Clarity**.
id: **Clarity/Jelas**.

source: Clarity is the clarity of the messages we convey. On this principle the trainer has set clear objectives before the training and uses a good tone of voice.
id: Clarity adalah kejelasan dari pesan yang kita sampaikan. Pada prinsip ini pelatih menetapkan tujuan secara jelas sebelum pelaksanaan pelatihan dan menggunakan intonasi suara yang baik.

source: **Humble**.
id: **Humble/Rendah Hati**

source: Humility gives positive prestige for the communicator. In this case, humble is done by giving participants a chance to speak first and the trainer being a good listener. This attitude builds respect and eventually develops respect for the participants.
id: Sikap rendah hati memberikan pamor positif pada komunikator. Dalam kepentingan ini rendah hati dilakukan dengan memberikan kesempatan kepada peserta untuk berbicara terlebih dahulu dan pelatih menjadi pendengar yang baik. Sikap ini membangun rasa hormat dan pada akhirnya mengembangkan respek kepada peserta.

source: 2. Communication models in training
id: 2. Gaya Berkomunikasi dalam Pelatihan

source: Communication in training is a process of delivering communication conditioned for training purposes. The training process is essentially a communication process delivering messages containing training materials. In this regard the training is expected to use a circular model of communication, which is a process that not only starts from the communicator and ends at communicant, but also pays attention to the feedbacks from the communicant, to make the communication effective.
id: Komunikasi dalam pelatihan adalah adalah proses penyampaian komunikasi yang dikondisikan untuk tujuan pelatihan. Proses pelatihan pada hakekatnya adalah proses komunikasi yang merupakan penyampaian pesan berisi materi-materi pelatihan. Berkaitan dengan hal tersebut dalam pelatihan diharapkan menggunakan komunikasi model sirkuler, yaitu proses komunikasi yang tidak hanya berawal dari komunikator dan berakhir pada komunikan, tetapi memperhatikan adanya feedback dari komunikan, sehingga komunikasi bisa efektif.

source: Effective communication in training is expected to use verbal and non-verbal communication. Verbal communication is communication using verbal symbols/ words verbally. Non-verbal communication is the kind of communication not using verbal words, but gestures, body language, facial expressions, and eye contact. It could also be done with the use of objects such as clothes, haircuts and so forth.
id: Komunikasi efektif dalam pelatihan, diharapkan menggunakan komunikasi verbal dan non verbal. Komunikasi verbal adalah komunikasi dengan menggunakan simbol-simbol verbal/dengan kata atau secara lisan. Sedangkan komunikasi non verbal adalah komunikasi dengan tidak menggunakan kata-kata, tetapi menggunkan gerak isyarat, bahasa tubuh, ekspresi wajah, kontak mata. Bisa juga dengan penggunaan objek seperti pakaian, potongan rambut dan lain sebagainya.

source: Non-verbal communication will help the trainer to become an interesting speaker. Verbal communication has to be supported by means of talking such as intonation, giving emphasis, sound quality, style of speech and emotion. It also uses gestures, body language, facial expressions, eye contact, and supported by the use of objects such as clothes, haircuts, and so forth.
id: Komunikasi non verbal akan membantu pelatih untuk menjadi pembicara yang menarik. Dalam komunikas verbal atau lisan harus didukung dengan cara berbicara seperti intonasi, pemberian tekanan, kualitas suara, gaya berbicara dan gaya emosi. Selain itu juga menggunakan gerak isyarat, bahasa tubuh, ekspresi wajah, kontak mata. Dan didukung juga dengan penggunaan objek seperti pakaian, potongan rambut dan lain sebagainya.

source: Training methods
id: Metode Pelatihan

source: Training is essentially a learning process that contains three elements, i.e. inputs (raw materials to be processed), process (activity to process inputs) and outputs (results that have been processed). Input of the training is the participants before starting the training, the training process is the interaction between the components of teaching and learning which are the objectives, materials, methods, participants, facilities and assessment. The output of the training is the participants after finishing the training.
id: Pelatihan pada hakikatnya adalah suatu proses belajar mengajar yang mengandung tiga unsur, yaitu input (bahan mentah yang akan diolah), process (kegiatan mengolah input) dan output (hasil yang telah diolah). Input pelatihan adalah peserta sebelum mengikuti pelatihan, proses pelatihan adalah interaksi antara komponen-komponen belajar mengajar yaitu tujuan, bahan, metode, peserta pelatihan, fasilitas dan penilaian. Output dari pelatihan adalah peserta setelah menerima pelatihan.

source: A process is considered good if the output quality is better than the input. The learning process or training is a behavioral change, which occurs as the result of experience. This means it can only be called as a learning process if a person is showing different behavior. He needs to prove the new knowledge of facts, or do something which he couldn’t previously. Thus, the learning process puts someone from one capability or competence status to the other.
id: Suatu proses dipandang baik apabila kualitas output lebih baik dari pada input. Proses belajar atau pelatihan adalah suatu perubahan tingkah laku, yang terjadi sebagai hasil pengalaman. Ini berarti, hanya dapat dikatakan terjadi proses belajar apabila seseorang menunjukkan tingkah laku yang tidak sama. Jika ia dapat membuktikan pengetahuan tentang fakta-fakta baru atau ia bisa melakukan sesuatu, yang sebelumnya ia tidak dapat melakukannya. Jadi, proses belajar menempatkan seseorang dari status kemampuan atau kecakapan yang satu kepada kemampuan/kecakapan yang lain.
