Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/tutorial-docs/socialisation/run-basic-inasafe.po
Languages: id

source: Run basic |project_name|
id: Menjalankan |project_name| Dasar

source: **Objectives:**
id: **Tujuan:**

source: To run |project_name| using a flood model & population and examine the results
id: Untuk menjalankan |project_name| menggunakan permodelan banjir & penduduk dan pemeriksaan hasil

source: To create a impact map
id: Untuk membuat peta dampak

source: To modify the threshold of an impact function
id: Untuk mengubah ambang batas fungsi dampak

source: To run |project_name| using a flood model & building and examine the results
id: Untuk menjalankan |project_name| menggunakan model banjir & bangunan dan pemeriksaan hasil

source: To run |project_name| with aggregation (optional)
id: Untuk menjalankan |project_name| dengan agregasi (opsional)

source: **Expected Results:**
id: **Hasil yang Diharapkan:**

source: Participants are able to:
id: Peserta dapat:

source: run and understand the results of an |project_name| using a flood model & population
id: menjalankan dan memahami hasil |project_name| menggunakan model banjir dan populasi

source: create an impact map using the |project_name| print button
id: membuat peta dampak menggunakan |project_name| tombol print

source: change the threshold of an impact function
id: mengubah ambang batas pada fungsi dampak

source: run and understand the results of an |project_name| using a flood model & building
id: menjalankan dan memahami hasil |project_name| menggunakan model banjir dan bangunan

source: run |project_name| with aggregation by district (optional)
id: menjalankan |project_name| dengan agregasi berupa kabupaten (opsional)

source: Introduction
id: Pengantar

source: In this chapter you will run |project_name| in Jakarta to determine the impact of a flood model on Jakarta's population and buildings.
id: Pada bab ini Anda akan menjalankan |project_name| di Jakarta untuk menentukan dampak dari model banjir dengan populasi dan bangunan Jakarta.

source: :guilabel:`Open` Jakarta_floods.qgs - File/Open Project... ,
id: :guilabel:`Buka` Jakarta_floods.qgs - File/Open Project... ,

source: :guilabel:`Click` on browse navigate to |project_name| projects and :guilabel:`Select` *Jakarta_floods*, :guilabel:`Click` open and then open again
id: :guilabel:`Klik` pada browser arahkan ke proyek |project_name| dan :guilabel:`Pilih` *Jakarta_floods*, :guilabel:`Klik` buka dan kemudian buka lagi

source: People need evacuating
id: Penduduk yang membutuhkan evakuasi

source: As you can see the |project_name| panel has the first three drop down menus filed in already:
id: Seperti yang Anda dapat lihat pada panel |project_name| memiliki tiga menu drop down yang sudah diajukan dalam:

source: a flood similar to the 2007 Jakarta event
id: Banjir yang sama dengan peristiwa di Jakarta pada tahun 2007

source: buildings
id: bangunan

source: Be Flooded
id: Terkena Banjir

source: :guilabel:`Click` the arrow next to buildings, :guilabel:`Select` people, it now should have:
id: :guilabel:`Klik` panah disamping bangunan, :guilabel:`Pilih` penduduk, sekarang harus memiliki:

source: people
id: orang

source: Need evacuating
id: Membutuhkan evakuasi

source: You can see that the Impact function below ٥Might٥ automatically changes depending on the layers added
id: Anda dapat lihat bahwa fungsi dampak di bawah ٥Might٥ secara otomatis berubah tergantung pada layer yang ditambahkan

source: Lets run this scenario first - :guilabel:`Click` Run at the bottom right hand corner of the |project_name| panel.
id: Mari kita jalankan skenario pertama ini - :guilabel:`Klik` Run di sudut kanan bawah dari panel |project_name|.

source: A new layer should appear in the layer panel called ٥Population which needs evacuating٥ and in the |project_name| Panel, inside the main window you will see text and statistics, lets explore this further.
id: Layer baru harus muncul pada panel layer yang disebut ٥Penduduk yang membutuhkan evakuasi٥ dan pada Panel |project_name|, di dalam jendela utama Anda akan melihat teks dan statistik, mari mengeksplor lebih lanjut.

source: In this scenario there are 1,109,000 people that could be exposed to more than 1 meter of water, it is assumed that all of these people will need to evacuate their homes.
id: Pada skenario ini ada 1.109.000 penduduk yang dapat terkena banjir dengan kedalaman lebih dari 1 meter air, ini diasumsikan bahwa semua penduduk ini perlu mengevakuasi rumah mereka.

source: The Minimum needs, is calculated using the above evacuation number to estimate the amount of food, water and other products that the refugees will need to survive.
id: Kebutuhan minimum, dihitung menggunakan jumlah evakuasi di atas untuk memperkirakan jumlah makanan, air, dan produk lainnya agar pengungsi harus bertahan hidup.

source: Action list: designed to make disaster managers think about what they need to do to prepare for the event.
id: Daftar tindakan: dirancang untuk membuat penanggulangan bencana mengenai apa yang mereka butuhkan untuk melakukan persiapan peristiwa tersebut.

source: explains the total people in the map canvas, when evacuation is needed, and source of the minimum needs assessment.
id: menjelaskan jumlah penduduk pada kanvas peta, ketika evakuasi dibutuhkan, dan sumber dari penilaian kebutuhan minimum.

source: Source of the Hazard and Population Datasets
id: Sumber Dataset Ancaman dan Populasi

source: Statistical breakdown of the number of females, and added minimum needs for women hygiene and pregnant women.
id: Rincian statistik jumlah wanita, dan ditambah kebutuhan minimum untuk kesehatan wanita dan wanita hamil.

source: Statistical breakdown of Youth, Adults and Elderly.
id: Rincian statistik Muda, Dewasa, dan Lansia.

source: Print Results
id: Mencetak Hasil

source: :guilabel:`Click` the print button at the bottom the inasafe panel
id: :guilabel:`Klik` tombol cetak di bawah panel inasafe

source: Navigate to where you would like to save the pdf, :guilabel:`Click` save
id: Navigasikan dimana Anda akan menyimpan pdf, :guilabel:`Klik` simpan

source: Two PDFs will be generated
id: Dua PDF akan dihasilkan

source: The result provides a map and a table of information about the impact.
id: Hasil yang disediakan berupa sebuah peta dan sebuah tabel informasi mengenai dampak.

source: **Help is needed to reconstruct the InaSAFE print output to be more benefical to disaster managers**
id: **Bantuan diperlukan untuk merekonstruksi hasil cetak InaSAFE lebih bermanfaat untuk penanggulangan bencana**

source: **If you get time during this course please proved us with your ideas on how the print map and table should look!**
id: **Jika Anda memiliki lebih waktu selama pelatihan ini, silakan buktikan pada kami seperti apa hasil peta dan tabel yang Anda buat!**

source: Changing threshold
id: Mengubah ambang batas

source: What if the disaster manager has decided that actually anyone in more than 80cm of water should be evacuated?
id: Bagaimana jika manager bencana sudah menentukan bahwa sebenarnya orang harus dievakuasi apabila air telah mencapai lebih dari 80 cm?

source: :guilabel:`Click` the impact function editor button (the pencil icon next to ٥Need Evacuation٥)
id: :guilabel:`Klik` tombol fungsi dampak (ikon pensil di samping ٥Butuh Evakuasi٥)

source: Type 0.8 next to Thresholds
id: Ketik 0.8 di samping Ambang batas

source: :guilabel:`Click` OK
id: :guilabel:`Klik` OK

source: :guilabel:`Click` the Run button
id: :guilabel:`Click` tombol Run

source: How many people need to be evacuated
id: Berapa banyak penduduk yang perlu dievakuasi

source: Answer
id: Jawaban

source: :guilabel:`Click` |project_name| Print, save as ٥people in need of evacuation above 80cm٥
id: :guilabel:`Klik` Print |project_name|, simpan sebagai ٥orang yang perlu dievakuasi di atas 80cm٥

source: Before moving onto buildings, lets turn some layers off. In your Layer panel you will now have 5 layers, we are going to uncheck everything but:
id: Sebelum beralih pada jumlah bangunan, mari matikan beberapa layer. Pada panel Layer, Anda sekarang akan memiliki 5 layer, kita hapus centang segala sesuatunya terlebih dahulu tetapi:

source: Buildings Affected
id: Bangunan yang terkena dampak

source: Check that buildings is in the drop down menu under ٥How Many٥
id: Periksa bangunan pada menu drop down di bawah ٥How Many٥

source: :guilabel:`Click` on the arrow, as you can see you can not :guilabel:`Select` people, as we have uncheck it in the layer panel
id: :guilabel:`Klik` pada panah, seperti yang Anda lihat bahwa Anda tidak dapat :guilabel:`Pilih` penduduk, seperti yang telah kita hapus centang tersebut pada layer panel

source: If you want to be able to Select layer that are not checked, there is an option in the InaSAFE options window that can be turned off. We will go through the option menu later in the training.
id: Jika Anda ingin memilih layer yang tidak dicentang, ada pilihan di jendela pilihan InaSAFE yang dapat dimatikan. Kita akan melalui menu pilihan selanjutnya dalam pelatihan.

source: :guilabel:`Click` Run
id: :guilabel:`Klik` Run

source: In this scenario approximately 796 buildings could be effected out of 13, 629 buildings.
id: Pada skenario ini sekitar 796 bangunan terkena dampak dari jumlah total 13.629 bangunan.

source: Due to the provincial BPBD work in OpenStreetMap they have mapped all important building (and then sum).
id: Karena BPBD provinsi bekerja dalam OpenStreetMap, mereka telah memetakan semua bangunan penting (lalu sejumlah bangunan lainnya).

source: Important buildings are defined as:
id: Bangunan penting didefinisikan sebagai:

source: Clinic
id: Klinik

source: Fire Stations
id: Pos Pemadam Kebakaran

source: Government
id: Pemerintahan

source: Hospitals
id: Rumah sakit

source: Place of Worship
id: Tempat Peribadatan

source: Police
id: Polisi

source: Schools
id: Sekolah

source: Sports Centres
id: Pusat Olahraga

source: A different set of Actions have been identified to relate to structures.
id: Perbedaan aturan tindakan yang telah diidentifikasi terkait dengan struktur.

source: Assume affected in above 1 meter of water Source of the Hazard and Population Datasets
id: Asumsikan terdampak di atas 1 meter dari sumber air pada dataset ancaman dan populasi

source: :guilabel:`Click` |project_name| Print, save accordingly
id: :guilabel:`Klik` |project_name| Cetak, kemudian simpan

source: Optional - Change the threshold to 0.8
id: Opsional - Menngubah ambang batas ke 0.8

source: Check that |project_name| has the following in the drop-down boxes
id: Cek bilamana |project_name| memiliki apa yang ada pada kotak dropp-down berikut

source: :guilabel:`Click` on the impact function tool (pencil) and change 1.0 to 0.8)
id: :guilabel:`Klik` pada tool (pensil) fungsi dampak dan ubah dari 1.0 ke 0.8)

source: Run |project_name|
id: Jalankan |project_name|

source: Print and save accordingly
id: Cetak dan simpan

source: Basic Aggregation - Optional
id: Agregasi Dasar - Pilihan

source: :guilabel:`Click` Add vector button .. image:: /static/socialisation/
id: :guilabel:`Klik` tombol Add vector .. image:: /static/socialisation/

source: Navigate to the data folder and :guilabel:`Select` |project_name| projects/data/district_osm_jakarta.shp
id: Arahkan ke folder data dan :guilabel:`Pilih` |project_name| projects/data/district_osm_jakarta.shp

source: :guilabel:`Click` Open
id: :guilabel:`Klik` Open

source: :guilabel:`Click` once on the district of Jakarta Layer
id: :guilabel:`Klik` sekali pada Layer Kota Jakarta

source: :guilabel:`Click` on the drop down menu for ٥Aggregation results by٥ and :guilabel:`Select` Subdistrict of Jakarta
id: :guilabel:`Klik` pada menu drop-down untuk ٥Hasil agregasi dengan٥ dan :guilabel:`Pilih` Kecamatan Jakarta

source: Change the threshold back to 1.0 (refer point 7)
id: Ubah ambang batas kembali ke 1.0 (lihat poin 7)

source: Run |project_name| again
id: Jalankan |project_name| lagi

source: Keywords Editor
id: Editor Kata kunci (keyword editor)

source: In the next chapter we will explore the keyword editor for the hazard and exposure layers.
id: Di bab selanjutnya kita akan mengeksplor editor kata kunci untuk layer ancaman dan paparan.

source: However the Keyword editor for postprocessing is slightly different. You are able to :guilabel:`Select` an attribute to provide the percentage of females per aggregation area. If there is no such layer |project_name| defaults at 50% or 0.5.
id: Namun editor Kata kunci untuk postprocessing sedikit berbeda. Anda dapat :guilabel:`Pilih` atribut untuk memberikan persentase wanita per area agregai. Jika tidak ada seperti layer |project_name| standar pada 50% or 0.5.

source: If you would like more detail please ask at the end of the session
id: Jika Anda ingin penjelasan yang lebih rinci, silakan ajukan pertanyaan pada sesi akhir dari pelatihan ini

source: Keywords Editor window will pop up, press OK
id: Jendela Editor Kata kunci akan pop up, takan OK

source: 32. Scroll down the bottom of the results, you will see disaggregation of the population data and demographics by district.
id: 32. Gulir ke bawah bagian bawah hasil, Anda akan melihat disagregasi data populasi dan demografi pada kabupaten
