Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/beginner/osm/102-working-with-osm.po
Languages: id

source: Module 2: Working with OSM
id: Modul 2: Pengoperasian OSM

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Visit OpenStreetMap website
id: Mengunjungi situs OpenStreetMap

source: Navigate map on OSM website
id: Menavigasi peta di situs OSM

source: Save an image from OSM
id: Menyimpan gambar dari OSM

source: Register an OSM account
id: Mendaftarkan akun OSM

source: Edit the OSM map
id: Mengedit peta OSM

source: Save edits
id: Menyimpan hasil editing

source: In this module we will learn step-by-step how to navigate the OpenStreetMap website, view and print maps, and sign up for a user account. After you have your own username and password, you will be able to add your first points to the map.
id: Pada modul ini kita akan mempelajari langkah demi langkah bagaimana mengoperasikan situs *OpenStreetMap*, melihat dan mencetak peta, dan mendaftar untuk sebuah akun pengguna. Setelah Anda memiliki nama pengguna dan kata kunci Anda sendiri, Anda dapat menambahkan titik pertama Anda pada peta.

source: 1. The OpenStreetMap website
id: 1. Situs *OpenStreetMap*

source: Be sure that your computer is on and you are connected to the internet.
id: Pastikan komputer anda telah terhubung dengan koneksi internet

source: Open your web browser - Firefox, Chrome, Opera, or Internet Explorer.
id: Buka browser internet Anda - misalnya Firefox, Chrome, Opera, atau Internet Explorer.

source: In the address bar at the top of the window, enter the following text: `www.openstreetmap.org <http://www.openstreetmap.org>`_
id: Pada kolom alamat di atas jendela halaman browser anda, masukan teks berikut ini: `www.openstreetmap.org <http://www.openstreetmap.org>`_

source: When the page has finished loading, it should look something like this:
id: Ketika halaman selesai dimuat, Anda seharusnya melihat halaman seperti berikut:

source: 2. Navigating the map
id: 2. Menavigasikan Peta

source: The main thing we see is the map. Move the map by clicking on it with your left mouse button, holding the button down, and dragging your mouse around.
id: Hal utama yang seharusnya Anda lihat adalah peta. Geser peta tersebut dengan mengklik di atasnya dengan tombol kiri mouse, tahan tombol tersebut, dan geser mouse Anda.

source: If you have a mouse with a scroll-wheel, zoom in and out on the map by turning the wheel. If you don’t have a scroll-wheel, click the :guilabel:`+` and :guilabel:`-` buttons in the upper right corner of the map.
id: Jika Anda memiliki sebuah mouse dengan roda-gulir, perbesar dan perkecil peta itu dengan menggeser roda tersebut. Jika Anda tidak memiliki roda-gulir, gunakan tombol :guilabel:`+` dan :guilabel:`-` yang ada di pojok kanan atas peta.

source: To search for a place, left-click in the box labeled :guilabel:`Search` on the left side of the page. Type in the name of your town or village and press Enter. A window should appear to the left of the map with the results of your search. Click on the location that looks closest to the one you want. The map will automatically move to the location you choose.
id: Untuk melakukan pencarian tempat, klik kiri pada sebuah kotak yang bertuliskan :guilabel:`Search` pada sisi kiri halaman. Ketik nama kota atau desa Anda dan tekan :guilabel:`Enter`. Sebuah jendela akan muncul di sebelah kiri peta dengan hasil pencarian Anda. Klik pada lokasi yang seperti kriteria lokasi yang Anda cari. Peta secara otomatis akan bergeser ke lokasi yang Anda pilih.

source: 3. Saving an image of the map
id: 3. Menyimpan gambar dari peta

source: To save an image from OSM that you can easily print, follow these instructions:
id: Jika Anda ingin menyimpan sebuah gambar dari OSM yang dapat Anda cetak dengan mudah, ikuti instruksi ini:

source: Click the :guilabel:`Share` button on the right side of the map.
id: Klik pada tombol :guilabel:`Share` di sisi kanan peta.

source: Options appear which look like this:
id: akan muncul pilihan seperti ini:

source: In the :guilabel:`Image` section, check the box next to :guilabel:`Set custom dimensions` to manually specify the extent of the area for download. Drag the box which appears to the area you would like to get as an image file.
id: Pada bagian :guilabel:`Image`, centang :guilabel:`Set custom dimensions` jika Anda ingin menentukan secara manual daerah yang akan Anda download. Geser kotak yang muncul ke wilayah yang ingin Anda dapatkan file gambarnya.

source: Set the format to PNG, JPEG, SVG or PDF format according to your preference.
id: Atur format ke PNG, JPEG, SVG, atau PDF sesuai dengan preferensi Anda.

source: You may enter a scale in the next box. The larger the scale (meaning a smaller number), the larger the image size will be. Scale is a ratio. For example, entering 5000 here means that objects on the map will be 1/5000th the size that they are in real life.
id: Anda dapat memasukkan skala pada kotak selanjutnya. Semakin besar skala (berarti angka yang lebih kecil), maka ukuran gambar semakin besar . Skala adalah rasio. Sebagai contoh, memasukkan angka 5000 berarti bahwa ukuran objek pada peta 1/5000 ukurannya dalam kehidupan nyata.

source: Click the :guilabel:`Download` button. The image will be created, downloaded and saved to your computer.
id: Klik tombol :guilabel:`Download`. Gambar akan dibuat, proses download akan dimulai dan tersimpan dalam komputer Anda.

source: Open the downloaded file. It can be printed by going to :menuselection:`File ‣ Print`, after you connect your computer to a printer.
id: Buka file yang telah Anda download tadi. File tersebut dapat dicetak dengan memilih :menuselection:`File ‣ Print`, setelah Anda menghubungkan komputer Anda dengan sebuah printer.

source: 4. Creating an OpenStreetMap account
id: 4. Membuat sebuah akun OpenStreetMap

source: Now that we have seen the website, we must create an OSM account so we can start mapping.
id: Sekarang setelah melihat situs OSM, kita harus membuat akun OSM agar kita dapat memulai memetakan.

source: Return to the OSM website. Click :guilabel:`Sign Up` in the top right corner of the page.
id: Kembali ke situs OSM. Klik :guilabel:`Sign Up` pada pojok kanan atas halaman.

source: You should see a new page that looks like this:
id: Anda akan melihat sebuah halaman baru seperti berikut:

source: There are five boxes on this page that you need to fill in to register an account with OSM.
id: Akan ada lima kolom di halaman tersebut yang wajib anda isi untuk dapat membuat akun di OSM.

source: Enter your email address in the first two boxes. You should enter the same email address in both boxes. Later, you will need to open your email to confirm your account with OSM.
id: Ketik alamat email Anda pada dua kotak pertama. Anda harus memasukkan alamat email yang sama di kedua kotak. Kemudian Anda perlu membuka email Anda untuk mengkonfirmasi akun Anda dengan OSM.

source: In the third box, enter the username that you would like to have. You will not be able to choose a username that someone else has chosen before, so it should be creative. If you try to enter something simple, like your first name, it is likely that someone has already claimed that name.
id: Pada kotak ketiga, ketikan nama pengguna yang Anda inginkan. Anda tidak dapat memilih sebuah nama pengguna yang orang lain sudah pilih sebelumnya, jadi nama pengguna ini haruslah unik. Jika Anda mencoba mengetikkan sesuatu yang sederhana, misalnya hanya nama pertama Anda, kemungkinan seseorang sudah menggunakan nama tersebut.

source: Enter a new password in the fourth and fifth boxes. Enter the same password in both boxes. It does not need to be the same as the password for your email.
id: Masukan sebuah kata sandi baru pada kotak keempat dan kelima. Anda harus mengisi kata sandi yang sama pada kedua kotak. Kata sandi tidak harus sama dengan kata sandi email Anda.

source: You will need to remember your user name and your password so that you can login later.
id: Anda harus mengingat nama pengguna dan kata sandi Anda sehingga Anda dapat masuk nantinya.

source: After completing all the boxes, click :guilabel:`Continue` at the bottom of the page.
id: Setelah Anda menyelesaikan semua kotak, klik :guilabel:`Continue` pada bagian bawah halaman.

source: If there are any problems, an error message may pop up. Check to make sure that your email is the same in the first to boxes, and your password is the same in the bottom two boxes. If the third box is highlighted red, it means that someone else has already chosen your username, and you should try a different name.
id: Jika terdapat masalah, sebuah pesan kesalahan akan muncul. Pastikan alamat email Anda sama dengan kotak pertama, dan kata sandi Anda sama pada dua kotak dibawah. Jika kotak ketiga ditandai berwarna merah, itu berarti seseorang telah menggunakan nama pengguna Anda, dan Anda harus mencoba nama yang berbeda.

source: Open a separate window or tab in your internet browser, and navigate to your email. Common email sites are `mail.yahoo.com <http://mail.yahoo.com>`_ and `gmail.com <http://gmail.com>`_.
id: Bukalah sebuah jendela baru atau tab baru pada browser, dan arahkan ke email Anda. Situs email yang umum adalah `mail.yahoo.com <http://mail.yahoo.com>`_ dan `gmail.com <http://gmail.com>`_.

source: Enter your email address and your email password to open your email. Note that this is not the same as your OSM username and password.
id: Ketikkan alamat email Anda dan kata sandi email Anda untuk membuka email Anda. Perhatikan bahwa ini tidak sama dengan nama pengguna dan kata sandi OSM.

source: If everything was successful with your registration, you should see an email from OSM in your inbox. Open the email. It should look like the image below. Click on the link that is identified below:
id: Jika semuanya telah sukses dengan registrasi, Anda seharusnya melihat sebuah email dari OSM pada kotak masuk Anda. Buka email. Itu seharusnya terlihat seperti gambar dibawah ini. Klik pada tautan seperti yang ditunjukkan di bawah ini:

source: A new tab or window will open. If everything went well, you should have an OSM account!
id: Sebuah tab baru atau jendela akan terbuka. Jika semuanya berjalan lancar, seharusnya Anda telah memiliki akun OSM!

source: On the OSM page, click :guilabel:`Log In` in the top right corner. Enter your OSM username and password and press Enter. You should now be logged in. You will see your username in the upper right corner of the page.
id: Pada halaman OSM, klik :guilabel:`Log In` pada sudut kanan atas. Masukkan nama pengguna OSM dan kata sandi dan tekan Enter. Anda seharusnya bisa masuk sekarang. Anda akan melihat nama pengguna di sudut kanan atas halaman.

source: 5. Adding your first points
id: 5. Menambahkan titik pertama Anda

source: Now that you are logged in with your username on the OSM website, you can add your first point to the map.
id: Sekarang Anda telah masuk dengan nama pengguna Anda pada situs OSM, Anda dapat menambahkan titik pertama pada peta.

source: Move the map to a place that you know very well, such as your town or village.
id: Geser peta ke tempat yang Anda ketahui, misalnya kota atau desa tempat Anda tinggal.

source: Zoom in to a place where you would like to add a point to the map.
id: Perbesar ke area yang Anda ingin tambahkan sebuah titik di peta tersebut.

source: Just above the map on the left, there is a button marked :guilabel:`Edit`. Click on the arrow next to it to open a drop-down menu.
id: Di atas peta di sebelah kiri, terdapat sebuah tab yang tertulis :guilabel:`Edit`. Klik pada tanda panah untuk membuka menu tambahan.

source: Click :guilabel:`Edit with iD (in-browser editor)`
id: Klik :guilabel:`Edit with iD (pada browser editor)`

source: The online editor for OSM should open. For a tour of the editor, click :guilabel:`Start the Walkthrough`. To begin editing, click :guilabel:`Edit Now`.
id: Editor online untuk OSM seharusnya terbuka. Untuk petunjuk menggunakan editor, klik :guilabel:`Start the Walkthrough`. Untuk memulai mengedit, klik :guilabel:`Edit Now`.

source: Add a point to the map by clicking :guilabel:`Point` at the top, and then clicking a location on the map. Select the type of location from the menu on the left and add any other information that you know. If you are satisfied that the information is correct, click :guilabel:`Save` at the top.
id: Tambahkan titik ke peta dengan klik :guilabel:`Point` di atas, dan kemudian klik sebuah lokasi pada peta. Pilih tipe dari lokasi dari menu di sebelah kiri dan tambahkan beberapa informasi lain yang Anda tahu. Jika Anda merasa yakin infromasi sudah benar, klik guilabel:`Save` di atas.

source: If you are not sure about the accuracy of the point(s) you add, don’t click :guilabel:`Save`! Play around with the iD editor, but don’t save your changes.
id: Jika Anda tidak yakin terhadap keakuratan dari titik (point) yang Anda tambahkan, jangan klik :guilabel:`Save`! Berlatihlah dengan iD editor, tetapi jangan simpan perubahan Anda.

source: :ref:`Go to next module --> <working-with-josm>`
id: :ref:`modul selanjutnya --> <working-with-josm>`
