Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/beginner/osm/103-working-with-josm.po
Languages: id

source: Now let’s draw a map in order to practise the techniques we've learned. You may wish to redraw the map that you drew on paper in Module 1.
id: Sekarang Anda akan membuat peta Anda sendiri untuk meningkatkan teknik-teknik yang telah kita pelajari. Anda bisa saja menggambar peta yang telah Anda buat di kertas ketika mempelajari Modul 1.

source: Drag the window away from the sample map by holding the right mouse button and dragging your mouse, until you have a nice empty area to draw on.
id: Tahan dan geser jendela dari peta contoh dengan tahan tombol kanan dan geser mouse Anda, hingga Anda mendapatkan area kosong untuk Anda menggambar.

source: Use the Draw tool to create points, lines and shapes. Describe what your objects are by selecting from the Presets menu.
id: Gunakan tool menggambar untuk membuat titik, garis dan poligon. Jelaskan objek apa yang Anda buat dengan memilih dari menu preset.

source: When you are finished, you should have your own map, similar to the sample map that we opened in :file:`sample.osm`.
id: Ketika Anda sudah selesai, Anda akan memiliki peta Anda sendiri, yang sama dengan contoh yang ada pada :file:`sample.osm`.

source: :ref:`Go to next module --> <using-gps>`
id: :ref:`Modul selanjutnya --> <using-gps>`
