Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/old-training/beginner/osm/103-working-with-josm.po
Languages: id

source: Module 3: Working with JOSM
id: Modul 3: Pengoperasian JOSM

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Download JOSM
id: Melakukan download JOSM

source: Install JOSM
id: Instal JOSM

source: Set JOSM preferences
id: Mengubah pengaturan JOSM

source: Use basic tools
id: Menggunakan tools dasar

source: Draw nodes and ways in JOSM
id: Menggambar nodes dan garis di JOSM

source: Change objects
id: Mengubah Objek

source: Add tags to objects using presets menu
id: Memberikan informasi terhadap objek dengan menggunakan menu presets

source: In this module we will learn step-by-step how to download and install JOSM, the Java OpenStreetMap editor. We will change some of the settings in JOSM to make it easier to use. Then we will open a sample map and learn some of the basic operations of the software. Remember in :ref:`Module 1 <basic-concept-of-osm-website>` when we asked you to draw a map of your town or village? We will conclude this module by drawing your map again, this time digitally. After this you should have a good understanding of how to draw maps in JOSM.
id: Pada modul ini kita akan mempelajari langkah demi langkah bagaimana untuk mendownload dan menginstall JOSM, Java OpenStreetMap editor. Kita akan merubah beberapa pengaturan pada JOSM agar lebih mudak digunakan. Kemudian kita akan membuka sebuah peta contoh dan mempelajari operasi dasar dari perangkat lunak tersebut. Ingat pada :ref:`Modul 1 <basic-concept-of-osm-website>` ketika kami meminta anda untuk menggambarkan sebuah peta desa atau kota anda? Kita akan menyimpulkan modul ini dengan menggambarkan peta anda kembali, kali ini dalam bentuk digital. Setelah itu anda akan memiliki pemahaman yang baik bagaimana menggambar peta pada JOSM.

source: 1. Downloading JOSM
id: 1. Download JOSM

source: There is a copy of JOSM in the :file:`software/` folder of the package that accompanies this course. If you don’t have this or would like the most up-to-date version, follow the instructions here. Otherwise skip ahead to :ref:`install-josm`.
id: Tersedia software JOSM di :file:`software/` folder yang terdapat dalam paket panduan ini. Jika Anda belum memilikinya atau ingin memperbaharui versi, ikuti perintahnya di sini. Jika tidak Anda dapat melewati bagian ini dan langsung menuju ke :ref:`install-josm`.

source: Open your web browser - this may be Firefox, Chrome, Opera, or Internet Explorer.
id: Buka browser internet Anda - misalnya Firefox, Chrome, Opera, atau Internet Explorer.

source: In the address bar at the top of the window, enter `josm.openstreetmap.de <http://josm.openstreetmap.de>`_ and press :kbd:`Enter`:
id: Dalam kotak alamat yang berada di atas jendela, masukkan `josm.openstreetmap.de <http://josm.openstreetmap.de>`_ and tekan :kbd:`Enter`:

source: The website should look something like this:
id: Situs tersebut seharusnya nampak seperti ini :

source: If you are running Windows, click :guilabel:`Windows Installer` to download JOSM. If you have a different operating system, click on the link for your system. Your download should begin. In this module we assume that you are using Windows, but the instructions are similar for other operating systems.
id: Jika Anda menjalankan Windows, klik :guilabel:`Windows Installer` untuk mendownload JOSM. Jika Anda menggunakan sistem operasi yang berbeda, klik tautan pada sistem, Anda akan segera men-download JOSM. Dalam modul ini kita mengasumsikan Anda semua menggunakan Windows, akan tetapi untuk Sistem Operasi yang lain langkah-langkahnya tidak akan jauh berbeda.

source: 2. Installing JOSM
id: 2. Cara Menginstal JOSM

source: You may have problems installing JOSM if Java is not already installed on your computer. Install Java by running :file:`jre-8u25-windows-i586` in the :file:`software/` folder. The exact version may be different. The most up-to-date version can also be downloaded here: `http://www.java.com/en/download/ <http://www.java.com/en/download/>`_
id: Anda mungkin memiliki masalah dalam menginstal JOSM jika Java belum terinstal di komputer Anda. Anda dapat menginstal java terlebih dahulu dengan menjalankan :file:`jre-8u25-windows-i586` yang terdapat dalam :file:`software/` folder. Untuk versi paling terbaru Anda juga dapat mendonwloadnya disini: `http://www.java.com/en/download/ <http://www.java.com/en/download/>`_

source: Find the JOSM install file on your computer. It should be named :file:`josm-setup.exe`. Double-click it to begin setup.
id: Temukan file untuk menginstal JOSM di komputer Anda. File tersebut bernama :file:`josm-setup.exe`. Klik 2 kali untuk memulai pengaturan.

source: Click :guilabel:`OK`, :guilabel:`Next`, :guilabel:`I Agree` and :guilabel:`Install`. When the installation is complete, click :guilabel:`Finish` to launch JOSM for the first time. Later when you want to start JOSM, you can do so by clicking on the :guilabel:`Start Menu` in the lower-left corner of your computer, and clicking the program JOSM.
id: Klik :guilabel:`OK`, :guilabel:`Next`, :guilabel:`I Agree`, dan :guilabel:`Install`. Ketika instalasi telah selesai, klik :guilabel:`Finish`untuk membuka JOSM Anda pertama kali. Nantinya, ketika Anda ingin membuka JOSM, Anda dapat klik :guilabel:`Start Menu` di sudut kiri bawah komputer Anda, dan klik program JOSM.

source: A window may pop up that asks if you want to update the software. It is not necessary to update since it is new. Click the :guilabel:`Cancel` button. If you don’t ever want to see this message again, check the box at the bottom before pressing :guilabel:`Cancel`.
id: Anda akan melihat jendela pop up yang akan meminta Anda untuk memperbaharui software. Anda tidak harus melakukannya. Tekan tombol “Cancel.” Jika Anda tidak ingin melihat pesan ini lagi, beri tanda centang pada kotak yang berada di bawah sebelum memilih “Cancel.”

source: When JOSM starts, it will look something like this:
id: Ketika JOSM Anda dibuka, tampilannya akan seperti ini :

source: 3. Changing JOSM settings
id: 3. Cara Mengubah Pengaturan JOSM

source: Before we begin using JOSM, it’s a good idea to change some of the settings so that it will be easier to use. To change the settings, go to :menuselection:`Edit ‣ Preferences`.
id: Sebelum kita memulai menggunakan JOSM, kita sebaiknya melakukan perubahan terhadap beberapa pengaturan yang akan lebih memudahkan kita ketikan menggunakan JOSM. Untuk mengubah pengaturan, klik :menuselection:`Edit ‣ Preferensi`.

source: 3.1. Adding Bing imagery
id: 3.1. Cara Menambahkan Citra Satelit Bing

source: This may be unnecessary if Bing Imagery is already activated in your copy of JOSM.
id: Ini tidak dibutuhkan jika citra satelit Bing telah diaktifkan didalam *copy* JOSM Anda.

source: In order to use satellite imagery while making our maps, we must make sure that it is enabled in the JOSM settings.
id: Untuk menggunakan citra satelit ketika membuat peta, kita harus memastikan bahwa Bing telah diaktifkan didalam pengaturan JOSM.

source: On the left side of the Preferences window there are different icons for different settings. Click the icon that says :guilabel:`WMS TMS`. You may need to click on the down arrow to find it:
id: Pada sebelah kiri jendela preferensi terdapat beberapa ikon/simbol yang mewakili pengaturan tertentu. Klik ikon yang menyatakan “WMS TMS”. Anda mungkin perlu untuk klik dan arahkan ke bawah untuk menemukannya :

source: Click on :guilabel:`Bing Sat`. Then click :guilabel:`Activate`.
id: Klik :guilabel:`Bing Sat`. Lalu klik :guilabel:`Aktifkan`.

source: :guilabel:`Bing Sat` should now be in the list below the :guilabel:`Activate` button.
id: :guilabel:`Bing Sat` seharusnya saat ini terdapat didalam daftar yang berada di bawah tombol :guilabel:`Aktifkan`

source: 3.2. Adding presets
id: 3.2. Cara Menambahkan Presets

source: We will be using presets so that we can add special data to OSM. Don’t worry if this is unclear right now - we will learn more about presets as we go along.
id: Kita akan menggunakan presets sehingga kita dapat menambahkan data khusus yang kita inginkan ke dalam OSM. Jangan khawatir jika hal ini belum jelas, kita akan mempelajari mengenai preset dengan panduan ini.

source: You should still have the Preferences window open. If not, go to :menuselection:`Edit ‣ Preferences` to open the window.
id: Jendela Preferensi Anda seharusnya masih terbuka. Jika tidak klik :menuselection:`Edit ‣ Preferensi` untuk membukanya.

source: On the left side, click the icon that looks like a grid.
id: Pada sebelah kiri, klik ikon yang terlihat seperti grid di bawah ini.

source: Click the tab at the top that reads :guilabel:`Tagging Presets`.
id: Klik pada kotak di sebelah atas yang bernama :guilabel:`Tagging Presets`.

source: Under :guilabel:`Available Presets` find and select the entry labelled :kbd:`Buildings Indonesia`. Click the blue arrow to the right of this box.
id: Dibawah :guilabel:`Preset tersedia` cari dan pilih preset yang bernama :kbd:`Buildings Indonesia`. Lalu klik tanda panah biru yang berada di sebelah kanan kotak.

source: Click :guilabel:`OK`.
id: Klik :guilabel:`OK`.

source: 3.3. Adding plugins
id: 3.3. Penambahan berbagai Plugin

source: Plugins provide extra functionality for specific purposes. JOSM has many plugins that can be downloaded. To install a plugin follow these steps:
id: Plugin menyediakan fungsi ekstra untuk tujuan yang spesifik. JOSM memiliki banyak plugin yang dapat didownload. Untuk menginstall plugin ikuti langkah berikut:

source: Make sure the Preferences window is open.
id: Pastikan jendela Preferensi terbuka.

source: Click the :guilabel:`Plugin` icon on the left:
id: Klik ikon :guilabel:`Plugin` disebelah kiri:

source: On the plugin tab, first download the plugin list by clicking :guilabel:`Download list`. It may take a few minutes.
id: Pada tab plugin, pertama download daftar plugin terlebih dahulu dengan klik :guilabel:`Download daftar`. Ini membutuhkan waktu beberapa menit.

source: After the plugin list appears, type the name of the plugin you want to download in the :guilabel:`Search` box.
id: Setelah daftar plugin muncul, ketikkan nama plugin yang ingin Anda download pada kotak :guilabel:`Cari`

source: When the plugin is found, check the box to the left of the plugin name.
id: Setelah menemukan plugin, berikan tanda centang di sebelah kiri nama plugin.

source: Click :guilabel:`OK` to download and install the selected plugins.
id: Klik :guilabel:`OK` untuk download dan install plugin yang dipilih.

source: Skim through the list to see what sort of additional features are available through plugins.
id: lakukan penyaringan melalui daftar untuk melihat berbagai fitur tambahan yang tersedia pada plugin.

source: 3.4. Changing the language
id: 3.4. Cara Memilih Bahasa

source: JOSM has been translated into many languages. If it has been translated into your language, you can change it in the Preferences.
id: JOSM telah diterjemahkan ke dalam berbagai bahasa. Jika bahasa Anda sudah diterjemahkan maka Anda dapat menggunakannya, dengan menggantinya didalam Preferensi.

source: On the left side, click the icon that looks like a paint can and paintbrush.
id: Di sebelah kiri, klik ikon yang terlihat seperti kaleng cat dan kuas.

source: At the top of the window, click the tab that says :guilabel:`Look and Feel`.
id: Di atas jendela, klik kotak yang bernama :guilabel:`Look and Feel`.

source: Choose your language in the drop-down box next to the word :guilabel:`Language`.
id: Pilih bahasa Anda di kotak daftar pilihan disebelah kata :guilabel:`Bahasa`

source: JOSM must be restarted to save the language settings. Go to :menuselection:`File ‣ Exit`.
id: JOSM harus direstart untuk menyimpan pengaturan bahasa. Silahkan menuju :menuselection:`Berkas ‣ Keluar`.

source: Start JOSM again by going to the Windows :guilabel:`Start Menu`. Find JOSM and click on it to start.
id: Mulai dan buka JOSM kembali dengan menuju Windows :guilabel:`Start Menu`. Cari JOSM dan klik untuk memulai.

source: 4. Basic drawing with JOSM
id: 4. Latihan Dasar Menggambar dengan JOSM

source: Now let’s open up a sample OSM file which we will use to learn the basic ways to draw maps with JOSM. Note that this map is not real, in that it is not a real map of a real place, so we will not save it on OSM.
id: Sekarang silahkan buka contoh file OSM yang akan digunakan untuk mempelajari cara dasar dalam menggambar peta dengan JOSM. Perlu diingat bahwa peta ini hanya untuk latihan, jadi kita tidak akan menyimpan hasil peta ini dalam OSM.

source: The file is located in :file:`osm/` and is named :file:`sample.osm`.
id: File ini berlokasi di :file:`osm/` dan namanya:file :`sample.osm`.

source: Open JOSM. Go to :menuselection:`Open`.
id: Buka JOSM. Silahkan menuju :menuselection:`Buka`.

source: Navigate to the file :file:`sample.osm`. Click on it, and then click :guilabel:`Open`.
id: Anda akan menemukan file :file:`sample.osm`. Klik :guilabel:`Buka`.

source: You should now see a sample map, similar to this:
id: Anda akan melihat contoh peta seperti ini :

source: 4.1. Basic operations
id: 4.1. Operasi Dasar

source: To move the map left or right, up or down, hold the right mouse button down, and move the mouse.
id: Untuk menggerakkan peta ke kanan atau ke kiri, naik atau turun, klik kanan lalu tahan Anda gerakkan mouse Anda.

source: There are several ways to zoom in and out of the map. With a mouse, the scroll wheel is used to zoom in and out. If you are using a laptop and don’t have a mouse, zoom in and out using the scale bar in the upper-left of the map window. Drag the bar left and right by holding your left mouse down and moving the bar left or right with your mouse.
id: Ada beberapa cara untuk memperbesar dan memperkecil peta Anda. Jika Anda memiliki mouse, Anda dapat Anda dapat meng-scroll roda yang ada pada mouse Anda untuk memperbesar atau memperkecil peta. Jika Anda menggunakan laptop dan tidak memiliki mouse Anda dapat memperbesar dan memperkecilnya menggunakan skala baris di sebelah kiri di jendela peta Anda. Tahan dan geser ke kiri dan ke kanan dengan mouse Anda.

source: Look at the sample map. There are a few different types of objects here. There is a river, a forest, some buildings, several roads, and a couple of shops. To select an object, click on it with your left mouse button.
id: Lihat peta contoh. Terdapat beberapa perbedaan jenis objek di sana. Ada sungai, hutan, beberapa bangunan, jalan dan sepasang tempat berbelanja. Untuk memilih objek, klik kiri pada objek tersebut.

source: 4.2. Points, lines, and shapes (polygons)
id: 4.2. Titik, Garis dan Bentuk (poligon)

source: As you click different objects on the sample map, notice that there are three different types of objects on the map. There are points, lines, and shapes. In mapping, shapes are usually called *polygons*.
id: Ketika Anda mengklik objek yang berbeda pada peta contoh, perhatikan bahwa terdapat 3 jenis objek pada peta tersebut. Ketiga jenis objek tersebut adalah titik, garis dan poligon. Dalam pemetaan, bentuk biasanya disebut sebagai *poligon*.

source: Points are a single location, represented by symbols. On this sample map, there are two points, a clothing shop and a market. The clothing shop is represented by a shirt symbol, and the market is represented by a shopping cart.
id: Titik adalah suatu lokasi yang digambarkan dengan simbol. Dalam peta ini terdapat 2 titik, yaitu toko baju dan pasar. Toko baju digambarkan dengan simbol kaos dan pasar digambarkan dengan simbol keranjang belanja.

source: There are several lines on the map as well, which represent roads. If you look closely you will see that within the lines, there are points as well. These points don’t have any symbols or other information associated with them, but they help to define where the line is located.
id: Ada beberapa garis yang terdapat didalam peta, yang menggambarkan jalan. Jika Anda melihat dengan lebih teliti akan melihat dalam garis terdapat titik-titik. Titik-titik tersebut tidak memiliki simbol atau informasi apapun tetapi akan membentuk garis tersebut.

source: Lastly, there are numerous shapes on the sample map, representing different places - a forest, a river, and buildings. A shape generally represents an area, like a field or a building. A shape is exactly like a line - the only difference is that the line begins at the same point where it ends.
id: Terakhir, ada beberapa poligon dalam peta contoh ini yang menunjukkan tempat-tempat yang berbeda seperti hutan, sungai dan bangunan. Suatu poligon secara umum mewakili suatu area seperti lapangan ataupun bangunan. Poligon sama seperti garis akan tetapi perbedaannya poligon terdiri dari beberapa garis yang membentuk dimana titik akhir berada sama dengan titik awal garis tersebut.

source: Notice that when you select an object, a list appears to the right of the map in a window called :guilabel:`Properties`. These are known as tags. **Tags** are information that is tied to a point, line or shape that describes what it is. For now all you need to know is that this information helps describe whether our object is a forest, a river, a building or something else.
id: Anda akan menyadari ketika objek yang Anda pilih, akan muncul beberapa daftar di sebelah kanan jendela yang disebut :guilabel:`Properti`. Hal ini disebut sebagai tags. Tags adalah informasi yang dimana merupakan bagian dari suatu titik, garis ataupun poligon yang memberitahukan informasi objek tersebut. Untuk sekarang yang Anda butuhkan adalah mengetahui informasi ini untuk menjelaskan apakah objek Anda itu hutan, sungai atau bangunan atau bentuk lain.

source: Think about drawing a map by hand, and how you are also drawing points, lines and shapes. What other places are best represented by points? Lines? Shapes?
id: Pikirkan tentang menggambarkan peta dengan tangan, dan bagaimana cara menggambar titik, garis, dan bentuk/poligon. Objek apa yang paling tepat untuk mewakilkan titik? Garis? Bentuk/poligon?

source: Now, let’s practise drawing an object (point, line and shape).
id: Sekarang, mari kita coba praktek menggambar suatu objek (titik, garis dan bentuk).

source: On the left side of JOSM is a column of buttons. Many of these buttons open new panels on the right side that provide more information about the map. The most important buttons are at the top of the column. These buttons change what you can do with your mouse. The top four buttons in this column are the most important. They allow you to: :guilabel:`Select`, :guilabel:`Draw`, :guilabel:`Zoom in` and :guilabel:`Delete`
id: Di sebelah kiri dari JOSM terdapat kolom yang terdapat berbagai macam tombol. Banyak dari tombol-tombol ini akan membuka jendela baru di sebelah kanan yang akan menampilkan informasi pada peta Anda. Tombol yang paling penting terdapat di sebelah atas kolom. Tombol-tombol tersebut dapat merubah apa yang Anda lakukan dengan mouse Anda. Empat tombol yang utama pada kolom ini merupakan yang paling penting. Ini memungkinkan Anda untuk :guilabel:`Memilih`, :guilabel:`Menggambar`, :guilabel:`Memperbesar` and :guilabel:`Menghapus`

source: Until now, you have been using the :guilabel:`Select` tool, which looks like this:
id: Hingga sekarang, Anda telah menggunakan alat bantu :guilabel:`Select`, yang fungsinya untuk memilih objek. Terlihat seperti ini :

source: Before drawing, we need to make sure that nothing is selected. Click in the black space on the map, where it is empty, to make sure nothing is selected.
id: Sebelum menggambar, kita harus memastikan tidak ada objek lain yang dipilih. Klik pada ruang yang kosong di peta.

source: Click the second button, the :guilabel:`Draw` tool.
id: Klik tombol kedua, tool :guilabel:`Menggambar`.

source: Find an empty area on the map, and double-click with your mouse. This will create a single point.
id: Temukan area kosong pada peta dan klik dua kali dengan mouse Anda. Ini akan membantu Anda membuat titik.

source: To draw a line, single-click with the mouse. Move the mouse and click again. Continue until you are happy with the line. To end the line, double-click.
id: Untuk menggambar garis, klik dengan mouse. Lalu gerakkan mouse Anda dan klik lagi. Lanjutkan hingga Anda sudah merasa garis yang dibuat sesuai. Untuk mengakhiri, klik dua kali.

source: Draw a shape the same way that you draw a line, but finish the shape by double-clicking on the point where you started the line.
id: Menggambar poligon caranya hampir sama dengan menggambar garis, akan tetapi menyelesaikan poligon dengan klik dua kali di titik tempat Anda memulai tadi.

source: 4.3. Changing objects
id: 4.3. Cara Mengganti Objek

source: Select the forest on the left side of the map. Be sure to click on the line around the forest, not one of the points on the line. Now hold your left mouse button down and drag your mouse. You should be able to move the forest to a new location on the map.
id: Pilih hutan yang berada di sebelah kiri peta. Pastikan Anda mengklik garis pada hutan tersebut bukan pada titiknya. Sekarang tahan tombol kiri mouse Anda dan geser. Anda dapat menggerakkan hutan ke lokasi yang baru pada peta.

source: Click on one of the points on the line around the forest. Hold your left mouse button down and drag your mouse. You should be able to move the point. This is how you can change the shape of an object, or move a point.
id: Klik salah satu pada titik di hutan. Tahan tombol kiri mouse Anda dan geser. Anda dapat menggerakan titik. Dengan menggerakkan titik ini Anda dapat merubah bentuk dari sebuah objek.

source: 4.4. Adding presets
id: 4.4. Cara Menambahkan Presets

source: Now we know how to draw points, lines and shapes, but we still haven’t defined what they represent. We want to be able to say that our points are shops, schools or something else, and whether our shapes are fields, buildings or something else.
id: Sekarang kita mengetahui bagaimana menggambar titik, garis dan poligon, akan tetapi kita masih belum menentukan objek tersebut adalah apa. Kita ingin supaya objek yang kita gambar seperti titik itu adalah toko, sekolah dll dan apakah bentuk yang kita buat itu bangunan atau sesuatu yang lain.

source: Click the :guilabel:`Select` tool, in the column of buttons on the left.
id: Klik pada tool :guilabel:`Pilih`, di kolom sebelah kiri.

source: Select one of the objects that you drew with the :guilabel:`Draw tool`. On the top menu, click :menuselection:`Presets`. Move your mouse through the sub-menu to the type of location you would like to define.
id: Pilih salah satu objek yang akan Anda gambar dengan :guilabel:`Alat Gambar`. Pada menu di atas klik :menuselection:`Presets`. Gerakkan mouse Anda ke sub-menu ke lokasi yang Anda ingin tentukan.

source: When you click on a preset, a form pops up asking you for more information. You do not have to fill in every field, but you may wish to add some important fields, such as the name of the object.
id: Ketika Anda klik pada preset, akan muncul kolom-kolom dan menanyakan anda tentang informasi lebih lanjut tentang objek tersebut. Anda tidak harus mengisi semua kolom tetapi Anda harus mengisi kolom penting seperti nama dari objek yang Anda buat.

source: When you are finished entering the information, click :guilabel:`Apply Preset`. If everything went well, your point, line or shape should change colours or show a symbol. This is because it has now been defined.
id: Ketika Anda sudah selesai memasukkan informasi, klik :guilabel:`Tambahkan Preset`. Jika semuanya berjalan dengan lancar, titik, garis, atau poligon yang Anda buat akan berubah warna atau memiliki suatu simbol. Ini tergantung dari informasi yang Anda masukkan ke dalam objek tersebut.

source: Exercise:
id: Latihan:
