Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-06-using-gps.po
Languages: id

source: Congratulations! Now you already learned about how to use GPS. If you still need practice, try to save points from several location that you think important.
id: Selamat! Anda sekarang telah mempelajari bagaimana menggunakan GPS. Jika anda masih membutuhkan praktik, cobalah untuk menyimpan beberapa titik dari lokasi yang berbeda yang anda rasa penting untuk dipetakan.

source: In this chapter we have learned how to collect waypoints and tracks, download them from the GPS, and display them in JOSM. Later we will use this information to add new objects in OpenStreetMap.
id: Dalam bab ini kita telah belajar bagaimana cara mengambil waypoint dan trek menggunakan GPS, menyimpannya dari GPS kemudian menampilkannya di JOSM. Selanjutnya kita akan menggunakan informasi survei ini untuk menambahkan objek-objek baru ke dalam OpenStreetMap.

source: In the next chapter, we will learn about another survey method called Field Papers. Field Papers allows you to create map without a GPS!
id: Di bab selanjutnya, kita akan mempelajarai tentang metode survei lapangan lain yang bernama Field papers. Field Papers memungkinkan anda untuk membuat peta dan melakukan survei tanpa menggunakan GPS!

source: :ref:`Go to next chapter --> <ch7-field-papers>`
id: :ref:`Pergi ke bab selanjutnya --> <ch7-field-papers>`
