Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-06-using-gps.po
Languages: id

source: Chapter 6: Using GPS
id: Bab 6: Penggunaan GPS

source: **Learning objectives:**
id: **Tujuan Pembelajaran:**

source: Understand GPS and the types of GPS
id: Memahami GPS dan tipe-tipe GPS

source: Turn on a GPS unit
id: Menyalakan perangkat GPS

source: Adjust GPS settings
id: Mengatur pengaturan GPS

source: Understand factors that affect GPS accuracy
id: Memahami faktor-faktor yang mempengaruhi akurasi GPS

source: Understand tracks and waypoints
id: Memahami *track* dan *waypoint*

source: Collect data using GPS
id: Mengumpulkan data menggunakan GPS

source: Copy GPS data (tracks and waypoints) to computer
id: *Copy* data GPS (*tracks* dan *waypoints*) ke dalam komputer

source: Open waypoints and tracks in JOSM
id: Buka *waypoints* dan *tracks* pada JOSM

source: In this chapter we discuss one of the most important parts of mapping: how to add actual information from field to map. We will learn several methods to do field survey in this module. We will see what GPS is and how GPS work. You will learn how to operate GPS and how to use the results for making a map.
id: Pada Bab ini kita mendiskusikan salah satu dari bagian terpenting dalam pemetaan: bagaimana menambahkan informasi aktual dari lapangan ke peta. Kita akan mempelajari beberapa metode untuk melakukan survei lapangan pada modul ini. Kita akan mengetahui apa itu GPS dan bagaimana GPS bekerja. Anda akan belajar bagaimana mengoperasikan GPS dan menggunakan hasilnya untuk membuat sebuah peta.

source: Here we will explain how to operate Garmin eTrex Vista HCx, a GPS that is commonly use for mapping activities. There are so many other GPS model that can use the same operation so if you use different model, don’t worry – in principle it is still the same.
id: Di sini kami akan menjelaskan bagaimana mengoperasikan Garmin eTrex Vista HCx, sebuah perangkat GPS yang umum digunakan untuk kegiatan pemetaan. Terdapat banyak model GPS lain yang dapat melakukan hal yang sama, jadi jika Anda mengerjakannya dengan perangkat GPS yang berbeda, jangan khawatir – pada prinsipnya tetap sama.

source: 6.1 What is GPS?
id: 6.1 Apa itu GPS?

source: A GPS is like a mobile phone, except that instead of receiving radio signals from telephone companies, it receives signals from satellites that are going around the Earth. By receiving these signals from the satellites, a GPS is able to calculate its exact location on the planet. It records this location in coordinates, which are two long numbers. One number tells you how far east or west you are - this is called **longitude**. The second number tells you how far north or south you are - this is called **latitude**. Every place on Earth has unique geographic coordinates.
id: Sebuah GPS bekerja seperti ponsel, namun jika ponsel menerima sinyal radio dari perusahaan telepon, GPS menerima sinyal dari satelit yang mengelilingi bumi. Dengan menerima sinyal tersebut dari satelit, sebuah GPS dapat memperhitungkan dengan tepat posisi Anda di permukaan bumi. GPS merekam lokasi ini dalam bentuk koordinat, dimana terdapat dua buah nomor yang panjang. Satu nomor menunjukan sejauh mana posisi Anda dari Timur atau Barat - biasa disebut **garis bujur**. Nomor yang kedua menunjukan sejauh mana posisi Anda dari Utara atau Selatan - biasa disebut **garis lintang**. Setiap tempat di bumi memliki koordinat geografis yang unik.

source: 6.2 Turning on the GPS
id: 6.2 Menyalakan perangkat GPS

source: Before turning on your GPS, go outside where you have a clear view of the sky.
id: Sebelum menyalakan GPS Anda, pergilah keluar ruangan dimana kondisinya terbuka dan tidak banyak tutupan lahan seperti pohon besar, gedung atau bangunan lainnya.

source: Because the GPS determines your location by receiving signals from satellites, **it will not work indoors**.
id: Karena GPS menentukan lokasi Anda dengan menerima sinyal dari satelit, **GPS tidak akan bekerja di dalam ruangan**.

source: On the right side of the GPS, press and hold the :guilabel:`Power` button.
id: Pada sisi kanan dari GPS, tekan dan tahan tombol :guilabel:`Power`.

source: The GPS will start, and it will show you the Satellites page. You should see something like the image below, where the GPS is seeking satellite signals. When it has connected to three or more satellites, it can determine your location.
id: Perangkat GPS akan menyala, dan akan menunjukkan halaman Satelit. Anda seharusnya dapat melihat tampilan seperti pada gambar di bawah ini, dimana GPS sedang mencari sinyal satelit. Ketika sudah terhubung dengan tiga satelit atau lebih, GPS akan menentukan lokasi Anda.

source: Once your location is determined, the Satellites page will disappear and
id: Setelah lokasi Anda telah ditentukan, halaman Satelit akan menghilang dan

source: you will see the Main Menu.
id: Anda akan melihat Menu Utama.

source: 6.3 Navigating the GPS
id: 6.3 Menavigasikan GPS

source: The GPS has different pages and menus that allow you to do different things.
id: Perangkat GPS memiliki halaman dan menu-menu yang berbeda yang memungkinkan Anda untuk melakukan hal-hal yang berbeda.

source: To switch between pages, press the button marked :kbd:`X`, just above
id: Untuk beralih antar halaman, tekan tombol yang ditandai :kbd:`X`, tepat di atas.

source: the power button on the right side of the device. This button also serves to go back. If you press something by mistake and would like to cancel or go back, press the :kbd:`X` button.
id: tombol Power pada sisi kanan perangkat. Tombol ini juga berfungsi untuk kembali. Jika Anda menekan sesuatu karena kesalahan dan Anda ingin membatalkan atau kembali ke menu sebelumnya, tekan tombol :kbd:`X`.

source: By pressing the :kbd:`X` button, you should be able to flip through different
id: Dengan menekan tombol :kbd:`X`, Anda seharusnya dapat membolak-balik tampilan

source: screens that will look something like this:
id: layar yang berbeda seperti ini:

source: If you return to Satellites page, you will see that you are connected to
id: Jika Anda kembali ke halaman Satelit, Anda akan melihat bahwa Anda terhubung ke

source: three or more satellites. In the upper left corner are your coordinates, your latitude and longitude.
id: tiga satelit atau lebih. Pada pojok kiri atas merupakan koordinat Anda, lintang dan bujur.

source: Go to the Map page, and you can see a map of your current location. If
id: Pergi ke halaman peta, dan Anda dapat melihat peta dari lokasi Anda saat ini.

source: you have added OpenStreetMap maps to your GPS, you may see roads and points-of-interest. Otherwise, the map may look quite blank. Zoom in and out by pressing the up and down arrow buttons on the left side of the GPS.
id: Jika Anda telah menambahkan peta OSM pada GPS Anda, Anda mungkin melihat jaringan jalan dan beberapa titik tempat. Selain itu, peta mungkin akan terlihat kosong. Perbesar dan perkecil dengan menekan tombol atas dan bawah pada sisi kiri GPS.

source: 6.4 Tracks and waypoints
id: 6.4 *Track* dan *waypoints*

source: A GPS records two kinds of information that are useful for creating maps or saving the coordinates of a place. First, it allows you to save your location in the memory of the GPS. When you save a location, the coordinates will be saved with a name. For example, by default your first saved point will be named 001, the second 002, and so on.
id: Sebuah GPS merekam dua jenis informasi yang berguna untuk membuat peta atau menyimpan koordinat dari sebuah tempat. Pertama, GPS dapat menyimpan lokasi Anda pada memori GPS. Ketika Anda menyimpan satu lokasi, koordinat akan disimpan dengan sebuah nama. Sebagai contoh, secara standar titik pertama yang tersimpan oleh Anda akan diberi nama 001, kedua 002, dan seterusnya.

source: When you save a point, you can write down the number on a piece of paper, along with a note about what it is, and any attributes or indicators you would like to collect. Saved locations on your GPS are called waypoints.
id: Ketika Anda menyimpan sebuah titik, Anda dapat menulis nomor tersebut pada selembar kertas, dengan sebuah catatan tentang titik apakah itu, atribut atau indikator apapun yang Anda ingin ketahui. Titik lokasi yang tersimpan ke dalam GPS Anda disebut **waypoint**.

source: Second, a GPS can save what are called tracks. While a waypoint only saves a single location, a track will save a series of locations wherever you move. For example, a track will record your location every one second, or every one metre, and the result will be a series of dots that show the path of where you have been. Tracks are useful for mapping objects that are represented by lines or shapes, such as the course of a road or the shape of a field.
id: Kedua, sebuah GPS dapat menyimpan apa yang disebut dengan *“track”*. Jika *waypoint* hanya menyimpan sebuah lokasi, maka sebuah *track* akan menyimpan sebuah seri lokasi kemanapun Anda bergerak. Sebagai contoh, *track* akan merekam lokasi Anda setiap satu detik, atau setiap satu meter, dan hasilnya akan berupa sebuah seri dari titik-titik yang menunjukan jalur lokasi dimana Anda pernah berada. *Track* sangat berguna untuk memetakan objek yang ditunjukan oleh garis atau bentuk, seperti sebuah jalan, atau bentuk dari sebuah lapangan.

source: If your GPS not started from 001 and you want to erase the previous point, go to icon “Find” in the main menu. Press on “waypoint” and then submenu in the right side to show Waypoint submenu. Drag to bottom and press “Delete” and “all symbols” and then “Yes”.
id: Jika nomor *waypoint* pada GPS Anda tidak dimulai dari 001 dna Anda ingin menghapus titik sebelumnya, pergi ke ikon "Find" pada Menu Utama. Tekan pada "waypoint" kemudian submenu pada sisi kanan untuk menampilkan submenu Waypoint. Geser ke bawah dan tekan "Delete" dan "all symbols" kemudian "Yes".

source: 6.5 Saving your location
id: 6.5 Menyimpan lokasi Anda

source: To save your current location as a waypoint:
id: Menyimpan lokasi Anda saat ini sebagai sebuah *waypoint*:

source: click the :kbd:`X` button until your reach the Main Menu.
id: Klik tombol :kbd:`X` hingga Anda sampai ke Menu Utama.

source: Using the joystick, move it so that :guilabel:`Mark` is highlighted on the screen. Push the joystick button down to open the **Save Waypoint** page.
id: Gunakan joystick, pindahkan hingga menu :guilabel:`Mark` disorot di pada layar. Tekan joystick ke bawah untuk membuka halaman **Save Waypoint**.

source: You can see on this page some information about the waypoint that you are saving. First is the name. If this is your first waypoint, it probably reads “001”. This is the number you should record on paper along with the information you want to collect about this object, e.g. name, address, phone, etc. Next you will see the time and date when the point is recorded. Below that are the coordinates, followed by the altitude.
id: Pada halaman ini Anda dapat melihat beberapa informasi tentang *waypoint* yang Anda simpan. Pertama adalah namanya. Jika ini *waypoint* pertama Anda, kemungkinan akan terbaca “001”. Ini merupakan nomor yang harus Anda catat di kertas bersamaan dengan informasi yang Anda ingin kumpulkan pada obyek ini, sebagai contoh: nama, alamat, telepon, dst. Selanjutnya Anda akan melihat jam dan tanggal ketika titik tersebut direkam. Di bawahnya terdapat koordinat, diikuti dengan ketinggian.

source: Use the joystick to move to the :guilabel:`OK` button at the bottom of the screen.
id: Gunakan joystick untuk berpindah ke tombol :guilabel:`OK` di bagian bawah dari layar.

source: Press the joystick button down to save this point. Be sure to write down in your notebook the number of the point, along with a description of the place and any other information you want to record about the place.
id: Tekan joystick untuk menyimpan untuk menyimpan titik ini. Pastikan untuk menulis nomor titik pada kerta catatan Anda, beserta keterangan tempat apakah itu dan berbagai informasi lainnya yang Anda ingin kumpulkan mengenai tempat tersebut.

source: Press the :kbd:`X` button to go to the Map page. You should now see your point
id: Tekan tombol :kbd:`X` untuk menuju halaman peta. Sekarang Anda seharusnya melihat titik Anda

source: on the map.
id: pada peta.

source: 6.6 Turning on the Track Log
id: 6.6 Menyalakan *Track Log*

source: Now that we have learned how to save points, let’s learn how to turn the track log on and off. When the track log is turned on, it will automatically record your path. It’s good practice to turn on the log when you begin mapping, and turn it off when you are finished. You will then be able to look at the track on a computer and see the path that you mapped. If you would like to map the course of a road, it is a good idea to save a waypoint at the beginning and end of the road, writing in your notebook the name and type of the road, and any other important information about the road.
id: Sekarang kita telah mempelajari bagaimana caranya untuk menyimpan titik, sekarang mari mempelajari bagaimana untuk menyalakan/mematikan *track log*. Ketika *track log* dinyalakan, secara otomatis GPS akan merekam jalur Anda. Pada saat mulai memetakan, sebaiknya *track log* dinyalakan, dan dimatikan pada saat Anda telah selesai. Anda akan dapat melihat trek pada sebuah komputer dan melihat jalur yang telah Anda petakan. Jika Anda ingin memetakan jalur pada jalan raya, adalah ide yang bagus untuk menyimpan sebuah *waypoint* pada awal dan akhir jalan, menuliskan nama dan tipe jalan, serta informasi penting lainnya tentang jalan tersebut pada buku catatan.

source: To turn track log, click the :kbd:`X` button until your reach the page that
id: Untuk menyalakan *track log*, klik pada tombol :kbd:`X` hingga Anda mencapai halaman

source: says Track Log.
id: yang bernama *Track Log*.

source: If you want To empty the track log (to delete earlier recordings), use
id: Jika Anda ingin mengosongkan *track log* (menghapus rekaman sebelumnya), gunakan

source: the joystick to select :guilabel:`Clear`, and press the joystick down. The bar at the top should read “0%”
id: joystick untuk memilih :guilabel:`Clear`, dan tekan joystick tersebut. Pada bar di bagian atas akan terbaca "0 %"

source: To turn on the log, move the joystick to highlight :guilabel:`On`, and press the joystick down.
id: Untuk menyalakan *track log*, gerakan joystick untuk menyorot :guilabel:`On`, kemudian tekan joystick.

source: The track log is now recording your path.
id: *Track log* sekarang akan merekam jalur Anda.

source: Press the :kbd:`X` button to go to the Map page. As you move you will see your
id: Tekan tombol :kbd:`X` untuk menuju halaman peta. Saat Anda bergerak Anda akan melihat

source: track shown as a series of dots.
id: *track* yang terlihat sebagai rangkaian dari titik-titik.

source: 6.7 Copying waypoints and tracks to the computer
id: 6.7 Meng-copy *waypoint* dan *track* ke komputer

source: When you are finished mapping with the GPS you will want to copy the points and tracks to your computer so that you can open them in JOSM and begin editing.
id: Ketika Anda selesai memetakan dengan GPS Anda akan menginginkan untuk menyalin titik dan *track* ke dalam komputer agar Anda dapat membukanya di dalam JOSM dan mulai mengeditnya.

source: One way to copy waypoints and tracks is using the free BaseCamp software supplied by Garmin and available for download from the Garmin website. However in this module, we will use an opensource program called GPSBabel, that provides several additional features.
id: Satu cara untuk menyalin *waypoint* and *track* adalah menggunakan perangkat lunak BaceCamp gratis yang disediakan oleh Garmin dan dapat didownload di situs Garmin. Meskipun demikian pada modul ini, kita akan menggunakan sebuah program opensource yang disebut GPSBabel yang menyediakan beberapa fitur tambahan.

source: 6.7.1 Installing GPS drivers
id: 6.7.1 Menginstalasi driver GPS

source: You may need to install GPS drivers on your computer. Open your training
id: Anda mungkin perlu menginstal driver GPS pada komputer Anda. Buka folder training

source: folder and find :file:`software/USBDrivers_23.exe`. Double-click it and install.
id: dan temukan :file:`software/USBDrivers_23.exe`. Klik dua kali di sini dan instal.

source: If you don’t have this file, you can download it. Open your internet
id: Jika Anda tidak memiliki file ini, Anda dapat mendownloadnya. Buka browser internet Anda

source: browser and go to: `http://www8.garmin.com/support/download_details .jsp?id=591 <http://www8.garmin.com/support/download_details.jsp?id=591>`_
id: dan pergi ke: `http://www8.garmin.com/support/download_details .jsp?id=591 <http://www8.garmin.com/support/download_details.jsp?id=591>`_

source: 3 Click :guilabel:`Download` to get the installation file. Locate it on your
id: 3 Klik :guilabel:`Download` untuk mendapatkan file instalasi. Cari pada komputer Anda

source: computer, and double-click to install.
id: dan klik dua kali untuk menginstal.

source: 6.7.2 Attaching GPS to the Computer
id: 6.7.2 Menghubungkan GPS ke komputer

source: 1. First, turn off the track log on your GPS by going to the Track page and selecting :guilabel:`Off`.
id: 1. Pertama, matikan *track log* GPS Anda dengan menuju ke halaman *Track* dan memilih :guilabel:`Off`.

source: Attach the GPS to your computer with the cable. One end should plug into
id: Sambungkan GPS ke komputer Anda dengan kabel data. Salah satu ujungnya harus tersambung ke

source: your computer’s USB port, and the other goes into the back of the GPS, beneath the rubber flap at the top. The GPS should be turned on to facilitate copying of the points and tracks.
id: USB port komputer Anda, dan ujung lainnya tersambung dengan GPS, di belakang flap karet pada bagian atas belakang GPS. GPS harus dinyalakan untuk dapat menyalin titik dan *track*.

source: 6.7.2 Getting the GPSBabel setup program
id: 6.7.2 Memperoleh pengaturan program GPSBabel

source: GPSBabel is a program that allows us to copy data from the GPS. If you have copy of GPSBabel in CD or flashdisk, you can skip this step and move to next section. If you don’t have GPSbabel:
id: GPSBabel adalah sebuah program yang memungkinkan kita untuk menyalin data dari GPS. Jika Anda memiliki file GPSBabel dalam CD/flashdisk, Anda dapat melewatkan langkah ini dan berpindah ke sesi berikutnya. Jika Anda tidak memiliki file GPSBabel:

source: Open your web browser and go to `www.gpsbabel.org <http://www.gpsbabel.org>`_
id: Buka browser internet Anda dan buka situs `www.gpsbabel.org <http://www.gpsbabel.org>`_

source: Click :guilabel:`Downloads` at the top of the page.
id: Klik :guilabel:`Downloads` pada bagian atas halaman.

source: Scroll down the page. If your computer uses Windows, you want to
id: Gulirkan halaman ke bawah. Jika komputer Anda menggunakan Windows, Anda ingin

source: download the installation file for Windows. Click :file:`GPSBabel-1.5.1-Setup.exe`. The file will be downloaded to your computer. Find GPSBabel installation software and double click to install.
id: mendownload file instalasi untuk Windows. Klik :file:`GPSBabel-1.5.1-Setup.exe`. Filenya akan terdownload ke komputer Anda. Temukan perangkat lunak instalasi GPSBabel dan klik dua kali untuk menginstalnya.

source: Click :guilabel:`Next`.
id: Klik :guilabel:`Next`.

source: Clcik :guilabel:`I accept` and :guilabel:`Next`.
id: Klik :guilabel:`I accept` dan :guilabel:`Next`.

source: Continue clicking :guilabel:`Next` until the program installs.
id: Lanjutkan klik :guilabel:`Next` hingga program mulai menginstal.

source: When the program has finished installing, click :guilabel:`Finish` to start GPSBabel.
id: Ketika program telah selesai diinstal, klik :guilabel:`Finish` untuk memulai GPSBabel.

source: 6.7.3 Copying Tracks and Waypoints
id: 6.7.3 Menyalin *Tracks* dan *Waypoints*

source: After you success install GPSBabel, it will automatically launch GPSBabel. Otherwise, you can find GPSBabel icon in the desktop or start menu.
id: Setelah Anda berhasil menginstalasi GPSBabel, GPSBabel akan terbuka secara otomatis. Jika tidak, Anda dapat temukan ikon GPSBabel pada Start Menu atau di dekstop.

source: Click in the circle next to the word :guilabel:`Device` at the top of the
id: Klik pada lingkaran dengan kata :guilabel:`Device` pada bagian atas

source: window.
id: jendela.

source: In the drop-down menu labelled :guilabel:`Format`, select :guilabel:`Garmin serial/USB protocol`
id: Pada menu daftar pilihan yang berlabel :guilabel:`Format`, pilih :guilabel:`Garmin serial/USB protocol`

source: Go down to the middle of the window, under :guilabel:`Output`. In the drop-down menu labelled :guilabel:`Format`, select :guilabel:`GPX XML`
id: Lihat di bagian pertengahan jendela aplikasi di bawah :guilabel:`Output`. Terdapat menu daftar pilihan yang berlabel :guilabel:`Format`, silahkan pilih :guilabel:`GPX XML`:

source: Click :guilabel:`File Name` and type a name for your saved file.
id: Klik: :guilabel:`File Name` dan ketik nama untuk file yang akan Anda simpan.

source: It should be something that describes the data, such as the date and the location. For example: :file:`jakarta-07-07-2014`.
id: Silahkan pilih nama file yang menggambarkan isi data di dalamnya, seperti tanggal dan lokasi survei. Sebagai contoh: :file:`jakarta-07-07-2014`

source: Make sure your GPS is connected to the computer and turned on.
id: Pastikan GPS Anda terhubung dengan komputer dalam keadaan menyala.

source: Click :guilabel:`Apply` in the bottom right corner of the window
id: Klik :guilabel:`Apply` di sisi pojok kanan bawah jendela

source: If all goes well you should see a bar move across the screen,
id: Jika berhasil dijalankan, anda akan melihat sebuah tanda yang melintasi layar anda,

source: indicating that the data is being retrieved from the GPS. When it is finished, your points and track will be saved in the file that you selected
id: yang mengindikasikan bahwa data anda sedang diambil dari GPS. Ketika sudah selesai, titik dan trek survei anda akan disimpan dalam file yang telah anda buat dan pilih sebelumnya

source: 6.8 Open Waypoints and Tracks in JOSM
id: 6.8 Membuka Waypoints dan Trek di JOSM

source: Now open JOSM. Go to :menuselection:`File → Open...`
id: Sekarang buka JOSM. Kemudian pilih :menuselection:`File → Open...`

source: Find and select the file that you created with GPSBabel. Click :guilabel:`Open`.
id: Cari dan pilih file yang telah Anda buat dengan GPSBabel. Klik :guilabel:`Open`.

source: You should now see your points and tracks loaded into JOSM.
id: Anda seharusnya dapat melihat titik dan track Anda termuat pada JOSM.

source: 6.8.1 Change waypoints and tracks colour in JOSM
id: 6.8.1 Mengubah warna waypoints dan trek di JOSM

source: To change tracks and waypoints colour, right click on the :guilabel:`track` layer or :guilabel:`waypoints` layer and then select :guilabel:`Customize Colours` and choose your preferred colour.
id: Untuk mengubah warna trek dan waypoint, klik kanan pada layer :guilabel:`track` atau :guilabel:`waypoints` kemudian klik guilabel:`Customize Colours` dan pilih warna yang ingin anda gunakan.

source: For tracks, not only you can change **line colour** but you can also change **line width**. Right click on :guilabel:`track` layer and then select :guilabel:`Customize Track Drawing`. Change :guilabel:`Drawing width of GPX Lines` with your preferred number (The larger the number the thicker the line)
id: Untuk trek, anda tidak hanya dapat mengubah **warna garis* akan tetapi anda juga dapat mengubah **tebal garis**. Klik kanan pada layer :guilabel:`track` kemudian pilih :guilabel:`Customize Track Drawing`. Silahkan ganti :guilabel:`Drawing width of GPX Lines` dengan angka tertentu (Semakin besar angkanya maka akan semakin besar garisnya)

source: Summary
id: Ringkasan
