Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-09-inserting-tag.po
Languages: id

source: Chapter 9: Inserting Special Tag in JOSM
id: Bab 9: Memasukkan Tag Khusus di JOSM

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Be able to insert tag in iD Editor
id: Dapat memasukkan tag di iD Editor

source: Be able to insert tag in JOSM
id: Dapat memasukkan tag di JOSM

source: Understanding standard tags that are used in OpenStreetMap
id: Mengetahui tag-tag standar yang digunakan di OpenStreetMap

source: You understand how to add data in OpenStreetMap and how to maintain the quality of existing data so that we can contribute better. In this training we want the objects that we mapped in OpenStreetMap to also appear as an article in Wikipedia. Therefore we need to insert some special tags so that later, articles based on mapped objects, can be uniformly displayed and in accordance with applicable rules.
id: Anda memahami bagaimana memasukkan data di OpenStreetMap serta dapat menjaga kualitas data yang ada sehingga kita dapat berkontribusi dengan lebih baik. Dalam pelatihan kali ini kita ingin agar objek-objek yang kita petakan di OpenStreetMap dapat juga muncul di Wikipedia sebagai artikel. Oleh karena itu kita membutuhkan untuk memasukkan beberapa tag khusus agar nantinya artikel yang dibuat berdasarkan objek-objek yang dipetakan bisa seragam dan sesuai dengan aturan yang berlaku.

source: 9.1 Inserting Tag in iD Editor
id: 9.1 Memasukkan Tag di iD Editor

source: When we want to add special tags in iD Editor we must ensure that we are connected to the Internet. Here are the steps for inserting a tag in iD Editor.
id: Ketika kita ingin menambahkan tag khusus di iD Editor kita harus memastikan bahwa kita sudah terhubung oleh internet. Berikut adalah langkah-langkah memasukkan tag di iD Editor.

source: Open the site: `www.openstreetmap.org <http://www.openstreetmap.org>`_
id: Buka situs: `www.openstreetmap.org <http://www.openstreetmap.org>`_

source: :guilabel:`Sign in` with your OSM account
id: Silahkan :guilabel:`sign up` dengan akun OSM Anda

source: Select edit with :guilabel:`iD Editor`
id: Pilih edit dengan :guilabel:`iD Editor`

source: Select object that you want to add the tag
id: Pilih objek yang ingin Anda tambahkan tag nya

source: *Display of tag in iD Editor*
id: *Tampilan tag di iD Editor*

source: Then select :guilabel:`All tags` and click :guilabel:`+` and add tag that you want.
id: Kemudian pilih :guilabel:`All tags` dan klik tanda :guilabel:`+` dan masukkan tag yang Anda inginkan.

source: *Tag box in iD Editor*
id: *Kotak tag di iD Editor*

source: After that, letâ€™s :guilabel:`Save` your changes.
id: Setelah itu silahkan :guilabel:`Save` perubahan Anda.

source: 9.2 Inserting Tag in JOSM
id: 9.2 Memasukkan Tag di JOSM

source: Besides inserting a special tag to the object using iD Editor we can also insert the tags to objects using JOSM. Basically inserting tags in JOSM almost equal to iD Editor. Here are the steps:
id: Selain menambahkan tag khusus terhadap objek meng- gunakan iD Editor kita juga bisa menambahkan tag kepada objek menggunakan JOSM. Pada dasarnya menambahkan tag di JOSM hampir sama dengan iD Editor. Berikut adalah langkah-langkahnya :

source: Open JOSM in your computer/laptop
id: Buka JOSM di komputer/laptop Anda

source: Download area you want to edit
id: Silahkan download area yang ingin Anda edit

source: **Select the object** you want to add tags
id: **Pilih objek** yang ingin Anda tambahkan tag

source: Then click :guilabel:`Add` on properties box on the right side as shown in the figure below
id: Kemudian klik :guilabel:`Tambahkan` pada kotak properties di sebelah kanan

source: *Adding tag in JOSM*
id: *Menambahkan tag di JOSM*

source: Type the **tag** that you want to use as shown in the figure below:
id: Ketikkan **tag** yang ingin Anda gunakan seperti ditunjukkan gambar di bawah ini:

source: *Adding key and value box*
id: *menambahkan key dan value*

source: Then click :guilabel:`OK`
id: Kemudian klik :guilabel:`OK`

source: 9.3 Presets Standardization
id: 9.3 Standarisasi Presets

source: OpenStreetMap allows all users to provide as many details as they can about their map. This information can be imprinted on each object using the menu presets available on OSM editor. We often find inconsistencies in the provision of information on various objects. Therefore the presets help standardization and uniformity of data.
id: OpenStreetMap memperbolehkan seluruh penggunanya untuk memberikan informasi sebanyak-banyaknya mengenai peta mereka. Informasi ini dapat dicantumkan pada tiap objek yang dipetakan menggunakan menu presets yang tersedia pada editor OSM. Kita seringkali menemukan ketidakkonsistenan dalam pemberian informasi pada berbagai objek. Oleh karena itulah dibuat standardisasi presets dan keseragaman data.

source: Menu Presets are made for these purposes:
id: Menu Presets dibuat dengan tujuan:

source: To ensure the stability (consistency) of data
id: Menjamin stabilitas (konsistensi) data

source: To facilitate the search and processing data
id: Memudahkan pencarian dan pengolahan data

source: As a benchmark in the provision of information through the presets
id: Sebagai patokan dalam pemberian informasi melalui presets

source: As a reference if you want to make improvements or validate the data
id: Sebagai acuan apabila ingin melakukan perbaikan atau validasi data

source: Maximizing the use of existing Internal Presets in JOSM
id: Memaksimalkan penggunaan Internal Presets yang sudah ada di JOSM

source: Maximizing data visualization on OpenStreetMap website
id: Memaksimalkan visualisasi data pada website OpenStreetMap

source: By using presets, standardization is enforced for all OSM users that use the standard menu preset when editing the map. One of the advantages of using internal presets that are already available in JOSM is the object visualization will render correctly on the OSM website.
id: Dengan adanya standardisasi preset ini, diharapkan seluruh pengguna OSM mau menggunakan standard ini ketika melakukan editing. Salah satu keuntungan menggunakan internal preset yang sudah tersedia pada JOSM adalah nantinya visualisasi objek tersebut akan muncul pada website OpenStreetMap.

source: To see standardized features used in JOSM menu presets please visit the following address: `http://wiki.openstreetmap.org/wiki/Id:Map_Features <http://wiki.openstreetmap.org/wiki/Id:Map_Features>`_
id: Untuk melihat standarisasi preset yang digunakan di menu presets JOSM, silahkan kunjungi alamat berikut ini : `http://wiki.openstreetmap.org/wiki/Id:Map_Features <http://wiki.openstreetmap.org/wiki/Id:Map_Features>`_

source: *Amenities list in Wiki OSM*
id: *Daftar amenitas di wiki osm*

source: Here are some informations that you should put into this project:
id: Berikut beberapa informasi yang seharusnya Anda masukkan ke dalam project kali ini adalah :

source: **Building**
id: **Bangunan**

source: Building name (key : name)
id: Nama bangunan (key : name)

source: Ownership (key : operator)
id: Kepemilikan (key : operator)

source: Building type (key : amenity)
id: Jenis Bangunan (key : amenity)

source: Building level (key : building:levels)
id: Jumlah Lantai (key : building_levels)

source: Address (key : addr:full)
id: Alamat (key : addr:full)

source: Reference (key : source:ref)
id: Referensi (key : source:ref)

source: **Highway**
id: **Jalan Raya**

source: Highway name (key : name)
id: Nama Jalan (key : name)

source: Highway type (key : highway)
id: Tipe Jalan (key : highway)

source: Highway width (key : width)
id: Lebar Jalan (key : width)

source: :ref:`Go to next chapter --> <ch10-imagery-offset>`
id: :ref:`Pergi ke bab selanjutnya --> <ch10-imagery-offset>`
