Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/osm/Chapter-08-conflict-resolution-*-osm.po
Languages: id

source: Chapter 8: Conflict Resolution in OSM
id: Bab 8: Penyelesaian Konflik di OSM

source: **Learning Objectives**
id: **Tujuan Pembelajaran**

source: Finding and resolving conflicts in JOSM
id: Menemukan dan menyelesaikan konflik di JOSM

source: Learning ways to avoid conflicts (using tasking manager)
id: Mengetahui cara-cara menghindari konflik (menggunakan tasking manager)

source: 8.1 Conflict in JOSM
id: 8.1 Konflik di JOSM

source: When we are working with JOSM and about to upload the changes, sometimes we encounter this message:
id: Ketika Anda sedang bekerja di JOSM dan ketika Anda mengupload peta yang telah diedit, Anda mendapatkan pesan seperti ini:

source: This happens when you download a group of data that includes a particular point, let’s say point A. At the same time there are other people who also downloaded point A, making changes to it and upload it back to OSM. Now when you try to upload your changes (including point A) with your version, the version is already different from the server version. This causes the server to be confused on which version of Point A that is correct.
id: Hal yang terjadi ketika Anda mendownload sekelompok data yang termasuk sebuah point/node, kita sebut titik A. Kemudian saat Anda sedang mengedit, ada orang lain yang juga mendownload titik A, mengubahnya, dan menyimpan kembali perubahannya pada OpenStreetMap. Sekarang saat Anda mencoba mengupload perubahan (termasuk titik A) dengan versi Anda akan berbeda dengan yang tesimpan pada OSM. Oleh karena itu, JOSM tidak tahun versi mana dari titik A yang benar.

source: 8.1.1 Resolving a Conflict
id: 8.1.1 Cara Menyelesaikan Konflik

source: The process of resolving conflicts in JOSM is pretty simple, even though it might be confusing at first. Basically, all conflicts that occur in JOSM will leave you with two options – Your Version of the object and Their Version of the object that is on the server. You just need to choose which version you want to use, -your version or the new version in the server.
id: Proses dalam menyelesaikan konflik cukup sederhana di JOSM, walaupun awalnya membingungkan. Pada dasarnya, untuk semua konflik yang terjadi JOSM akan menyediakan dua pilihan - objek versi Anda dan satu lagi versi orang lain yang berada di server. Anda harus memilih apakah ingin tetap menggunakan versi Anda atau versi baru di server.

source: When a conflict window appears, you might want to choose the “Syncronize node ... only”, but this will only resolve the conflict that occurs on the particular node. That is why it is better to choose the :guilabel:`Synchronize Entire Dataset` option so that you can resolve the conflicts all together.
id: Ketika jendela konflik muncul, Anda mungkin akan memilih tombol “Hanya mensinkronkan ...” , tetapi ini hanya akan memperbaiki konflik yang terjadi pada node tertentu. Oleh karena itu sebaiknya Anda memilih tombol :guilabel:`Sinkronisasi seluruh dataset` agar anda dapat menyelesaikan seluruh konflik sekaligus.

source: When you click on that button, there will be a new window that includes all of the conflict details. The conflict messages might seems complicated, but actually they are quite simple. You will know the type of conflict you encounter by indicating where the symbol
id: Ketika Anda klik tombol tersebut, akan muncul jendela baru yang yang berisikan detail konflik Anda. Pesan konflik tersebut mungkin terlihat rumit, namun sebenarnya sederhana. Anda akan tahu jenis konflik apa yang Anda dapatkan ditunjukkan oleh simbol

source: located. Conflict in this example indicating that it is on the properties, such as location or the object’s position. You can see that the coordinate and state are deleted.
id: Konflik dalam contoh ini mengacu pada properti, seperti lokasi dan keberadaan objek. Inilah sebabnya mengapa koordinat dan negara yang dihapus terdaftar.

source: **Types of Conflict:**
id: **Jenis Konflik**

source: **Properties:** Object has been moved (coordinate) or deleted
id: **Properti:** Objek telah dipindahkan (koordinat) atau dihapus

source: **Tag**: Object has different tags on both version
id: **Tag:** Objek memiliki tag yang berbeda di kedua versi

source: **Node**: There are differences on the node list
id: **Node:** Ada perbedaan dalam daftar node

source: **Members**: There are differences regarding the members of a relation
id: **Anggota:** Ada perbedaan pada daftar anggota dalam relasi

source: Conflict just shows up on two different edits at the same time. If there are three or more different edits happen at the same time, chain of conflicts will occurs. You can only solve two conflicts at the same time. You can choose Your Version, Their Version, or merge the two changes.
id: Konflik hanya muncul pada dua edit yang berbeda pada saat yang bersamaan. Jika ada tiga atau lebih edit yang berbeda pada saat bersamaan, maka rantai konflik akan bermunculan. Anda hanya dapat menyelesaikan dua konflik pada saat yang sama. Anda dapat memilih atau menggabungkan dua konflik pada saat yang sama. Anda dapat memilih versi Anda, versi yang lain, ataupun menggabungkan kedua perubahannya.

source: In this example, you don’t have option to merge the changes. Click on the :guilabel:`My Version` column if you are sure that your version is the right one. Click on :guilabel:`Their Version` if you think that other mapper’s edit should be retained.
id: Dalam contoh ini Anda tidak memiliki pilihan untuk penggabungan. Klik pada kolom pertama, atau :guilabel:`Versi saya` jika Anda yakin bahwa editan Anda lebih tepat. Klik pada :guilabel:`Versi mereka` jika Anda berpikir bahwa versi edit orang lain lebih baik.

source: After you choose which version is best, click on the :guilabel:`Apply Resolution` as shown in the figure above. After you finished resolving all the conflicts, you can start to upload your changes.
id: Setelah Anda memilih versi mana yang menurut Anda paling baik, kemudian klik :guilabel:`Terapkan Penyelesaian` seperti ditunjukkan gambar di bawah. Setelah Anda selesai menyelesaikan semua konflik, Anda dapat memulai untuk upload hasil perubahan data OSM Anda.

source: Do some more editing. Then click :guilabel:`Upload`. You will get a pop-up like the one below that says:
id: Lakukan editing lebih lanjut, Kemudian klik :guilabel:`Perbarui data`. Anda akan mendapatkan tampilan jendela seperti ini:

source: On your Windows menu you have a **Conflict List Dialog**
id: Pada jendela menu, Anda memiliki sebuah **Daf­ tar Konflik**

source: This window displays a list of conflicts. The total number of unresolved conflicts is shown in the header. You can select or resolve a conflict by clicking on it. This is useful when you have many conflicts to deal with.
id: Jendela ini menampilkan daftar konflik. Jumlah konflik yang belum terselesaikan ditunjukan pada bagian jendela tersebut. Anda dapat memilih dan menyelesaikan konflik dengan mengklik salah satunya. Ini sangat berguna apabila Anda berhadapan dengan banyak konflik.

source: You cannot upload your changes until this list is empty and all conflicts have been resolved.
id: Anda tidak dapat mengupload perubahan sampai jendela ini kosong dan semua konflik harus diselesaikan semua.

source: 8.1.2 Tips to Avoid Conflict
id: 8.1.2 Cara Menghindari Konflik

source: **Upload frequently**
id: **Upload Hasil Editan Secara Berkala**

source: To minimise the chance and number of conflicts it is important to upload your edits regularly. Conflicts appear more frequently for those who tend to save the area they are working on in their local computer, but wait a while to upload their changes. It is best to download the area you are working on, edit it and then immediately upload it. The longer the time between downloading data and uploading changes to that data, the more likely it is that someone has edited something in the meantime.
id: Untuk meminimalkan perubahan dan sejumlah konflik, sangat penting untuk mengupload editan Anda secara rutin. Konflik muncul lebih banyak bagi mereka yang mengedit seluruh wilayahnya terlebih dahulu dan menunda untuk menguploadnya. Hal yang terbaik adalah, download wilayah yang Anda kerjakan, edit, kemudian upload secepatnya secara berkala. Semakin lama waktu antara mendownload data dengan mengupload perubahannya, maka semakin besar kemungkinan seseorang telah mengedit/mengubah data tersebut pada saat itu.

source: **ONLY edit in the area you download**
id: **Mengedit pada Area yang Anda Download**

source: Editing in the specific area you have downloaded minimises the risk of conflict. Make sure you do not edit outside of the area that you have downloaded. You can easily see the areas outside your download area in JOSM, because the background is made up of diagonal lines instead of being solid black.
id: Mengedit di area yang spesifik mengurangi resiko konflik. Anda harus yakin bahwa Anda tidak mengedit diluar area yang telah Anda download dan Anda bagi berdasarkan Task Manager. Langkah ini dapat menghindari banyak pengguna mengedit wilayah yang sama. Anda dapat dengan mudah melihat mana daerah luar dari daerah yang Anda download di JOSM, karena latar belakang daerah luat tersebut terdapat garis-garis diagonal, bukan hanya warna hitam.

source: **Using the tasking manager**
id: **Menggunakan Tasking Manager**

source: The OSM Tasking Manager is a **tool** that mappers can use to **sort an area into a grid**, and work together **to map in an organised way**. Apart from being more organised, the tasking manager is also one way to avoid editing conflicts, because it helps prevent more than one person from editing the same area at the same time.
id: HOT Tasking Manager adalah sebuah **alat** dimana pembuat peta dapat membagi sebuah daerah menjadi banyak grid, lalu dapat bekerja bersama pembuat peta lainnya untuk meme­takan suatu daerah dengan cara yang lebih terorganisir. Selain lebih terorganisir, tasking manager juga merupakan salah satu cara untuk menghindari konflik, karena tidak memungkinkan lebih dari satu orang memetakan satu area yang sama.

source: The way the tasking manager operates is every mapper on a project selects one box from a grid overlaid on the mapping project area. This box represents a subsection of the mapping project area. When a mapper finishes mapping all features in their box, they can mark it as complete. This way, a team distributed in different areas can coordinate and work together to finish mapping in that grid.
id: Para pelaku pemetaan di area tersebut dapat memilih sebuah kotak pada grid yang ingin dipetakan, dan ketika mereka selesai memetakannya, mereka dapat menandai kotak tersebut sebagai komplit atau sudah selesai dipetakan. Dengan cara ini, sebuah tim yang berisi banyak orang yang tersebar di berbagai daerah dapat berkoordinasi bersama untuk menyelesaikan pemetaan pada grid tersebut.

source: To see how tasking manager works, let’s practice a bit more.
id: Untuk melihat bagaimana tasking manager bekerja, marilah kita lihat lebih dekat.

source: Open your internet browser and go to `tasks.hotosm.org <http://tasks.hotosm.org>`_. You will see a page like this:
id: Bukalah browser internet Anda dan buka website `tasks.hotosm.org <http://tasks.hotosm.org>`_. Anda akan melihat sebuah halaman seperti ini:

source: Click :guilabel:`Log in to OpenStreetMap`
id: Klik :guilabel:`Log in to OpenStreetMap`

source: Here you must agree to allow this application some access to your OSM account. To do so, click :guilabel:`Save Changes`.
id: Disini Anda harus menyetujui untuk memperbolehkan aplikasi ini mendapatkan akses kedalam akun OSM anda. Jika Anda setuju, klik :guilabel:`Simpan Perubahan`.

source: Now you will see a list of projects that currently active from many country where they doing coordination for mapping activities.
id: Sekarang Anda akan melihat sebuah daftar berisi proyek-proyek yang sedang ada saat ini dari banyak negara yang melakukan koordinasi untuk melakukan aktivitas pemetaan.

source: Click on a project to see further information related to the task as shown in the figure below.
id: Klik pada salah satu proyek untuk melihat informasi lebih lanjut seperti ditunjukkan pada gambar di bawah.

source: This page shows you everything you need to know about the project. On the left side of the page is a description of the mapping project and how it is being organised. You can click on the different tabs to get more information. On the right side is a grid showing the area to be mapped. Red grid squares have been completed, green squares have been completed and checked by another person, and the remaining squares still need to be mapped or are being worked on.
id: Halaman ini menunjukkan semua hal yang Anda perlu ketahui mengenai proyek tersebut. Pada sebelah sisi kiri halaman adalah sebuah deskripsi dari proyek pemetaan tersebut dan bagaimana mengaturnya. Anda dapat klik pada beberapa tab yang ada untuk melihat informasi lebih lanjut. Pada sisi kanan terdapat sebuah grid yang menunjukkan area yang sedang dipetakan. Kotak grid yang berwarna merah memiliki arti bahwa daerah tersebut telah selesai dipetakan, kotak berwarna hijau telah selesai dipetakan dan telah dilakukan pengecekan oleh orang lain dan divalidasi datanya, kotak dengan pinggiran berwarna kuning berarti sedang ada orang lain yang mengerjakan peta pada area tersebut, sedangkan kotak kosong lainnya belum ada atau belum selesai dipetakan.

source: In the right side show an area that currently being map.
id: Pada sisi kanan terdapat sebuah grid yang menunjukkan area yang sedang dipetakan.

source: **Orange** box represent an area that already mapped
id: kotak **Orange** menunjukkan sebuah area yang siap dipetakan

source: **Green** box represent an area that already mapped and validated by other people
id: kotak **Hijau** menunjukkan sebuah area yang telah selesai dipetakan dan telah divalidasi oleh orang lain

source: **Orange outline** box represent there is someone who currently map in that area
id: kotak **Garis berwarna kuning** menunjukkan adanya orang lain yang mengerjakan peta pada area tersebut

source: **Grey/empty** box represent the task is unfinished.
id: Kotak **kosong/abu-abu** menunjukkan pekerjaan belum selesai dipetakan.

source: You can click on tab :guilabel:`Contribute`, with click on :guilabel:`Take a task at random` if you want to pick task randomly or you can select a task manually in slippy map and then click :guilabel:`Start Mapping`
id: Anda dapat klik pada tab :guilabel:`Contribute`, dengan melakukan klik pada :guilabel:`Take a task at random`. Jika Anda ingin mengambil sebuah kotak grid secara acak atau Anda ingin memilih sebuah pekerjaan secara manual pada *slippy map* dan kemudian klik :guilabel:`Start Mapping`

source: After that select :guilabel:`Edit with JOSM` (You need to open JOSM and enable remote control first)
id: Setelah pilih :guilabel:`Edit with JOSM` (Jika tidak berhasil silahkan buka JOSM dan aktifkan memperbolehkan remote kontrol digunakan)

source: You can also open another editing software such as iD Editor, Potlach 2 and Field Papers
id: Anda juga dapat membuka perangkat lunak editing lainnya seperti iD Editor, Potlach 2, dan Field Papers

source: After you finish editing and upload the data into OSM server, you need to go back to the tasking manager and click :guilabel:`Mark task as done` making sure to add a changeset comment for the edits you created. It’s important to let other mappers know that you have finished the grid square. If you cannot finish the task, click :guilabel:`Unlock it` so another mapper can finish your task.
id: Ketika Anda selesai melakukan editing dan menguploadnya ke server OSM, Anda dapat kembali ke tasking manager dan menambahkan komentar mengenai perubahan yang Anda buat. Klik :guilabel:`Mark task as done` agar pembuat peta lainnya tahu bahwa Anda telah menyelesaikan kotak grid tersebut. Jika Anda tidak dapat menyelesaikan kotak tersebut, klik :guilabel:`Unlock it` sehingga kotak tersebut dapat dikerjakan oleh pembuat peta lainnya.

source: :ref:`Go to next chapter --> <ch9-inserting-special-tag-in-osm>`
id: :ref:`Pergi ke bab selanjutnya --> <ch9-inserting-special-tag-in-osm>`
