Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/data_types.po
Languages: id

source: Data Types
id: Tipe-tipe Data

source: The impact functions essentially combine spatial data in different formats through a common interpolation library. This essentially allows values from one data set to be assigned to another independent of their types. Given two layers H and E, say, the call::
id: Fungsi dampak dasarnya menggabungkan data spasial dalam format yang berbeda melalui perpustakaan umum interpolasi. Hal ini pada dasarnya memungkinkan nilai dari satu set data yang ditugaskan independen lain dari jenis mereka. Mengingat dua lapisan H dan E, yang disebut::

source: will produce a new layer with all values from H transferred to E in a manner appropriate for the data types of H and E. Generally, existing values in E will be also be carried over to I. Conceptually, the new layer I represents the values of H interpolated to E.
id: akan menghasilkan layer baru dengan semua nilai dari H ditransfer ke E dengan cara yang sesuai untuk tipe data H dan E. Umumnya, nilai-nilai yang ada pada E juga akan dilakukan ke l. Secara konseptual, layer baru l mewakili nilai H diinterpolasi ke E.

source: The function takes a number of optional keyword arguments that pertain to certain type combinations. They are:
id: Fungsi ini mengambil sejumlah alasan pemilihan kata kunci yang berhhubungan dengan kombinasi jenis. Mereka adalah:

source: layer_name: Optional name of returned layer. If None (default) the name of the exposure layer is used.
id: layer_name: Opsional nama kembali layer. Jika tidak ada (default) nama layer keterpaparan digunakan.

source: If hazard layer is of type raster, this is the name for new attribute in the result containing the hazard level. If None (default) the name of hazard is used
id: Jika layer bahaya adalah tipe raster, ini adalah nama untuk atribut baru pada hasil yang mengandung tingkat bahaya. Jika tidak ada (default) nama bahaya digunakan

source: If hazard layer is of type vector, it is the name of the attribute to transfer from the hazard layer into the result. If None (default) all attributes are transferred.
id: Jika layer bahaya adalah tipe vektor, ini adalah nama atribut untuk mentransfer dari layer bahaya ke dalam hasil. Jika tidak ada (default) semua atribut yang ditransfer.

source: mode: Interpolation mode for raster to point interpolation only. Options are 'linear' (default) or 'constant'
id: mode: Modus interpolasi untuk raster ke titik interpolasi saja. Pilihannya adalah 'linear' (default) atau 'constant'

source: The following table shows allowed combinations and what interpolation means in each case.
id: Tabel berikut ini menunjukkan kombinasi yang diperbolehkan dan interpolasi apa yang berarti dalam setiap kasus.

source: Methodology
id: Metodologi

source: Return value
id: Pengembalian nilai

source: Polygon
id: Poligon

source: Point
id: Titik

source: Clip points to polygon and assign all attributes
id: Memotong titik ke poligon dan menetapkan semua atribut

source: Line
id: Garis

source: Convert to points and use Polygon-Point algorithm
id: Konversi untuk titik dan menggunakan algoritma Polygon-Point

source: Bilinear or piecewise constant interpolation
id: Bilinear atau bagian interpolasi konstan

source: Convert to centroids and use Raster-Point algorithm
id: Konversi ke centroid dan menggunakan algoritma Raster-Point

source: Check that rasters are aligned and return E
id: Periksa raster yang selaras dan kembali E

source: See :ref:`writing_impact_functions` for more information and `assign_hazard_values_to_exposure_data <http://inasafe.org/api-docs/safe/engine/interpolation.html#safe.engine.interpolation.assign_hazard_values_to_exposure_data>`_ for the full documentation of this function.
id: See :ref:`writing_impact_functions` untuk informasi lebih lanjut dan `assign_hazard_values_to_exposure_data <http://inasafe.org/api-docs/safe/engine/interpolation.html#safe.engine.interpolation.assign_hazard_values_to_exposure_data>`_ untuk dokumentasi lengkap fungsi ini.
