Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/getting_involved.po
Languages: id

source: Getting involved
id: Ikut Terlibat

source: If you like the work we are doing in |project_name| and would like to contribute, we will welcome your involvement. We spend a lot of time and effort trying to make a robust, user friendly and useful software platform, but there is no substitute for having interested users participating and sharing their needs, problems and successes! Here are a few simple ways you can get involved:
id: Jika Anda menyukai pekerjaan yang kami lakukan di |project_name| dan ingin berkontribusi, kami sangat menyambut keterlibatan Anda. Kami menghabiskan banyak waktu dan usaha untuk membuat platform perangkat lunak yang dapat diandalkan, mudah digunakan dan berguna, namun hal ini tidak cukup tanpa keterlibatan pengguna yang memiliki ketertarikan untuk berpartisipasi dan berbagi kebutuhan, masalah, serta keberhasilan mereka! Berikut ini beberapa cara sederhana yang dapat Anda lakukan:

source: Visit our web site!
id: Kunjungi situs web kami!

source: The web site will always represent the latest information on how to use |project_name|. We encourage anyone who wants to get involved with the project to first read the content available on the site to familiarise themselves with the content. The website is available at:
id: Situs akan selalu menampilkan informasi terbaru tentang cara menggunakan |project_name|. Kami mendorong siapapun yang ingin terlibat dalam proyek ini untuk pertama-tama membaca konten yang tersedia pada situs ini untuk membiasakan diri dengan kontennya. Situs yang dimaksud tersedia di:

source: If you need help in solving some problems with |project_name| you should take a look at :ref:`getting_help`
id: Jika Anda membutuhkan bantuan dalam menyelesaikan suatu masalah dengan |project_name| Anda harus melihat di :ref:`getting_help`

source: Add yourself to the |project_name| Usermap!
id: Tambahkan diri Anda ke peta pengguna |project_name| !

source: As a User/Trainer/Developer of |project_name| you are encouraged to add yourself to the Usermap Webpage available at:
id: Sebagai Pengguna/Pelatih/Pengembang dari |project_name| anda disarankan untuk menambahkan data diri anda pada Halaman Situs Peta Pengguna yang tersedia pada:

source: Use the :guilabel:`Add me to map!` button on the left side and point the cross to the place where you live. Fill in your User Data and click on :guilabel:`Done!`. You are also able to download the coordinates of all entered |project_name| Users as a CSV file.
id: Gunakan tombol :guilabel:`Add me to map!` pada sisi kiri dan tunjukan dimana lokasi anda tinggal. Isilah data pengguna anda dan klik :guilabel:`Done!`. Anda juga dapat mendownload koordinat dari seluruh pengguna |project_name| dalam format berkas CSV.

source: Use our issue tracker!
id: Gunakan pencarian isu kami!

source: We maintain an issue tracker here:
id: Kami mengelola pencarian isu disini:

source: On this page you can browse and search existing issues and create new issues. The issue tracker is a great place to let us know about specific bugs you encounter or tell us about new features you would like to see in the software. Information about how to correctly file an issue is available in the :ref:`issue_howto` section.
id: Pada halaman ini anda dapat menelusuri dan mencari isu-isu yang ada atau membuat isu baru. Pelacak isu merupakan tempat yang bagus untuk memberitahu kami kesalahan spesifik yang anda temui atau memberi tahu kami tentang fitur baru yang anda ingin lihat pada perangkat lunak. Informasi tentang bagaimana memperbaiki berkas pada sebuah isu tersedia pada bagian :ref:`issue_howto`

source: Chat live to developers on IRC!
id: Mengobrol langsung dengan pengembang di IRC!

source: Internet Relay Chat (IRC) is a chat room environment where you can talk (by typing messages) to other inasafe users and developers to discuss ideas and get help. You can use your own IRC client and join #inasafe on the irc.freenode.net network. We also have a direct link at our Webpage http://www.inasafe.org. Just click on :menuselection:`Chat live!` and join us in the channel. Alternatively, you can use your web browser to join the chat room using the link below:
id: Internet Relay Chat (IRC) merupakan ruang berdiskusi di mana anda dapat berbicara (dengan mengetik pesan) kepada pengguna dan pengembang InaSAFE untuk menyampaikan ide atau mendapatkan bantuan. Anda dapat menggunakan klien IRC anda sendiri atau bergabung di #inasafe pada jaringan irc.freenode.net. Kami juga memiliki tautan langsung pada situs kami http://www.inasafe.org. Cukup klik pada :menuselection:`Chat live!` dan bergabung pada saluran kami. Alternatif lain, anda dapat menggunakan peramban web anda untuk bergabung dalam ruang diskusi menggunakan tautan di bawah ini:

source: On the form that appears, choose a user name, enter #inasafe in the :guilabel:`Channels:` box and complete the rest of the details in the form. After logging in wait a few moments and you will be take to the #inasafe channel.
id: Pada form yang muncul, pilih nama pengguna, masukan #inasafe di kotak :guilabel:`Channels:` dan lengkapi sisa rincian di form. Setelah masuk, tunggu beberapa saat dan Anda akan dibawa ke channel #inasafe.

source: Other people in the room may not be actively watching the channel, so just ask your question and leave the chat window open and check back every now and then until you see other chat room members become active.
id: Pengguna lain di ruangan itu mungkin tidak aktif mengikuti saluran, jadi silahkan mengajukan pertanyaan Anda dan tinggalkan jendela obrolan tetap aktif/terbuka dan periksa kembali setiap pertanyaan sampai Anda melihat anggota ruang obrolan lainnya berstatus aktif.

source: Submit your code!
id: Masukkan kode Anda!

source: We would really like to emphasise that |project_name| is Free and Open Source. That means anyone (or any organisation) can freely modify, adapt and improve the software. We will welcome any contributions to |project_name|.
id: Kami sangat ingin menekankan bahwa |project_name| adalah Gratis dan Terbuka. Artinya siapapun (atau organisasi apapun) dapat dengan bebas memodifikasi, mengadaptasi, dan mengembangkan perangkat lunak ini. Kami akan menerima segala kontribusi untuk |project_name|.

source: The easiest way to do this is to `fork <https://help.github.com/articles/fork-a-repo>`_ the |project_name| code base on GitHub and then send us a `pull request <https://help.github.com/articles/using-pull-requests>`_.
id: Cara yang paling mudah untuk melakukan ini `fork <https://help.github.com/articles/fork-a-repo>`_ |project_name| kode dasar berdasarkan GitHub dan kemudian mengirim kepada kami `pull request <https://help.github.com/articles/using-pull-requests>`_.

source: We also welcome small improvements, translations or other fixes via the issue
id: Kami juga menerima pengembangan kecil, penerjemahan atau perbaikan lainnya melalui pembuatan isu

source: management system mentioned above.
id: sistem manajemen yang disebutkan di atas.

source: We have strict requirements that all code submitted to |project_name| is compliant with high :doc:`/developer-docs/coding_standards` and is continually tested by a comprehensive regression testing system. We have this requirement in place to ensure a good experience for our users and to ensure that users can have confidence in the results produced by |project_name|.
id: Kami memiliki persyaratan yang ketat bahwa semua kode yang dikirim ke |project_name| harus memenuhi persyaratan yang sesuai :doc:`/developer-docs/coding_standards` dan terus diuji oleh sistem pengujian regresi lengkap. Kami menerapkan persyaratan ini untuk memastikan pengalaman yang baik bagi pengguna kami dan memastikan bahwa pengguna dapat meyakini kualitas hasil yang diproduksi oleh |project_name|.
