Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/issue_tracker.po
Languages: id

source: Submit an Issue
id: Menambahkan sebuah isu

source: You are more than welcome to let us know when you have found a bug or an issue in |project_name|.
id: Anda sangat diperbolehkan untuk memberitahu kami jika anda menemukan masalah atau isu pada |project_name|.

source: You can take the advantage of using MD language on |github| to make your report looking more nicely and better visible to the developers.
id: Anda dapat memanfaatkan keuntungan dengan menggunakan bahasa MD pada |github| untuk membuat laporan anda terlihat lebih baik dan lebih mudah dilihat oleh pihak pengembang.

source: To be able to track your issue best we have the following rules that make clear that the issue will be easily recognised by a developer and probably solved as fast as possible:
id: Untuk dapat melacak isu anda dengan baik, kami memiliki aturan-aturan berikut untuk memperjelas bahwa isu tersebut dengan mudah dikenal oleh pengembang dan kemungkinan diselesaikan akan lebih cepat.

source: Check if the issue is already documented – best using the search
id: Periksa apabila isu tersebut sudah memiliki dokumentasi - cara terbaik adalah menggunakan pencarian

source: If Documented – add comment to issue – If not create new issue
id: Jika sudah ada dokumentasinya - tambahkan komentar pada isu - jika tidak, buatlah isu yang baru

source: For a new issue the set up should be
id: Untuk sebuah isu yang baru, penulisannya adalah seperti sebagai berikut

source: # Problem
id: # Masalah

source: # Expected Outcome
id: # Hasil yang diharapkan

source: # Example (with data or images)
id: # Contoh (dengan data atau gambar)

source: # Solution (if possible)
id: # Solusi (jika memungkinkan)

source: # Version and OS – (If necessary) InaSAFE/QGIS version and operating system
id: # Versi dan Sistem Operasi - (jika diperlukan) versi QGIS/InaSAFE dan sistem operasi

source: Task a developer to it (if you know who might solve it)
id: Tugaskan seorang pengembang pada isu tersebut (jika anda mungkin tahu siapa yang kemungkinan dapat menyelesaikannya)

source: Additionally add tags and milestones (if possible).
id: Tambahkan tags dan pencapaian (jika memungkinkan).

source: To track the issue down it would be even more helpful if you:
id: Melacak isu akan lebih baik lagi jika anda:

source: Take screenshots where they help to illustrate the issue and drag and drop the screenshot into the ticket.
id: Mengambil screenshot dimana mereka dapat membantu menggambarkan isu tersebut dan memasukan screenshot tersebut ke dalam tiket.

source: If you can, cut and paste an error message text or similar textual output, we prefer that over a screenshot.
id: Jika anda mampu, potong dan salin sebuah pesan teks kesalahan atau hasil tekstual serupa, kami lebih memilih pesan teks tersebut daripada sebuah screenshot.

source: If you are pasting verbatim text, place it inside three backticks like so:
id: Jika anda menyalin teks khusus, letakan di antara tiga tanda petik terbalik:

source: Add a # CC section and include others who may be interested in following the ticket if needed e.g.
id: Tambahkan bagian # CC dan masukan orang-orang yang kemungkinan memiliki ketertarikan untuk mengikuti tiket jika diperlukan

source: Add a # See Also section to cross reference to other tickets or commits if needed e.g.
id: Tambahkan juga bagian # Lihat untuk memberikan referensi pada tiket-tiket yang lain atau perubahan-perubahan tertentu jika dibutuhkan

source: If you don't know what to do, have a look at the already existing issues and copy the necessary parts to your issue.
id: Jika anda masih belum paham untuk melakukannya, silahkan melihat pada isu yang sudah tersedia dan salin beberapa bagian untuk isu anda.
