Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/postprocessors.po
Languages: id

source: Post-processors
id: Pasca-prosesor

source: This document explains the purpose of post-processors and lists the different available post-processors and the requirements each has to be used effectively.
id: Dokumen ini menjelaskan tujuan dari pasca-prosesor dan daftar pasca-prosesor berbeda yang tersedia dan kebutuhan yang diperlukan untuk digunakan dengan efektif.

source: What is a post-processor?
id: Apa itu pasca-prosesor?

source: A postprocessor is a function that takes the results from the impact function and calculates derivative indicators, for example if you have an affected population total, the **Gender** post-processor will calculate gender specific indicators such as additional nutritional requirements for pregnant women
id: Postprocessor merupakan sebuah fungsi yang akan mengambil hasil dari fungsi dampak dan mengkalkulasikan indikator turunan, sebagai contoh jika anda mempunyai jumlah populasi terdampak, post-processor **Gender** akan memperhitungkan indikator sebagai informasi nutrisi tambahan yang dibutuhkan untuk ibu hamil.

source: Selecting a post-processor
id: Memilih pasca-prosesor

source: Post-processor configuration
id: Konfigurasi post-processor

source: Each activated post-processor will create an additional report in the dock and in the printout. If problems arise while post processing, the system will inform you and will skip post-processing.
id: Setiap post-processor yang aktif akan membuat sebuah laporan tambahan pada dek dan pada hasil cetak. Jika terjadi suatu masalah pada saat post processing, sistem akan memberi tahu anda dan akan melewati post-processing.

source: Creating post-processors
id: Membuat pasca-prosesor

source: If you feel there is an important post-processor which is missing, there are two avenues you can follow:
id: Jika anda merasa terdapat suatu post-processor penting yang tidak ada, terdapat dua langkah yang anda dapat ikuti:

source: You can develop it yourself or with the aid of a programmer who has a good understanding of the python programming language.
id: Anda dapat mengembagkannya sendiri atau dengan bantuan seorang programmer yang memiliki pemahaman baik mengenai bahasa program python

source: You can file a ticket on our `issue tracking system <https://github.com/AIFDR/inasafe/issues>`_, and if time and resources allow we will implement it for you.
id: Anda dapat melaporkan sebuah tiket pada `sistem pengecekan masalah <https://github.com/AIFDR/inasafe/issues>`_, dan jika terdapat waktu dan sumber daya, kami akan mengimplementasikannya untuk anda.
