Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/toolbar.po
Languages: fr

source: Toolbar
fr: Barre d'outils

source: This Section contains the explanation of the different icons in the Toolbar and the function behind the icons.
fr: Cette section contient l'explication des différents boutons de la barre d'outils et les fonctions qu'ils lancent.

source: Toggle |project_name| Dock
fr: Afficher/masquer le panneau |project_name|

source: Toggle Dock
fr: Afficher/masquer le panneau

source: This button enables and hides the |project_name| dock. After enabling the dock you are able to move it around your screen. Dock and undock it wherever you want to have it and keep it even as a separated window.
fr: Ce bouton permet d'affichier ou masquer le panneau |project_name|. Après avoir affiché le panneau, vous pouvez le déplacer dans l'écran. Placez-le où vous voulez, même en tant que panneau flottant si besoin.

source: You can find more Information about the dock itself in the :ref:`toolbar_dock` section.
fr: Pour plus d'information sur le panneau lui-même, consultez la section :ref:`toolbar_dock`.

source: |project_name| Keyword Editor
fr: Editeur de mots-clés |project_name|

source: Keyword Editor
fr: Editeur de mots-clés

source: |project_name| Options
fr: Options |project_name|

source: This button opens the Options window which is described in :ref:`toolbar_options`
fr: Ce bouton ouvre la fenêtre des Options qui est décrite dans la section :ref:`toolbar_options`

source: |project_name| Impact Functions Browser
fr: Navigateur des fonctions d'impact |project_name|

source: This button opens the Impact Function Browser.
fr: Ce bouton ouvre la fenêtre de filtre des types d'impacts

source: It basically enables you to filter and browse impact functions that are available in |project_name|. More information about that topic can be found in :ref:`impact_functions`.
fr: Il vous permet de filtrer et naviguer parmi les types d'impacts qui sont disponibles dans |project_name|. Pour plus d'information, consultez :ref:`impact_functions`.

source: |project_name| Minimum Needs Tool
fr: Outil Besoins minimum |project_name|

source: This tool will calculated minimum needs for evacuated people.
fr: Cet outil calcule les besoins minimum pour les personnes déplacées

source: For a guidance how to use this tool take a look in :ref:`minimum_needs`.
fr: Pour des indications sur l'utilisation de cet outil, consultez :ref:`minimum_needs`.

source: |project_name| Converter
fr: Convertisseur |project_name|

source: This tool will convert an earthquake 'shakemap' that is in grid xml format to a GeoTIFF file. For more detailed information look at :ref:`converter`.
fr: Cet outil convertit un tremblement de terre 'shakemap' initialement au format xml en un fichier GeoTIFF. Pour plus d'information, consultez :ref:`converter`.

source: |project_name| Batch Runner
fr: Outil d'exécution par lots |project_name|

source: The Batch Runner lets you load saved scenarios (:ref:`save_scenario`) and batch run them in one go. You can find more information about using this tool at :ref:`batch_runner`
fr: L'outil d'exécution par lots vous permet de charger des scénarios (:ref:`save_scenario`) et de les exécuter tous en une seule passe. Pour plus d'information sur cet outil, consultez :ref:`batch_runner`

source: Save current scenario
fr: Sauvegarder le scénario en cours

source: |project_name| Save Current Scenario
fr: Sauvegarder le scénario |project_name| en cours

source: This is the tool you need to prepare/save scenarios for the :ref:`tb_batch_runner` Tool. It lets you save the current visible scenario in QGIS to a :file:`.txt` file. This file you can open as a scenario again in Batch runner and recalculate it. A more detailed description is available in :ref:`batch_runner`
fr: Cet outil offre la possibilité de concevoir et sauvegarder des scénarios pour l'outil :ref:`tb_batch_runner`. Il permet de sauvegarder le scénario en cours dans QGIS dans un fichier :file:`.txt`. Vous pouvez ensuite ouvrir ce scénario à nouveau dans l'outil d'exécution par lots et le calculer à nouveau. Une description plus détaillée est consultable à la section :ref:`batch_runner`

source: |project_name| OpenStreetMap Downloader
fr: Outil |project_name| de téléchargement de données OpenStreetMap

source: |project_name| OpenStreetMap downloader
fr: Outil |project_name| de téléchargement de données OpenStreetMap

source: This tool will fetch building ('structure') data from the OpenStreetMap project for you.
fr: Cet outil va télécharger pour vous les bâtiments ('structure') de la base OpenStreetMap
