Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/user-docs/writing_documentation.po
Languages: id

source: Writing Documentation
id: Menulis Dokumentasi

source: The documentation for |project_name| is written using ReSTructured text (.rst) and the Sphinx documentation builder.
id: Dokumentasi untuk |project_name| ditulis menggunakan ReSTructured text (.rst) dan pembangun dokumentasi Sphinx

source: The best way to learn how to write .rst is to look at the source of existing documentation - the markup syntax is very simple. There are a number of useful tags that you can use to make your documentation clear and visually interesting, the more commonly used in this document are listed below. For a more detailed list, please visit the `Sphinx Inline Markup page <http://sphinx.pocoo.org/markup/inline.html>`_
id: Cara terbaik untuk mempelajari bagaimana menulis .rst dengan melihat sumber dokumentasi yang tersedia - markup syntax sangat sederhana. Ada beberapa tag yang berguna yang dapat Anda gunakan untuk membuat dokumentasi yang jelas dan secara visual menarik, yang lebih umum digunakan dalam dokumen ini tercantum di bawah ini. Untuk daftar lebih detail, mohon kunjungi halaman `Sphinx Inline Markup <http://sphinx.pocoo.org/markup/inline.html>`_

source: A complete list of supported .rst markup is also available `here <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#block-quotes>`_.
id: Daftar lengkap yang mendukung markup .rst juga tersedia `disini <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html#block-quotes>`_.

source: Following are a few tips for documentation writers:
id: Berikut adalah beberapa petunjuk untuk penulis dokumentasi:

source: Take a look in the `lookup table <./lookup_table.html>`_ to see which terms and phrases are used and which you should definitely **not** translate.
id: Coba lihat pada `tabel lookup <./lookup_table.html> _` untuk melihat mana istilah dan frase yang digunakan dan mana yang seharusnya **tidak** Anda terjemahkan.

source: There is a "Community Edition" of `PyCharm <http://www.jetbrains.com/pycharm/>`_ available. Consider using this for writing documentation.
id: Terdapat "Community Edition" dari `PyCharm <http://www.jetbrains.com/pycharm/>`_ yang tersedia. Pertimbangkan untuk menggunakan *software* ini dalam penulisan dokumentasi.

source: Try to use underscores (_) in filenames and links (anchors) as a separator.
id: Cobalah untuk menggunakan garis bawah (_) dalam menuliskan nama file dan tautan (jangkar) sebagai pemisah.

source: Try to use dashes (-) in directory names as a separator.
id: Cobalah untuk menggunakan garis (-) dalam menuliskan nama direktori sebagai pemisah.

source: Try to avoid using tables wherever possible. Only use tables if there is really no other way to display the documentation.
id: Hindarilah untuk menggunakan tabel sebisa mungkin. Gunakanlah jika memang sudah tidak ada cara lain untuk menampilkan dokumentasi yang Anda buat.

source: Common tags used in the Documentation:
id: Tag yang umum digunakan pada Dokumentasi:

source: Here are some common useful tags ::
id: Berikut adalah beberapa tag yang umum digunakan ::

source: remark: use pt instead of px because of latex output A4 = height ~ 1000pt A4 = width ~ 700pt
id: remark: gunakan pt bukan px karena hasil latex A4 = tinggi ~ 1000pt A4 = lebar ~ 700pt

source: Help writing/fixing documentation
id: Membantu menulis/memperbaiki dokumentasi

source: Helping writing the documentation is an easy task. The only thing you need to have is a local copy of the |project_name| documentation branch.
id: Membantu menulis dokumentasi adalah tugas yang mudah. Satu-satunya hal yang perlu Anda miliki adalah salinan lokal dari cabang dokumentasi |project_name|.

source: Clone |project_name| documentation
id: Clone dokumentasi |project_name|

source: In order to clone the documentation of |project_name| you only have to follow this procedure:
id: Untuk meng-clone dokumentasi |project_name| , Anda hanya perlu mengikuti prosedur berikut ini:

source: Things you have to have to be able to help with documentation:
id: Hal-hal yang harus dimiliki untuk membantu dokumentasi:

source: Search for the .rst file you'd like to extend/fix and work on it.
id: Pilihlah file .rst yang Anda inginkan untuk memperluas/memperbaiki dan bekerja di dalamnya.

source: Afterwards commit your local changes to your local clone with the command:
id: Setelah melakukan perubahan lokal Anda untuk klon lokal dengan perintah:

source: After that you have to push your local changes to your github fork with:
id: Setelah itu Anda harus mem-push perubahan lokal Anda ke fork github Anda dengan:

source: You can than do a pull request on github to request your changes to be reviewed and taken into the official documentation.
id: Anda dapat melakukan permintaan pull pada github untuk meminta perubahan Anda ditinjau dan dibawa ke dalam dokumentasi resmi.
