Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/road-map/context.po
Languages: id

source: Context
id: Konteks

source: Indonesia experiences a wide range of natural hazards because it is located along major tectonic plate boundaries. It is along these boundaries that the biggest volcanoes and earthquakes happen, including those that cause tsunamis such as the one that devastated many countries in Asia in December 2004.
id: Indonesia mengalami berbagai bencana alam karena terletak di sepanjang lempeng tektonik besar. Di sepanjang batas tersebut, gunung berapi dan gempa bumi terbesar terjadi, termasuk yang menyebabkan tsunami seperti yang menghancurkan banyak negara di Asia pada Desember 2004.

source: |BNPB| has identified a priority need to improve Indonesiaâ€™s methodology for contingency planning with an emphasis on the use of realistic disaster scenarios as the starting point for this new, comprehensive process. |BNPB| has been working with the Australia-Indonesia Facility for Disaster Reduction (|AIFDR|) and the World Bank on a methodology and associated software tools for developing realistic disaster scenarios for contingency planning.
id: |BNPB| telang mengidentifikasi kebutuhan prioritas dalam meningkatkan metodologi Indonesia untuk perencanaan kontingensi dengan penekanan pada penggunaan skenario bencana yang realistis sebagai titik awal yang baru, proses yang komprehensif. |BNPB| telah bekerja dengan Australia-Indonesia Facility for Disaster Reduction (|AIFDR|) dan World Bank pada metodologi dan perangkat lunak (software) terkait untuk mengembangkan skenario bencana realistis untuk perencanaan kontingensi.

source: Background
id: Latar belakang

source: The scenario development methodology has been implemented in an open-source software tool called |project_name| (Indonesia Scenario Assessment For Emergencies). |project_name| is designed to help understand the likely impacts of disasters such as floods, earthquakes or tsunami. It combines spatial data sets representing hazard levels (e.g. ground shaking intensity, water depth, etc.) with information on population, building and infrastructure. The data are collected from scientists, local government and communities; and complemented by external tools such as OpenStreetMap. The software focuses on examining the impact of a single disaster to specific sectors in a certain area to support disaster risk reduction planning based on realistic scenarios. |project_name| provides quantitative information such as:
id: Metodologi pengembangan skenario telah diimplementasikan pada perangkat lunak (software) open-source yang bernama |project_name| (Indonesia Scenario Assessment For Emergencies). |project_name| dirancang untuk membantu memahami kemungkinan dampak bencana seperti banjir, gempa bumi atau tsunami. Hal ini menggabungkan dataset spasial mewakili tingkat ancaman bencananya (misalnya intensitas pergerakan tanah, kedalaman air, dll) dengan informasi pada populasi, bangunan, dan infrastruktur. Data dikumpulkan dari para ahli, pemerintah daerah dan komunitas; dan dilengkapi oleh tool eksternal seperti OpenStreetMap. Perangkat lunak ini berfokus pada pemeriksaan dampak bencana tunggal untuk sektor-sektor tertentu di daerah tertentu untuk mendukung pengurangan resiko bencana berdasarkan pada skenario realistis. |project_name| menyediakan informasi kuantitatif seperti:

source: Areas affected by the hazard.
id: Area yang terkena dampak oleh ancaman bencana.

source: Number of people affected.
id: Jumlah orang yang terkena dampak

source: Number of people needing to be evacuated.
id: Jumlah penduduk yang perlu dievakuasi.

source: Which schools, government offices and other public facilities that may be closed.
id: Sekolah, kantor pemerintahan, dan fasilitas umum lainnya yang mana yang mungkin ditutup.

source: Which hospitals can still take patients.
id: Rumah sakit yang mana yang masih dapat menerima pasien.

source: Where roads may be closed.
id: Jalanan mana yang mungkin ditutup.

source: Which buildings/open areas are not affected and could be utilised as evacuation centres.
id: Bangunan/area terbuka yang mana yang tidak terkena dampak dan dapat dimanfaatkan sebagai pusat evakuasi.

source: be easy to use
id: mudah untuk digunakan

source: allow results to be reproduced
id: memperhitungkan hasil yang akan dihasilkan

source: ensure consistency across different locations and scenarios
id: memastikan konsistensi di lokasi dan skenario yang berbeda

source: provide a platform for near real time impact estimates such as predicted fatalities based on earthquake ground shaking.
id: menyediakan platform untuk memperkirakan dampak dalam waktu dekat seperti memprediksi kematian berdasarkan pergerakan tanah akibat gempa bumi.

source: To date, the approaches at the heart of |project_name| have been developed and piloted as guided by the 2012 |project_name| Project Plan.
id: Untuk saat ini, pendekatan pada jantung |project_name| telah dikembangkan dan dikemudikan sebagaimana dibimbing oleh Rencana Proyek |project_name| 2012
