Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/road-map/terms-of-reference.po
Languages: id

source: Terms of Reference
id: Kerangka Acuan

source: The official name of the project is |project_name| - with the Unix project name being all lowercase: |project_name|.
id: Nama resmi dari proyek ini adalah |project_name| - dengan nama proyek Unix menjadi huruf kecil semua: |project_name|.

source: |project_name| is Free and Open Source licensed with GPL v3
id: |project_name| bersifat Gratis dan Terbuka berlisensi dengan GPL v3

source: The development of |project_name| is governed by the Technical Working Group (TWG) whose members include technical representatives from |BNPB|, |AIFDR|, |GoA| and World Bank.
id: Pengembangan |project_name| diatur oleh Technical Working Group/Kelompok Kerja Teknis (TWG) yang anggotanya termasuk perwakilan teknis dari |BNPB|, |AIFDR|, |GoA| dan World Bank.

source: The high level decisions and strategic direction for the |project_name| project is governed by the Project Steering Committee (PSC). The members are:
id: Keputusan tingkat tinggi dan arah strategis untuk proyek |project_name| diatur oleh Project Steering Committee (PSC). Para anggotanya adalah:

source: Chair: Sutopo Purwo (|BNPB|)
id: Ketua Umum: Sutopo Purwo (|BNPB|)

source: Web links for |project_name| are
id: Link situs untuk |project_name| adalah

source: Domain name: http://www.inasafe.org
id: Nama domain: http://www.inasafe.org

source: Github repository: https://github.com/AIFDR/inasafe
id: Repositori Github: https://github.com/AIFDR/inasafe

source: High priority issues: https://github.com/AIFDR/inasafe/issues
id: Isu-isu prioritas tinggi: https://github.com/AIFDR/inasafe/issues
