Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/socialisation/inasafe_*_more_detail.po
Languages: id

source: |project_name| in More Detail
id: |project_name| dalam Bahasan Lebih Rinci

source: **Learning Objectives:**
id: **Tujuan Pembelajaran**

source: Learn to interrogate |project_name| results using simple GIS tools, such as zooming, information and measurement tools
id: Belajar untuk memeriksa hasil |project_name| menggunakan tool SIG sederhana, seperti tool perbesaran, informasi, dan pengukuran

source: Add a new hazard layer, read its attribute table and symbolise it based on its attributes
id: Tambahkan sebuah layer ancaman yang baru, bacalah tabel atributnya, dan lakukan simbologi berdasarkan data atributnya

source: Create |project_name| keywords for the new hazard layer
id: Buat keyword |project_name| untuk layer ancaman yang baru

source: Understand the difference between a model hazard and a footprint hazard
id: Mengerti perbedaan antara sebuah model ancaman dengan sebuah jejak ancaman

source: Adjust the percentage of affected people who will need evacuation
id: Mengatur persentase jumlah penduduk yang terdampak yang akan membutuhkan evakuasi

source: Aggregate |project_name| results by administrative boundaries
id: Agregasi hasil |project_name| berdasarkan batas administrasi

source: This module continues from the previous section, :doc:`run_basic_inasafe`.
id: Modul ini melanjutkan dari modul sebelumnya, :doc:`run_basic_inasafe`.

source: Interrogating the output data
id: Memeriksa data hasil

source: You should now have several layers that have been generated by |project_name|.
id: Anda sekarang seharusnya telah memiliki beberapa layer yang telah dihasilkan oleh |project_name|.

source: *Estimated buildings affected* - Vector Data (one or two layers)
id: *Perkiraan jumlah bangunan yang terdampak* - Data vektor (satu atau dua layer)

source: **Symbol**
id: **Simbol**

source: **Name**
id: **Nama**

source: Identify Features
id: Identifikasi Fitur

source: Open Attribute Table
id: Buka Tabel Attribut

source: Measure Line
id: Ukur Garis

source: Measure Area
id: Ukur Area

source: Zoom to Layer
id: Perbesar ke Layer

source: Zoom In
id: Perbesar

source: Add Vector Layer
id: Tambahkan Layer Vektor

source: Estimated buildings affected
id: Bangunan yang diperkirakan terkena dampak

source: Click :guilabel:`Estimated buildings affected` in the Layers panel to select it. The layer name will be highlighted in blue.
id: Klik :guilabel:`Perkiraan bangunan terdampak` pada panel daftar layer untuk memilihnya. Nama layer akan tersorot menjadi biru.

source: Click the :guilabel:`Identify Features` tool and then click on a building.
id: Klik pada tool :guilabel:`Identifikasi Fitur` dan kemudian klik pada sebuah bangunan.

source: Here we selected the building circled above, which causes the attributes of the building to be shown in a new window or panel.
id: Di sini kita akan memilih bangunan yang dilingkari seperti di atas, dimana atribut bangunan tersebut akan ditunjukan pada sebuah jendela atau panel yang baru.

source: Click the :guilabel:`Zoom to Layer` tool. This will return the map view to the extent of the :guilabel:`Estimated buildings affected` layer.
id: Klik pada tool :guilabel:`Perbesar ke Layer`. Ini akan mengembalikan tampilan peta Anda pada jangkauan layer :guilabel:`Perkiraan Bangunan yang Terdampak`.

source: Population which need evacuation
id: Populasi yang akan membutuhkan evakuasi

source: In the Layers panel uncheck :guilabel:`Estimated buildings affected` and check one of layers named :guilabel:`Population which need evacuation`.
id: Pada panel Daftar Layer, non-aktifkan :guilabel:`Perkiraan bangunan terdampak` dan aktifkan salah satu layer yang bernama :guilabel:`Penduduk yang perlu dievakuasi`.

source: Select :guilabel:`Population which need evacuation` in the Layers panel to select it. The layer name will be highlighted in blue.
id: Klik :guilabel:`Penduduk yang perlu dievakuasi` pada panel daftar layer untuk memilihnya. Nama layer akan tersorot menjadi biru.

source: Zoom in to an area of your choice.
id: Perbesar pada area pilihan Anda.

source: Use the :guilabel:`Identify Features` tool to select a pixel (square) of the selected layer, :guilabel:`Population which need evacuation`.
id: Gunakan tool :guilabel:`Identifikasi Fitur` untuk memilih sebuah piksel (kotak) yang dipilih dari layer :guilabel:`Penduduk yang perlu dievakuasi`.

source: Use the :guilabel:`Identify Features` tool to select other pixels to find out their value.
id: Gunakan alat :guilabel:`Identifikasi Fitur` untuk memilih piksel yang lain untuk mengetahui nilai mereka.

source: Close the Identify Results window.
id: Tutup jendela Hasil Identifikasi.

source: Close the Measure window.
id: Tutup jendela pengukuran.

source: Click the :guilabel:`Zoom to Layer` button to return to the full extent of the selected layer.
id: Klik pada tombol :guilabel:`Perbesar ke Layer` untuk kembali ke tampilan sepenuhnya pada layer yang dipilih.

source: Uncheck all layers except:
id: Hapus centang semua layer kecuali:

source: buildings
id: bangunan

source: people
id: orang

source: Flood footprint in |project_name|
id: Sejarah banjir pada |project_name|

source: Adding a vector layer
id: Menambahkan layer vektor

source: Click the :guilabel:`Add Vector Layer` button.
id: Klik pada tombol :guilabel:`Tambahkan Layer Vektor`.

source: 16. Click :guilabel:`Browse` and navigate to the :file:`data` folder within the InaSAFE tutorial data folder. Select :file:`flood_osm_bpbd18113_jakarta.shp` and click :guilabel:`Open`.
id: 16. Klik :guilabel:`Cari` dan arahkan pada folder :file:`data` dalam folder data tutorial InaSAFE. Pilih :file:`banjir_osm_bpbd18113_jakarta.shp` dan klik :guilabel:`Buka`.

source: This dataset contains subvillage boundaries for Jakarta. During the floods in January 2013 provincial disaster managers collected information about the flooding, including the location of the flooded area by sub-village boundary.
id: Dataset ini berisi data batas RW untuk Jakarta. Selama banjir pada Januari tahun 2013 BPBD Provinsi DKI telah mengumpulkan informasi tentang banjir, salah satunya adalah lokasi area yang tergenang berdasarkan batas RW.

source: The |project_name| panel may show the warning "Layer keywords missing." We will address this concern later on.
id: |project_name| saat ini menunjukkan peringatan "Kata kunci layer hilang:" kami akan mengatasi masalah ini pada langkah-langkah selanjutnya.

source: Let's examine the data by opening its attribute table.
id: Mari periksa data ini dengan membuka tabel atribut nya

source: Make sure :guilabel:`flood_osm_bpbd18113_jakarta` layer is selected (highlighted blue in the Layers panel). Click the Open Attribute Table button.
id: Pastikan layer :guilabel:`flood_osm_bpbd18113_jakarta` terpilih (garis biru pada panel Daftar Layer). Klik tombol Buka Tabel Atribut.

source: The information in the attribute table is the same as that shown with the :guilabel:`Identify Feature` tool, but instead of viewing only one object's attributes, we can see all of the objects at once.
id: Informasi didalam tabel atribut sama dengan yang ditunjukkan pada *tool* :guilabel:`Identifikasi Fitur`, tapi tidak hanya melihat informasi satu objek, Anda dapat melihat semua objek sekaligus.

source: Close the attribute table.
id: Tutup tabel atribut.

source: Symbolising vector
id: Simbolisasi Vektor

source: Now let's stylise the subvillage administration boundary to only see the flood affected (affected = 1) areas.
id: Sekarang kita akan merubah tampilan batas RW hanya untuk melihat area terdampak banjir (affected = 1).

source: Double-click on the :guilabel:`flood_osm_bpbd18113_jakarta` layer - this will open up the layer properties window.
id: Klik dua kali pada *layer* :guilabel:`flood_osm_bpbd18113_jakarta` - ini akan membuka tabel properti.

source: Navigate to the style tab.
id: Navigasikan ke tab style.

source: Click the drop-down menu where it says :guilabel:`Single Symbol` and instead select :guilabel:`Categorized`.
id: Klik pada menu daftar pilihan yang bertuliskan :guilabel:`Simbol Tunggal`, dan ubah menjadi :guilabel:`Dikategorikan`.

source: In the drop-down menu next to :guilabel:`Column`, select :guilabel:`affected`.
id: Pada menu daftar pilihan :guilabel:`Kolom`, pilih :guilabel:`affected`.

source: Click the :guilabel:`Classify` button. Three rows will appear with coloured boxes and numbers next to them.
id: Klik tombol :guilabel:`Klasifikasi`. Tiga baris akan muncul dengan kotak berwarna dan angka disebelahnya.

source: Select the first row with the coloured box that reads "0 0" and click the Delete button.
id: Pilih baris pertama dengan kotak warna yang terbaca "0 0" dan klik tombol Hapus.

source: Select the row with the coloured box with no text next to it and click the Delete button.
id: Pilih baris dengan kotak berwarna tanpa teks dan klik tombol Hapus.

source: Confirm there is only one row left. Click :guilabel:`OK` to close the layer properties window.
id: Pastikan hanya satu baris yang tertinggal. Klik :guilabel:`OK` untuk keluar dari jendela *layer* properti.

source: The map will look something like this:
id: Tampilan peta akan terlihat seperti ini:

source: We've now symbolised the layer! Only the subvillage areas that were flooded on the 18th of January are shown. Now, how can we use this hazard layer in |project_name|?
id: Anda telah melakukan simbolisasi layer pertama! Anda hanya dapat melihat Rukun Warga yang tergenang pada tanggal 18 Januari. Sekarang, dapatkah kita menggunakan layer ancaman ini di |project_name|?

source: Adding Keywords
id: Menambahkan Kata kunci (keyword)

source: Title
id: Judul

source: :kbd:`Jakarta flooding on the 18th January 2013`
id: :kbd:`Banjir Jakarta pada 18 Januari 2013`

source: Category
id: Kategori

source: :kbd:`Hazard`
id: :kbd:`Ancaman`

source: Subcategory
id: Subkategori

source: :kbd:`flood[wet/dry]`
id: :kbd:`banjir[basah/kering]`

source: Source
id: Sumber

source: Next we will run |project_name| again with this new flood hazard footprint.
id: Silakan jalankan |project_name| lagi dengan batas tapak ancaman banjir yang baru.

source: For more information about keywords have a look in :doc:`../../user-docs/application-help/keywords`
id: Untuk informasi lebih lanjut mengenai Kata Kunci lihat di :doc:`../../user-docs/application-help/keywords`

source: Buildings within affected subvillages
id: Bangunan terdampak dalam batas administrasi wilayah RW

source: Confirm that |project_name| has the following in its drop-down menus.
id: Pastikan bahwa |project_name| memiliki tampilan menu sebagai berikut:

source: Jakarta flooding on the 18th January 2013
id: Banjir Jakarta pada 18 Januari 2013

source: Buildings
id: Bangunan

source: Be flooded
id: Terkena banjir

source: Click :guilabel:`Run`.
id: Klik :guilabel:`Hitung`.

source: Read through the |project_name| results, how are they different to the previous |project_name| building analysis?
id: Bacalah hasil |project_name|, bagaimana perbedaan dengan hasil sebelumnya dalam analisis bangunan |project_name| ?

source: Click :guilabel:`Print...` and save the output.
id: Klik :guilabel:`Cetak...` dan simpan sebagai *output*.

source: Evacuation as a percentage
id: Evakuasi dalam persentase

source: We were able to determine how many people needed to be evacuated previously by specifying how deep the water had to be for the location to be determined unsafe. However when you don`t know how deep the water is and you only know the extent of the flooded area, it is hard to determine how many people will need evacuating. |project_name| therefore needs your help!
id: Kami mampu menentukan berapa banyak orang yang membutuhkan evakuasi dalam skenario akhir dengan menentukan kedalaman air untuk lokasi yang tidak aman. Namun ketika Anda tidak mengetahui kedalaman air tersebut dan Anda hanya mengetahui area yang terkena banjir, akan sulit menentukan berapa banyak orang yang akan perlu dievakuasi. Oleh karena itu |project_name| membutuhkan bantuan Anda!

source: Instead of determining how many people will be evacuated by a spatial area, the following scenario will calculate the affected population. |project_name| asks the user to input a percentage of the affected population that may need evacuating.
id: Sebagai pengganti menentukan berapa banyak orang yang akan dievakuasi dengan area spasial, skenario ini digunakan penduduk yang terdampak. |project_name| meminta pengguna untuk memasukkan persentase penduduk terdampak yang mungkin perlu evakuasi.

source: Uncheck :guilabel:`buildings` in the Layers panel and instead check :guilabel:`people`.
id: Non-aktifkan :guilabel:`buildings` pada panel Daftar Layer dan aktifkan :guilabel:`penduduk`.

source: Confirm that the |project_name| panel has the following in its drop-down menus:
id: Pastikan bahwa panel |project_name| memiliki tampilan menu sebagai berikut:

source: People
id: Orang

source: Need evacuation
id: Perlu evakuasi

source: To configure the impact function click the :guilabel:`Options...` button. There are three tabs in the Options window which can be edited.
id: Untuk konfigurasi fungsi dampak klik tombol :guilabel:`Pilihan...`. Ada tiga tab dalam jendela Pilihan yang dapat diedit.

source: Within the Impact Function Configuration window we are able to change not only the percentage of evacuated people but also the ratio of youth/adult/elder and the minimum needs per person per week.
id: Dalam jendela *Konfigurasi Fungsi Dampak* Anda dapat mengubah tidak hanya presentase orang yang perlu dievakuasi tetapi juga rasio anak muda/orang dewasa/orang tua dan jumlah kebutuhan minimum per orang per minggu.

source: In the options tab you can see that default is 1. For the first analysis we will keep this figure. Click :guilabel:`OK`.
id: Pada tab pilihan Anda dapat melihat bahwa pengaturan standar adalah 1, untuk analisis pertama ini kita akan menggunakan angka ini. Klik :guilabel:`OK`

source: Run |project_name| again.
id: Jalankan |project_name| lagi.

source: Read through the |project_name| results, how different is this to the previous |project_name| people analysis?
id: Bacalah hasil |project_name|, bagaimana perbedaannya dengan hasil sebelumnya dalam analisis penduduk |project_name|?

source: Click :guilabel:`Print` and save accordingly.
id: Klik :guilabel:`Cetak` dan kemudian simpan.

source: Comparing Results - Optional
id: Membandingkan Hasil - Opsional

source: You have now completed the following runs
id: Anda sekarang telah menyelesaikan proses berikut ini

source: **Hazard**
id: **Ancaman**

source: **Threshold**
id: **Ambang batas**

source: **Data Type**
id: **Jenis Data**

source: **Exposure**
id: **Keterpaparan**

source: **Impact function**
id: **Fungsi Dampak**

source: flood model
id: model banjir

source: Need Evacuation
id: Perlu dievakuasi

source: Vector
id: Vektor

source: flood 180113
id: banjir 180113

source: Complete the last column of the above table. For more information on data type go to :doc:`rastervsvector`
id: Lengkapi kolom terakhir dari tabel di atas. Untuk informasi lebih lanjut tentang tipe data lihat :doc:`rastervsvector`

source: Basic Aggregation
id: Agregasi Dasar

source: Click the :guilabel:`Add Vector` button.
id: Klik pada tombol :guilabel:`Tambahkan Layer Vektor`.

source: Click :guilabel:`Browse` and navigate to the :file:`data` folder within the InaSAFE tutorial data folder. Select :file:`district_osm_jakarta.shp` and click :guilabel:`Open`. Click :guilabel:`Open` again to load the layer.
id: Klik :guilabel:`Navigasi` dan arahkan pada folder :file:`data` dalam folder data tutorial InaSAFE. Pilih :file:`district_osm_jakarta.shp` dan klik :guilabel:`Buka`. Klik :guilabel:`Buka` lagi untuk memuat *layer*.

source: **Category:** postprocessing - Meaning this layer is to be used after the impact is calculated
id: **Kategori:** pascapemrosesan - berarti *layer* yang digunakan setelah perhitungan dampak diperoleh*

source: **Title:** District's of Jakarta
id: **Judul** : Kabupaten di Jakarta

source: **Aggregation attribute:** KAB_NAME - This is the column in the attribute table that will be used for aggregating the output.
id: **Attribut agregasi:** KAB_NAME - Ini adalah kolom pada tabel atribut yang akan digunakan untuk *output* agregasi.

source: **Female ratio attribute:** PEREMPUAN - This is a column indicating the female/male ration in each district, which will be used in the impact calculation.
id: **Rasio atribut wanita:** PEREMPUAN - Ini merupakan kolom yang mengindikasikan rasio Perempuan/Laki-laki disetiap distrik, yang akan digunakan di perhitungan dampak.

source: If you look at the attribute table, you will see the various values for these fields in each administrative area.
id: Jika Anda melihat pada tabel atribut, Anda akan melihat beberapa nilai untuk setiap *field* disetiap area administrasi.

source: Run |project_name|.
id: Jalankan |project_name|.

source: The population results will be similar to previous scenarios, but now the statistics are also divided by administrative boundaries.
id: Hasil populasi akan sama seperti skenario sebelumnya, tetapi hasil statistik akan dibagi oleh batas administrasi.

source: Let's check the results for affected buildings aggregated by district as well. Change the |project_name| settings to query buildings instead of population.
id: Mari cek hasil untuk agregasi bangunan terdampak dengan kotamadya. Ganti pengaturan |project_name| untuk mengolah bangunan daripada populasi.

source: Run |project_name| again. Your results should look similar to the following:
id: Jalankan |project_name| lagi. Hasil Anda seharusnya tampak sama seperti ini:

source: :ref:`Go to next module --> <other-hazards>`
id: :ref:`Modul selanjutnya --> <other-hazards>`
