Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/socialisation/objective.po
Languages: id

source: . _objective:
id: . _objektif:

source: Objective
id: Tujuan

source: Understand the concept of |project_name|
id: Pemahaman konsep |project_name|

source: Understand the components of |project_name|
id: Pemahaman komponen dari |project_name|

source: Able to run |project_name| and understand results
id: Dapat menjalankan |project_name| dan memahami hasilnya

source: Target Audience
id: Target Peserta

source: Personals responsible in developing contingency plans at provincial and district levels.
id: Individu yang bertanggung jawab dalam mengembangkan rencana kontinjensi di tingkat provinsi dan kabupaten.

source: Lecturers and students from relevant departments such as Geography, Geodesy, Geomathics, Information Technology and other earth-related science.
id: Dosen dan mahasiswa dari departemen yang relevan seperti Geografi, Geodesi, Geomatika, Informasi Teknolog, dan yang berhubungan dengan ilmu kebumian lainnya.

source: Representatives from NGOs working in disaster risk reduction
id: Perwakilan dari Lembaga Swadaya Masyarakat (LSM) yang bekerja di bidang pengurangan risiko bencana

source: Other relevant organizations and agencies
id: Organisasi atau lembaga lain yang releval

source: Prerequisites
id: Prasyarat

source: Be able to operate a computer (word processing, presentations, internet, spreadsheets).
id: Dapat mengoperasikan sebuah komputer (mengetik, membuat presentasi, internet, dan tabel).

source: Basic skills in Geographic Information System is an advantage.
id: Kemampuan dasar pada Sistem Informasi Geografi merupakan sebuah kelebihan.

source: Laptop with:
id: Laptop dengan:

source: Minimum RAM of 2 GB (recommended 4 GB)
id: Minimum RAM 2 GB (disarankan 4 GB)

source: WIFI - connected to the internet
id: WIFI - terhubung dengan internet

source: Windows (XP, 7, 8), Linux (Training Ubuntu later than 12.04) or similar (e.g. Mint or Debian), Mac OSX (Lion - 10.7, Snow Leopard -10.6)
id: Windows (XP, 7, 8), Linux (Training Ubuntu di atas versi 12.04) atau serupa (misalnya Mint atau Debian), Mac OSX (Lion - 10.7, Snow Leopard -10.6)

source: Credits
id: Pengembang

source: |project_name| Socialisation Training Manual was developed by Australia-Indonesia Facility for Disaster Reduction (|AIFDR|), The National Agency for Disaster Management, Indonesia and World Bank â€˜s Global Facility for Disaster Reduction and Recovery Labs (World Bank-|GFDRR|).
id: Panduan Pelatihan Sosialisasi |project_name| telah dikembangkan oleh Australia-Indonesia Facility for Disaster Reduction (|AIFDR|), Badan Nasional Penanggulangan Bencana, Indonesia dan World Bank's Global Facility for Disaster Reduction and Recovery Labs (World Bank-|GFDRR|).

source: Manual based on:
id: Petunjuk berdasarkan pada:

source: Version 1.2 of |project_name|
id: |project_name| versi 1.2

source: Produced:
id: Dibuat:

source: August 2013
id: Agustus 2013

source: For inquiries, contact:
id: Untuk keterangan lebih lanjut, hubungi:

source: General information on |project_name| appears online at the |project_name| website: http://www.inasafe.org
id: Informasi umum tentang |project_name| terdapat secara online pada website |project_name|: http://www.inasafe.org

source: Contact: info@inasafe.org
id: Kontak : info@inasafe.org

source: Ph: +62 21 398 30088
id: Telepon: +62 21 398 30088

source: Resources obtained by:
id: Sumber diperoleh oleh:

source: Manual licenced under:
id: Panduan dirilis di bawah lisensi:

source: Author:
id: Pembuat:

source: `Kristy Van Putten <kristy.vanputten@gmail.com>`_, Deputy Risk and Vulnerability manager |AIFDR| |GA|
id: `Kristy Van Putten <kristy.vanputten@gmail.com>`_, Deputi Manajer Risiko dan Kerentanan |AIFDR| |GA|
