Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/socialisation/other-hazards.po
Languages: id

source: Confirm that window has the following boxes.
id: Konfirmasi bahwa jendela ini memiliki kotak-kotak.

source: For more information on the OSM loader please go to :ref:`openstreetmap_downloader`
id: Untuk informasi lebih lanjut mengenai OSM loader silakan berkunjung ke :ref:`openstreetmap_downloader`
