Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/socialisation/other-hazards.po
Languages: id

source: Other Hazards in |project_name|
id: Ancaman bencana lain dalam |project_name|

source: **Objectives:**
id: **Tujuan:**

source: To run |project_name| with other hazards, specifically Volcano and Earthquake
id: Untuk menjalankan |project_name| dengan jenis ancaman bencana lain, khususnya ancaman bencana gunung api dan gempa bumi

source: To save a subset of an existing layer
id: Untuk menyimpan suatu bagian dari layer yang sudah ada

source: To acknowledge the memory limitation of your computer
id: Untuk menjawab keterbatasan memori komputer Anda

source: To understand the difference in scale between hazards
id: Untuk memahami perbedaan dalam skala antarjenis ancaman bencana

source: To run |project_name| using a Tsunami model (optional)
id: Untuk menjalankan |project_name| menggunakan model Tsunami (pilihan)

source: **Expected Results**
id: **Hasil yang Diharapkan:**

source: Participants are able to:
id: Peserta dapat:

source: save a selected feature
id: menyimpan fitur yang terpilih

source: run a Volcano scenario in |project_name| using a volcano vent location
id: menjalankan skenario ancaman bencana gunung api dalam |project_name| menggunakan lokasi dari kawah gunung api

source: determine the best course of action to fix a memory error
id: menentukan tindakan terbaik untuk memperbaiki kesalahan pada memori

source: run an Earthquake scenario in |project_name| using a shakemap
id: menjalankan skenario gempa bumi dalam |project_name| menggunakan shakemap/peta guncangan

source: run a Tsunami scenario in |project_name| (optional)
id: menjalankan skenario tsunami dalam |project_name| (pilihan)

source: Volcanoes in Indonesia
id: Gunung api di Indonesia

source: There are 129 active volcanoes in Indonesia, and its always valuable to know how many people, or how much infrastructure is in a certain perimeter of the vent. Hence |project_name| is able to use a vent location (point) as a hazard layer, the dataset that we are going to use in section of the training was downloaded from the Smithsonian website. You may ask “How can we use a point to figure out impact? |project_name| needs your help!.
id: Terdapat 129 gunung api aktif di Indonesia, dan tentu akan sangat penting untuk mengetahui berapa banyak orang atau infrastruktur yang berada di sekitar gunung api tersebut. Dengan demikian |project_name| dapat menggunakan lokasi kawah gunung api (dalam bentuk titik) sebagai layer bahaya bencana, data yang akan kita gunakan berasal dari lokasi gunung api yang kita download dari situs Smithsonian. Anda mungkin bertanya "Bagaimana bisa kita menggunakan sebuah titik untuk menghitung dampak?" |project_name| perlu bantuan Anda!.

source: :menuselection:`File --> Open Projects`, browse to *Volcano_Indonesia.qgs*
id: :menuselection:`File --> Buka Proyek`, cari ke *Volcano_Indonesia.qgs*

source: Select Feature and Save
id: Memilih Fitur dan Menyimpan

source: As you can see there are many Volcanoes in Indonesia, lets zoom into one volcano to analysis. :guilabel:`Right Click` on the Volcanoes layer in the **Layer List** and :guilabel:`Select` *Open Attribute Table*
id: Sebagaimana dapat Anda lihat terdapat banyak gunung api di Indonesia, silakan :guilabel:`perbesar` ke salah satu gunung api untuk menganalisis. :guilabel:`Klik kanan` pada layer gunung api dan :guilabel:`pilih` *Buka Tabel Atribut*

source: In the *Look for* section type :kbd:`Merapi` (circle 1),
id: Di bagian *Lihat untuk* ketik :kbd: `Merapi` (lingkaran 1),

source: :guilabel:`Select` **NAME** from dropdown menu (circle 2)
id: :guilabel:`Pilih` **NAMA** dari dropdown menu (lingkaran 2)

source: :guilabel:`Search` (circle 3). This will select only the Volcano that have Merapi in the name column
id: :guilabel:`Klik pencarian` (lingkaran 3). Ini hanya akan memilih gunung api yang memiliki nilai bertuliskan Merapi saja pada kolom nama

source: :guilabel:`Check` *Show selected only* (circle 4) This will identify only the selected layers.
id: :guilabel:`Centang` *Tampilkan hanya yang terpilih* (lingkaran 4). Ini akan mengidentifikasi hanya pada layer terpilih.

source: :guilabel:`Click` on *Pan map to the selected row* (circle 5). Selected layer should be in the centre on the map canvas
id: :guilabel:`Klik` pada *Geser peta ke baris terpilih* (lingkaran 5). Layer terpilih berada di tengah-tengah kanvas peta

source: :guilabel:`Close` Attribute Table Window (circle 6)
id: :guilabel:`Tutup` Jendela Tabel Atribut (lingkaran 6)

source: :guilabel:`Zoom to Selection` to zoom in further, continue until you get to an extent
id: :guilabel:`Perbesar ke pilihan` untuk memperbesar lebih lanjut, lanjutkan sampai Anda mendapatkan tingkat perbesarannya

source: similar to the one below. (The yellow triangle is Merapi)
id: Sama dengan yang di bawah ini. (Segitiga yang berwarna kuning adalah Merapi)

source: Now that we know where Merapi is, and have check that it is in fact in the right location, we are going to make a hazard layer with just this point.
id: Sekarang setelah kita tahu dimana gunung api Merapi, dan sudah mengecek bahwa berada lokasi yang benar, kita berencana untuk membuat layer bahaya dengan hanya menggunanakan satu titik tersebut.

source: :guilabel:`Right Click` on Volcano in the **Layer List**
id: :guilabel:`Klik Kanan` pada gunung berapi di **Daftar Layer**

source: and :guilabel:`Save selection as`
id: dan :guilabel:`Simpan pilihan sebagai`

source: :guilabel:`Browse` and navigate to your data area, :guilabel:`save as` “Merapi” (circle 1).
id: :guilabel:`Klik Navigasi` dan :guilabel:`arahkan` ke direktori data Anda, :guilabel:`simpan sebagai` "Merapi" (lingkaran 1).

source: :guilabel:`Check` *Add saved file to map* (circle 2)
id: :guilabel:`Centang` *Tambahkan file yang tersimpan ke dalam peta* (lingkaran 2)

source: :guilabel:`OK` (circle 3)
id: :guilabel:`OK` (lingkaran 3)

source: :guilabel:`Uncheck` Volcanoes in the layer window.
id: :guilabel:`Jangan centang` layer gunung api pada windows.

source: You should now have a point that shows the location of Merapi. Lets take some time to examine the ‘dot’.
id: Anda sekarang seharusnya telah memiliki satu titik yang menunjukkan lokasi Merapi. Gunakan beberapa menit untuk memeriksa ‘titik tersebut’.

source: Use the :guilabel:`Identify feature` tool to find more out about the Volcano
id: Gunakan alat :guilabel:`Identifikasi Fitur` untuk mengetahui lebih lanjut tentang gunung berapi

source: Use the :guilabel:`Measure line` tool to find out how far away is the closest population hub (brown areas on the map)
id: Gunakan alat :guilabel:`Mengukur garis` untuk mengetahui seberapa jauh pusat penduduk terdekat (area yang berwarna coklat pada peta)

source: For the Identify feature and Measure line tool to work you need to have the Merapi layer highlighted in the layer window. Which can be accomplished by clicking once on the layer in the Layer List.
id: Untuk mengidentifikasi fitur dan menggunakan pengukuran garis Anda harus menyorot terlebih dahulu layer Merapi pada jendela layer yang dimana dapat dicapai dengan mengklik sekali pada lapisan dalam daftar Layer.

source: Keywords
id: Kata kunci (keyword)

source: We are reminded by |project_name| result window that we do not have a keyword for this new layer, so lets make one!
id: Kita diingatkan oleh |project_name| bahwa kita belum memiliki kata kunci (layer) untuk layer baru ini, jadi segera tentukan kata kunci nya!

source: Go to :guilabel:`InaSAFE Keyword Editor`
id: Pergi ke :guilabel:`Editor Kata Kunci InaSAFE`

source: Type :kbd:`Merapi erupting` as the title
id: Ketik :kbd:`Erupsi Merapi` sebagai judul

source: For the Category :guilabel:`Check` **Hazard**
id: Untuk Kategori :guilabel:`centang` **Ancaman**

source: For Subcategory :guilabel:`Select` **Volcano**
id: Untuk Subkategori pilih :guilabel: **Gunung Api**

source: Configure and Run |project_name|
id: Konfigurasi dan Menjalankan |project_name|

source: Conform that |project_name| has the following in the drop-down boxes
id: Cek bilamana |project_name| memiliki apa yang ada pada kotak dropp-down berikut

source: Merapi erupting
id: Merapi meletus

source: people
id: orang

source: Need evacuation
id: Perlu evakuasi

source: Before we run |project_name| again, we have to tell |project_name| what the hazard zone is!
id: Sebelum kita menjalankan |project_name| lagi, kita harus memberi tahu |project_name| yang manakah area bahaya nya!

source: 23. Click on :guilabel:`...` (impact function editor) next to *Need evacuation* As a default |project_name| has made 3 hazard areas:
id: 23. Klik pada :guilabel:`...` (editor fungsi dampak) di sebelah *Butuh evakuasi* sebagai default |project_name| telah membuat 3 area ancaman:

source: Vent -3 km
id: Titik kawah -3 km

source: that its written 3,5,10 so if you wanted the categories to be Vent-5, 5-10 and then 10-25 then you would type 5,10,25
id: Tertulis 3,5,10 jadi jika Anda menginginkan titik kawah -5, 5-10 dan 10-25, maka Anda harus mengetikkan 5,10,25

source: :guilabel:`Run` |project_name|
id: :guilabel: `Menjalankan` |project_name|

source: :guilabel:`Click` |project_name| Print, save accordingly
id: :guilabel:`Klik` |project_name| Cetak, kemudian simpan

source: Analysis Results
id: Hasil Analisis

source: Needs per week are based on the cumulative of all 3 zone hence vent - 10km
id: Kebutuhan per minggu berdasarkan akumulasi dari 3 zona yaitu dari titik kawah - 10km

source: Free time
id: Waktu luang

source: It is time for you to run through |project_name| yourself, with no instructions, make sure to print each result! Take 10 mins to run:
id: Ini adalah saatnya bagi Anda untuk menjalankan sendiri |project_name|, tanpa instruksi, pastikan mencetak setiap hasil! Gunakan waktu 10 menit untuk menjalankan:

source: In the event of **Merapi erupting** how many **buildings** will **be affected** within **3,5,10*** km of the vent.
id: Pada peristiwa **Merapi meletus** berapa banyak **bangunan** yang akan **terdampak** dalam jarak 3,5,10 km dari titik kawah gunung api.

source: In the event of **Merapi erupting** how many **people** will **be affected** within **5,10,25** km of the vent.
id: Pada peristiwa **Merapi meletus** berapa banyak **orang** yang akan **terdampak** dalam jarak 5,10,25 km dari titik kawah gunung api.

source: In the event of **Merapi erupting** how many **buildings** will **be affected** within **5,10,25** km of the vent.
id: Pada peristiwa **Merapi meletus** berapa banyak **bangunan** yang akan **terkena dampak** dalam jarak 5,10,25 km dari titik kawah gunung api.

source: **ANSWER** __________________________ **ANSWER** __________________________ **ANSWER** __________________________
id: **JAWAB** __________________________ **JAWAB** __________________________ **JAWAB** __________________________

source: You can see in this example, and in the previous flooding examples that we do not have every single building. In Jakarta we are confident that we have the majority of schools, hospitals etc. But around Merapi we only have a selection, most of which have no attributes, to make a scenario more useful a organised data collection is necessary!.
id: Anda dapat melihat pada contoh ini, dan pada contoh banjir sebelumnya bahwa kita tidak memiliki setiap bangunan individu. Di Jakarta kita yakin bahwa kita memiliki sekolah, rumah sakit, dan bangunan utama lainnya. Tapi di sekitar Merapi kita hanya memiliki beberapa bangunan dan kebanyakan tidak memiliki data atribut, untuk membuat skenario lebih nyata dan bermanfaat, dibutuhkan kegiatan pengumpulan data yang lebih terorganisir!

source: Earthquake
id: Gempa bumi

source: Indonesia’s location on the edges of the Pacific, Eurasian, and Australian tectonic plates makes it not only a site of numerous volcanoes but also frequent earthquakes. The hazard layer we are going to use for this example has been provided by Badan Geologi and |AIFDR|, |AusAID| and describes the shaking or Modified Mercalli Intensity (MMI) Scale.
id: Lokasi Indonesia yang berada pada tepi lempeng tektonik Pacific, Eurasia, dan Australia membuat Indonesia tidak hanya menjadi lokasi begitu banyak gunung api namun juga mengakibatakan begitu seringnya gempa bumi. Layer bahaya yang akan kita gunakan pada contoh ini telah disediakan oleh Badan Geologi dan |AIFDR|, |AusAID| dan mendeskripsikan goncangan atau skala Modified Mercalli Intensity (MMI).

source: This particular scenario is a modelled version of the 2009 Padang earthquake.
id: Skenario khusus ini merupakan versi gempa bumi pada tahun 2009 yang telah dimodelkan.

source: :menuselection:`File --> Open Projects`, browse to *Padang_earthquake.qgs*
id: :menuselection:`File --> Buka Proyek`, cari ke *Volcano_Indonesia.qgs*

source: You will see that there is 4 layers in the layer panel, :guilabel:`Click` on each of them to read the keywords in the |project_name| window
id: Anda akan melihat bahwa terdapat 4 layer pada kolom layer, :guilabel:`klik` pada setiap layer yang ada untuk melihat kata kunci pada jendela |project_name|

source: Make sure the only **people** checked is Source= AsiaPop
id: Pastikan hanya **penduduk** yang diperiksa bersumber dari = AsiaPop

source: In the **How many** drop box pick the top **people**.
id: Pada kotak **Berapa banyak** pilihlah **orang**.

source: Memory usage warning
id: Peringatan penggunaan memori

source: A warning message appears "You may not have sufficient free system memory to carry out the analysis. See the dock panel message for more information. Would you like to continue regardless?"
id: Pesan berisi peringatan muncul "Anda mungkin tidak memiliki memori yang cukup pada sistem Anda untuk melakukan analisis. Lihat pesan yang terdapat di kolom dock untuk informasi lebih lanjut. Apakah Anda ingin melanjutkan?"

source: :guilabel:`No`
id: :guilabel:`Tidak`

source: You will see in the |project_name| panel that there is a suggestion on how to continue: "Try zooming in to a smaller area or using a raster layer with a coarser resolution to speed up execution and reduce memory requirements. You could also try adding more RAM to your computer"
id: Anda akan melihat panel |project_name|dimana terdapat petunjuk bagaimana untuk melanjutkan : "Cobalah untuk memperbesar ke dalam area yang lebih kecil atau gunakan layer data raster dengan resolusi kasar untuk mempercepat pelaksanaan dan mengurangi kebutuhan memori. Anda juga bisa mencoba menambahkan RAM lebih pada komputer Anda"

source: You will recall that there is another 2 **people** layer, the difference is the size of the pixel, the one we are trying to run is 100 m by 100 m and the one we will run now is 1km by 1km. If the 1km population fails, the third **people** layer is our backup!
id: Anda akan diingatkan bahwa ada 2 lagi layer **penduduk**, perbedaannya terletak pada ukuran piksel, yang berukuran 100 m per 100 m akan kita coba jalankan nanti dan yang sedang kita jalankan sekarang adalah 1 km per 1 km. Jika jarak 1 km untuk populasi gagal, layer ketiga **penduduk** akan menjadi layer cadangan kita!

source: **Basically less pixels less memory need**
id: **Pada dasarnya semakin sedikit piksel semakin sedikit memori yang dibutuhkan**

source: :guilabel:`Check` the second “people” in the drop down menu - check the keywords to
id: :guilabel:`Pilih` layer “penduduk” ke-dua pada menu drop down - periksa juga kata kuncinya

source: confirm its the source is *AsiaPop 1km2*
id: Konfirmasi bahwa sumbernya berasal dari *AsiaPop 1km2*

source: :guilabel:`Click` on the drop down menu for the “Might”, this is the first |project_name| run where there are actually 2 impact functions that we can choose from!
id: :guilabel:`Klik` pada menu drop down untuk “Mungkin”, ini adalah |project_name| pertama yang dijalankan dengan 2 fungsi dampak yang dapat kita pilih!

source: :guilabel:`Select` the “Die or be displaced according to the pager model”
id: :guilabel:`Pilih` “Hilangkan atau gantikan sesuai dengan model pager”

source: This particular impact function was developed in Italy last November during a code sprint.
id: Fungsi dampak khusus ini dikembangkan di Italia November lalu.

source: :guilabel:`Print` |project_name|, :guilabel:`Save` accordingly
id: :guilabel:`Cetak` |project_name|, :guilabel:`Simpan`

source: How many people are estimated to die?
id: Berapa banyak orang yang diperkirakan mati?

source: **ANSWER** __________________________
id: **JAWAB** __________________________

source: How many people are estimated to be displaced?
id: Berapa banyak orang diperkirakan akan terlantar?

source: Analysis the Action list, how is this different to the action list for floods or volcanoes?
id: Menganalisis daftar tindakan, bagaimanakah perbedaan daftar tindakan untuk banjir dan gunung api?

source: Will a building fall down in an earthquake?
id: Akankah suatu bangunan roboh dalam suatu gempa bumi?

source: As we are all aware, its generally not the earthquake that kills its the collapsing buildings that kill the majority of the people. Hence understanding the structure of the building and how they may act under certain shaking is crucial in understanding the impact of an earthquake. Unfortunately earthquakes cover a large area, so mapping every structure in that area is extensive. In Padang the international |OSM| community assisted mapping, totalling roughly 95,000 structures.
id: Sebagaimana telah kita ketahui, bahwa sebenarnya bukan gempa bumi yang membunuh melainkan bangunan-bangunan yang roboh yang membunuh kebanyakan orang dalam suatu kejadian gempa. Karenanya pemahaman mengenai struktur bangunan dan bagaimana struktur bangunan akan bereaksi pada suatu goncangan gempa bumi merupakan hal yang penting dalam memahami dampak dari suatu gempa bumi. Sayangnya suatu gempa bumi meliputi wilayah yang cukup besar, jadi memetakan setiap struktur bangunan pada wilayah tersebut sangatlah luas. Di Padang komunitas OpenStreetMap Internasional membantu kegiatan pemetaan bangunan, total bangunan yang terpetakan kurang lebih 95,000 struktur.

source: Lets find out how they are affected by the modelled Padang 2009 earthquake.
id: Temukan bagaimana mereka terdampak berdasakan gempa Padang tahun 2009 yang telah dimodelkan.

source: :guilabel:`Uncheck` *people* in the **Layer List** and :guilabel:`Check` *building*
id: :guilabel:`Hapus centang` *penduduk* di dalam **daftar layer** dan :guilabel:`Centang` *bangunan*

source: Confirm that |project_name| window has the following:
id: Konfirmasi bahwa jendela |project_name|telah mengikuti:

source: an earthquake in Padang like in 2009
id: Gempa bumi di Padang seperti 2009

source: buildings
id: bangunan-bangunan

source: be affected
id: Terkena dampak

source: InaSAFE is design to zoom into the extent of impact zone, hence in a minute or so, it will automatically zoom into Padang.
id: InaSAFE dirancang untuk memperbesar hingga batas tepi koordinat dari area yang terkena dampak, karenanya dalam waktu sekejap InaSAFE akan secara otomatis melakukan perbesaran ke wilayah Padang.

source: Investigate the results, both by looking at the |project_name| results, and using the information tool to select a building.
id: Memeriksa hasil, baik dengan melihat pada hasil perhitungan |project_name|, dan menggunakan alat informasi untuk memilih menyorot suatu bangunan tertentu.

source: The 1992 Flores earthquake occurred on December 12, 1992 on the island of Flores in Indonesia. With a magnitude of 7.8, it was the largest and also the deadliest earthquake in 1992. This particular scenario is a modelled version of a Magnitude 8.1 earthquake generating a Tsunami that impact Maumere.
id: Gempa Flores 1992 terjadi pada tanggal 12 Desember 1992 di Pulau Flores, Indonesia. Dengan kekuatan 7.8, gempa ini merupakan gempa terbesar dan juga merupakan gempa bumi paling mematikan pada 1992. Skenario khusus ini merupakan versi permodelan dari gempa berkekuatan 8.1 yang menghasilkan Tsunami yang menerjang Maumere.

source: :menuselection:`File --> Open Projects`, browse to *Maumere_tsunami.qgs*
id: menuselection:`File --> Buka Proyek`, cari ke *Maumere_tsunami.qgs*

source: You will see that there is 2 layers in the layer panel, click on each of them to read the keywords in the |project_name| window.
id: Anda akan melihat bahwa terdapat 2 layer pada kolom layer Anda, klik pada setiap layer yang ada untuk melihat kata kunci pada jendela |project_name|.

source: The InaSAFE functionality for Tsunami and floods are very similar, however due to the force of the tsunami waves, the maximum depth of the water that would affect people and infrastructure is shallower.
id: Fungsionalitas InaSAFE untuk Tsunami dan banjir sangat mirip, namun karena kekuatan gelombang tsunami, kedalaman air maksimum yang akan dapat berdampak pada penduduk dan infrastruktur cukup dangkal.

source: Confirm that |project_name| window has the following: boxes.
id: Konfirmasi bahwa jendela |project_name| memiliki: Kotak-kotak.

source: A tsunami in Maumere (Mw 8.1)
id: Tsunami di Maumere (Mw 8.1)

source: be flooded
id: Terkena banjir

source: :guilabel:`...` to change the water level for evacuation from 1m to :kbd:`0.5m`
id: :guilabel:`...` untuk mengubah ketinggian air untuk evakuasi dari 1m ke :kbd:`0.5m`

source: Map Canvas Extent
id: Batas koordinat tepi kanvas peta

source: We are going to run again, but only on a 1/4 of the extent, :guilabel:`Zoom In`
id: Kita akan menjalankan prosesnya kembali, namun hanya 1/4 dari keseluruhan, :guilabel:`Perbesar`

source: You will now see that your results are different than the original InaSAFE runs, this is because your extent window determines the area in which you are analysing the data. The next chapter will show you how to change this if needed.
id: Anda sekarang akan melihat bahwa hasil Anda berbeda dengan hasil perhitungan menggunakan InaSAFE sebelumnya, hal ini karena batas koordinat tepi jendela Anda menentukan wilayah yang akan Anda olah dan analisis datanya. Bab selanjutnya akan menunjukkan kepada Anda bagaimana mengganti dan memodifikasi hal ini jika diperlukan.

source: The population coverage coastline in this zoomed in area is different to the hazard coastline, this can be a significant problem when your population dataset does not reflect the same extents as reality. Through OpenLayers select Bing imagery and examine the two layers (people and tsunami). Always quality assure your input layers.
id: Populasi di area garis pantai di daerah yang diperbesar ini berbeda dengan garis pantai pada data ancaman bencananya. Ini bisa menjadi masalah yang signifikan ketika dataset populasi Anda tidak mencerminkan luasan yang sama pada realitas. Melalui Openlayers pilih Citra Bing dan periksa dua layer (penduduk dan tsunami). Selalu jamin kualitas dari layer yang Anda input.

source: OpenStreetMap Downloader
id: Mendownload OpenStreetMap

source: Notice that there is no building footprints in this project file, that is because we are going to download it straight from |OSM| server.
id: Perhatikan bahwa tidak ada bangunan dalam file proyek ini karena kita akan men-download langsung dari Server |OSM|.

source: Highlight the tsunami layer and :guilabel:`Zoom to Layer`
id: Sorot layer tsunami dan :guilabel:`Perbesar ke Layer`

source: The extent of the **Map Canvas** will automatically be added to the Bounding box.
id: Jangkauan luas **Kanvas Peta** secara otomatis akan ditambahkan ke area batas kotak.

source: Confirm the location of the output directory, :guilabel:`OK`
id: Konfirmasi lokasi dari direktori output, :guilabel:`OK`

source: On inspection of the buildings, they don't really have many attributes at all, this area was digitised for this analysis, field surveys are still to be conducted.
id: Pada pemeriksaan dari bangunan, bangunan tersebut tidak benar-benar memiliki banyak atribut sama sekali, daerah ini didigitalkan untuk analisis, survei lapangan masih tetap harus dilakukan.
