Repository: AIFDR/inasafe-doc
Catalog: docs/i18n/*/LC_MESSAGES/training/socialisation/run_basic_inasafe.po
Languages: id

source: Run Basic |project_name|
id: Menjalankan |project_name| Dasar

source: **Learning Objectives:**
id: **Tujuan Pembelajaran**

source: Run |project_name| using flood and population models and examine the results
id: Menjalankan |project_name| menggunakan permodelan banjir dan penduduk serta memeriksa hasil

source: Create an impact map
id: Membuat sebuah peta dampak

source: Modify the threshold (parameters) of an impact function
id: Memodifikasi ambang batas (parameter) dari sebuah fungsi dampak

source: Run |project_name| using flood and building models and examine the results
id: Menjalankan |project_name| menggunakan permodelan banjir dan bangunan serta memeriksa hasil

source: **Data for this module**
id: **Data untuk modul ini**

source: Download the InaSAFEv2.0.zip from `InaSAFE Training Data Packages <http://data.inasafe.org/TrainingDataPackages/>`_ or it will be provided to you during the training.
id: Unduh InaSAFEv2.0.zip dari `Paket Data Latihan InaSAFE <http://data.inasafe.org/TrainingDataPackages/>`_ atau nanti akan disediakan untuk Anda pada saat pelatihan.

source: Introduction
id: Pengantar

source: In this section we will run |project_name| using a scenario in Jakarta, Indonesia to determine the impact of a flood model on both Jakarta's population and buildings.
id: Pada bagian ini kita akan menjalankan |project_name| menggunakan sebuah skenario di Jakarta, Indonesia untuk menentukan dampak dari sebuah model banjir Jakarta terhadap populasi dan bangunan.

source: Go to :menuselection:`Project --> Open`.
id: Pergi ke :menuselection:`Project --> Open`.

source: If you have been working in QGIS previously a message box will appear asking if you want to save the current project. Click :guilabel:`Discard` to exit your current work without saving.
id: Jika Anda telah menggunakan QGIS sebelumnya sebuah kotak pesan akan muncul untuk menanyakan apabila Anda ingin menyimpan proyek terkini. Klik :guilabel:`Discard` untuk keluar dari proyek terkini Anda tanpa menyimpannya.

source: Navigate to the :file:`InaSAFE_project` folder and select :file:`Jakarta_floods.qgs`. Click :guilabel:`Open`.
id: Arahkan pada folder :file:`InaSAFE_project` dan pilih :file:`Jakarta_floods.qgs`. Klik :guilabel:`Open`.

source: The project looks something like this:
id: Proyek akan terlihat seperti ini:

source: Number of population which need evacuation
id: Jumlah penduduk yang membutuhan evakuasi

source: The |project_name| panel has the first three drop-down menus filled in already:
id: Panel |project_name| memiliki tiga menu *drop-down* yang sudah terisi:

source: a flood similar to the 2007 Jakarta event
id: Banjir yang sama dengan peristiwa di Jakarta pada tahun 2007

source: people
id: orang

source: Need evacuation
id: Perlu evakuasi

source: The |project_name| panel may instead read as follows:
id: Panel |project_name| mungkin akan tertulis sebagai berikut:

source: buildings
id: bangunan-bangunan

source: Be flooded
id: Terkena banjir

source: If so, click on buildings and change it to people. When you change this field, the impact function is automatically changed between :guilabel:`Be flooded` and :guilabel:`Need evacuation`, based on the combination of hazard and exposure layers.
id: Jika demikian, klik pada bangunan kemudian ubah ke populasi. ketika Anda mengganti kolom ini, fungsi dampak akan berubah secara otomatis antara :guilabel:`Terkena banjir` dan :guilabel:`Membutuhkan evakuasi`, berdasarkan kombinasi dari layer ancaman dan paparan.

source: Let's run this scenario first. Click :guilabel:`Run` in the lower right corner of the |project_name| panel.
id: Mari kita jalankan skenario pertama. Klik :guilabel:`Hitung` pada bagian kanan bawah di panel |project_name|.

source: A new layer should appear in the layer panel called :guilabel:`Population which need evacuation`.
id: Sebuah layer baru seharusnya muncul pada panel layer dengan nama :guilabel:`Penduduk yang butuh evakuasi`.

source: In the |project_name| panel we now see text and statistics. The details of this report are explained below.
id: Pada panel |project_name| sekarang kita melihat teks dan statistik. Penjelasan dari detail laporan ini adalah sebagai berikut.

source: **People:** |project_name| shows approximately how many people are located in water deeper than one metre. It is assumed that all of these people will need to evacuate their homes. The threshold of one metre can be changed (see Changing threshold section below).
id: **Penduduk:** |project_name| menunjukkan perkiraan berapa banyak penduduk yang berada di lokasi pada ketinggian banjir lebih dari satu meter. Perkiraan jumlah ini diasumsikan bahwa seluruh penduduk tersebut harus dievakuasi dari tempat tinggal mereka. Ambang batas ketinggian satu meter dapat diubah (lihat bagian Mengubah ambang batas di bawah ini).

source: **Needs per week** is calculated using the above number of evacuated people to estimate the amount of food, water and other products that the refugees will need to survive. The default figures are based on Indonesian policy.
id: **Kebutuhan minimum:** dihitung menggunakan angka penduduk yang dievakuasi untuk memperkirakan jumlah makanan, air, dan produk lainnya yang akan akan dibutuhkan pengungsi untuk bertahan. Angka ini berdasarkan kebijakan di Indonesia.

source: **Action checklist** is designed to make disaster managers think about what they need to do to prepare for the event.
id: **Daftar tindakan** dirancang untuk membuat manager penanggulangan bencana berpikir mengenai apa yang mereka butuhkan untuk mempersiapkan peristiwa tersebut.

source: **Notes** explains the total people in the map canvas, the threshold of water depth that requires evacuation and the source of the minimum needs assessment.
id: **Catatan** menjelaskan jumlah penduduk di *kanvas peta*, ambang batas dari kedalaman air yang memerlukan tindakan evakuasi dan sumber dari penilaian kebutuhan minimum.

source: **Detailed gender and age report:** Statistical breakdown of the number of females, minimum needs for women's hygiene and pregnant women, as well as a statistical breakdown of Youth, Adults and Elderly.
id: ** Detil laporan jenis kelamin dan usia:** Rincian statistik jumlah wanita, dan ditambah kebutuhan minimum untuk kesehatan wanita dan wanita hamil, serta laporan statistik Pemuda, Dewasa dan Lansia.

source: Print Results
id: Mencetak Hasil

source: Click :guilabel:`Print...` at the bottom of the |project_name| panel.
id: Klik :guilabel:`Cetak...` di bagian bawah panel |project_name|.

source: You can choose whether you want print the whole analysis or the current map extent. You also can pick an existing print template or you can navigate to your own QGIS template (.qpt). For more information about printing click :guilabel:`Help` in the print window.
id: Anda dapat memilih apakah Anda ingin mencetak seluruh analisis atau jangkauan saat ini. Anda juga dapat memilih *template* disain cetak yang telah tersedia atau Anda dapat mengarahkan ke *template* QGIS Anda sendiri (.qpt). Untuk informasi lebih lanjut mengenai pencetakan, klik :guilabel:`Bantuan` pada jendela cetak.

source: A window will pop up as shown below. Ensure that :guilabel:`Analysis extent` is selected under :guilabel:`Area to print` and :guilabel:`inasafe...` is chosen under :guilabel:`Template to use`. Click :guilabel:`Open PDF`.
id: Sebuah jendela seperti di bawah ini akan muncul. Pastikan bahwa :guilabel:`Analysis extent` teraktivasi dan :guilabel:`inasafe...` terpilih pada :guilabel:`Template to use`. Klik :guilabel:`Open PDF`.

source: Navigate to where you would like to save the PDF and type :file:`Jakartaflood_evacuation_1m`. Click :guilabel:`Save`.
id: Arahkan dimana Anda akan menyimpan pdf, dan ketik :kbd:`Evakuasi_Banjir_Jakarta_1m` :guilabel:`Simpan`

source: Two PDFs will be generated, which contain a map and a table of information about the impact.
id: Dua file PDF akan dihasilkan dimana masing-masing berisi informasi sebuah peta dan sebuah informasi dalam bentuk tabel mengenai dampak.

source: In a future version of |project_name| the developers will make improvements to the layout of these PDF files. *If you have time during this course please provide us with your ideas on how the print map and table should look!*
id: Dalam versi baru |project_name| para pengembang akan terfokus pada tata letak pdf ini. *Jika Anda memiliki waktu selama pelatihan ini silahkan berikan masukan kepada kami ide-ide Anda tentang bagaimana peta dan tabel ini harus tercetak!*

source: Changing threshold
id: Mengubah ambang batas

source: What if the disaster manager decides that people should be evacuated if they are in 80cm or more of water? In this case we will need to change the water threshold at which level people should be evacuated.
id: Bagaimana jika manager kebencanaan memutuskan bahwa penduduk harus dievakuasi jika mereka berada pada wilayah yang tergenang lebih dari 80cm? Dalam kasus tersebut, kita perlu merubah pengaturan ambang batas dimana masyarakat harus dievakuasi pada ketinggian air tertentu.

source: Click :guilabel:`Show question form` found at the top of the |project_name| panel.
id: Klik :guilabel:`Show question form` yang dapat ditemukan pada bagian atas |project_name|.

source: To change the impact function click the :guilabel:`Options...` button next to :guilabel:`Need evacuation`.
id: Untuk merubah fungsi dampak klik pada tombol :guilabel:`Options...` di sebelah tombol :guilabel:`Need evacuation`.

source: Type :kbd:`0.8` in the :guilabel:`Thresholds` field.
id: Ketik :kbd:`0.8` pada baris :guilabel:`Thresholds`

source: Click :guilabel:`OK`.
id: Klik :guilabel:`OK`.

source: Click :guilabel:`Run` to process the scenario with the new water threshold.
id: Klik :guilabel:`Run` untuk menjalankan skenario dengan ambang batas ketinggian air yang baru.

source: When the function completes, take a look at the new numbers in the |project_name| panel. How have they changed?
id: Ketika fungsi dampak selesai dijalankan, lihatlah pada jumlah yang baru pada panel |project_name|. Apakah jumlahnya telah berubah?

source: Click :guilabel:`Print...` at the bottom the |project_name| panel.
id: Klik :guilabel:`Cetak` pada bagian bawah panel |project_name|.

source: Navigate to where you would like to save the PDF and type :file:`Jakartaflood_evacuation_80cm`. Click :guilabel:`Save`.
id: Arahkan dimana Anda akan menyimpan pdf, dan ketik :file:`Jakartaflood_evacuation_80cm`. Klik :guilabel:`Save`.

source: Next we will run the |project_name| analysis on buildings, but first let's turn some layers off. In the Layers panel there should now be five layers. Uncheck everything except:
id: Selanjutnya kita akan menjalankan analisis |project_name| pada bangunan, tetapi sebelumnya mari kita non-aktifkan beberapa layer. Pada panel layer seharusnya terdapat lima buah layer yang aktif. Non-aktifkan semuanya kecuali:

source: Buildings Affected
id: Bangunan yang terkena dampak

source: Confirm that the |project_name| panel is set to query how many buildings might be flooded.
id: Pastikan bahwa panel |project_name| telah diatur untuk menghitung berapa banyak bangunan yang mungkin akan terendam banjir.

source: Notice that if you click on the drop-down list with :guilabel:`Buildings`, the people option is not available. This is because :guilabel:`people` is not checked in the Layers panel.
id: Perhatikan bahwa jika Anda klik pada daftar pilihan dengan :guilabel:`Buildings`, pengaturan penduduk tidak tersedia. Ini dikarenakan layer :guilabel:`people` belum diaktifkan pada panel layer.

source: If you want to be able to select layers within the |project_name| panel that are not checked in the Layers panel you can modify the |project_name| options. For more information on |project_name| options, see the user documentation here: :doc:`../../user-docs/application-help/options`. The options menu is also discussed later in this tutorial in :doc:`helpful_hints_and_tips`.
id: Jika Anda menginginkan untuk memilih layer pada panel |project_name| yang tidak aktif pada panel layer, Anda dapat memodifikasi pengaturan |project_name|. Untuk informasi lebih lanjut pada pengaturan |project_name|, lihat dokumentasi pengguna di sini: :doc:`../../user-docs/application-help/options`. Menu pengaturan juga akan dibahas di bagian selanjutnya pada panduan ini :doc:`helpful_hints_and_tips`.

source: Click :guilabel:`Run` to process the new scenario.
id: Klik :guilabel:`Run` untuk menjalankan skenario yang baru.

source: In this scenario approximately 1,434 buildings could be affected out of 31,515 buildings. Your results may very depending on updates that have been made to the exposure data.
id: Pada skenario ini terdapat sekitar 1,434 bangunan yang mungkin terdampak dari jumlah total bangunan 31,515. Hasil Anda mungkin akan berbeda tergantung dari pembaharuan yang telah dibuat pada data eksposur.

source: Due to the provincial BPBD work in OpenStreetMap all important buildings in this area have been mapped (and then some!).
id: Dikarenakan BPBD tingkat provinsi telah bekerja menggunakan OpenStreetMap, seluruh bangunan penting (dan beberapa jenis bangunan lainnya) pada wilayah ini telah dipetakan.

source: Important buildings are defined as:
id: Bangunan penting didefinisikan sebagai:

source: Clinic/doctors
id: Klinik/dokter

source: Fire stations
id: Kantor Pemadam Kebakaran

source: Government buildings
id: Bangunan pemerintah

source: Hospitals
id: Rumah Sakit

source: Places of worship
id: Tempat ibadah

source: Police stations
id: Kantor Polisi

source: Residential buildings
id: Bangunan permukiman

source: Schools
id: Sekolah

source: Sports facilities
id: Fasilitas olahraga

source: Universities/colleges
id: Universitas/kampus

source: In the |project_name| panel we now see text and statistics. The details of this report are explained here:
id: Pada panel |project_name| sekarang kita melihat teks dan statistik. Penjelasan dari detail laporan ini adalah sebagai berikut.

source: **Action Checklist:** A different set of actions have been identified to relate to structures.
id: **Daftar Tindakan:** Beberapa set tindakan yang telah diidentifikasi terkait dengan struktur.

source: **Note:** Similar to the last |project_name| analysis, this analysis also assumes impact is in water above one metre.
id: **Catatan:** Seperti analisis |project_name| terakhir, analisis ini juga mengasumsikan fungsi dampak apabila ketinggian air di atas 1 meter.

source: **Detailed building type report:** This is a breakdown of important infrastructure. When you choose to aggregate (we will do this later) this table will show the number of buildings by aggregation boundary.
id: **Laporan detail jenis bangunan:** Ini adalah rincian infrastruktur penting, ketika Anda memilih untuk melakukan agregasi (kita akan melakukan ini nanti) tabel ini akan menunjukkan jumlah bangunan dengan agregasi batas wilayah.

source: **Source** shows the source of the hazard and exposure datasets.
id: **Sumber:** menunjukan sumber data ancaman dan eksposur.

source: Navigate to where you would like to save the PDF and type :file:`Jakartaflood_inundated_1m`. Click :guilabel:`Save`.
id: Arahkan ke tempat file PDF tersebut akan disimpan dan ketik :file:`Jakartaflood_inundated_1m`. Klik :guilabel:`Simpan`.

source: (Optional) Change the threshold to 0.8
id: (Pilihan) Mengubah ambang batas ke 0.8

source: You may try running this scenario again with a water threshold of 0.8 metres.
id: Anda dapat mencoba menjalankan skenario ini lagi dengan ambang batas ketinggian air 0.8 meter.

source: Check that |project_name| has the following in the drop-down boxes:
id: Pastikan bahwa |project_name| memiliki pilihan berikut ini pada kotak drop-down:

source: Buildings
id: Bangunan

source: To change the impact function click the :guilabel:`Options...` button on the |project_name| panel.
id: Untuk merubah fungsi dampak klik pada tombol :guilabel:`Pilihan...` pada panel |project_name|.

source: Click :guilabel:`Print` and save PDFs the same way as before.
id: Klik :guilabel:`Cetak` dan simpan sebagai PDF sama seperti sebelumnya.

source: :ref:`Go to next module --> <inasafe-in-more-detail>`
id: :ref:`Modul selanjutnya --> <inasafe-in-more-detail>`
